000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.           PPCAL14B.
000300*AUTHOR.   14-05-22  9 AM   DDS TEAM.
000400*REMARKS.                CMS.
000500 DATE-COMPILED.
000600 ENVIRONMENT DIVISION.
000700 CONFIGURATION SECTION.
000800 SOURCE-COMPUTER.            IBM-370.
000900 OBJECT-COMPUTER.            IBM-370.
001000 INPUT-OUTPUT  SECTION.
001100 FILE-CONTROL.
001200
001300 DATA DIVISION.
001400 FILE SECTION.
001500
001600 WORKING-STORAGE SECTION.
001700 01  W-STORAGE-REF                  PIC X(46)  VALUE
001800     'PPCAL14B      - W O R K I N G   S T O R A G E'.
001900 01  CAL-VERSION                    PIC X(05)  VALUE 'C14.B'.
002000 01  HMO-FLAG                       PIC X      VALUE 'N'.
002100 01  HMO-TAG                        PIC X      VALUE SPACE.
002200 01  OUTLIER-RECON-FLAG             PIC X      VALUE 'N'.
002300 01  TEMP-RELIEF-FLAG               PIC X      VALUE 'N'.
002400 01  NON-TEMP-RELIEF-PAYMENT        PIC 9(07)V9(02) VALUE ZEROES.
002500 01  WK-H-OPER-DOLLAR-THRESHOLD     PIC 9(07)V9(09) VALUE ZEROES.
002600 01  WK-LOW-VOL25PCT                PIC 99V999999 VALUE 01.000.
002700 01  WK-LOW-VOL-ADDON               PIC 9(07)V9(02).
002800 01  WK-MODEL1-BUNDLE-DISPRCNT      PIC S9(01)V9(03).
002900 01  R1                             PIC S9(04) COMP SYNC.
003000 01  R2                             PIC S9(04) COMP SYNC.
003100 01  R3                             PIC S9(04) COMP SYNC.
003200 01  R4                             PIC S9(04) COMP SYNC.
003300 01  H-OPER-DSH-SCH                 PIC 9(01)V9(04).
003400 01  H-OPER-DSH-RRC                 PIC 9(01)V9(04).
003500
003600***************************************************************
003700**************YEARCHANGE 2014.0 *******************************
003800* TABLE 1                                                     *
003900* NATIONAL (69.6% LABOR SHARE/30.4% NONLABOR SHARE)
004000* PUERTO RICO  (63.2% LABOR SHARE/36.8% NONLABOR SHARE)
004100*    (FULL    UPDATE                                          *
004200*    (QUALITY = 1 WAGE INDEX > 1)                             *
004300***************************************************************
004400 01  TB1-RATE-TABLE.
004500     02  TB1-RATE-WORK.
004600*RATE 20131001 REGION  LABOR AND NON-LABOR RATES
004700*                  R3=1     /     R3=2
004800*               LARGE URBAN / OTHER URBAN
004900*               LABOR / NON / LABOR / NON
005000*                     /LABOR/       /LABOR
005100*             --------------------------------------------
005200         05  FILLER PIC X(08) VALUE '20131001'.
005300         05  TB1-NAT    PIC X(30) VALUE
005400            ' 0373771 163257 0373771 163257'.
005500         05  TB1-PR     PIC X(30) VALUE
005600            ' 0160890 093682 0160890 093682'.
005700         05  TB1-NATPR  PIC X(30) VALUE
005800            ' 0373771 163257 0373771 163257'.
005900***************************************************************
006000     02  TB1-RATE-TAB REDEFINES TB1-RATE-WORK.
006100         05  TB1-RATE-PERIOD            OCCURS 1.
006200             10  TB1-RATE-EFF-DATE      PIC X(08).
006300             10  TB1-REG-NAT            OCCURS 3.
006400                 15  TB1-LARGE-OTHER    OCCURS 2.
006500                     20  FILLER         PIC X(01).
006600                     20  TB1-REG-LABOR  PIC 9(05)V9(02).
006700                     20  FILLER         PIC X(01).
006800                     20  TB1-REG-NLABOR PIC 9(04)V9(02).
006900
007000***************************************************************
007100************YEARCHANGE 2014.0 *********************************
007200* TABLE 2                                                     *
007300* NATIONAL (69.6% LABOR SHARE/30.4% NONLABOR SHARE)
007400* PUERTO RICO  (63.2% LABOR SHARE/36.8% NONLABOR SHARE)
007500*    (REDUCED UPDATE                                          *
007600*    (QUALITY NOT = 1 WAGE INDEX > 1)                         *
007700***************************************************************
007800 01  TB2-RATE-TABLE.
007900     02  TB2-RATE-WORK.
008000*RATE 20131001 REGION  LABOR AND NON-LABOR RATES
008100*                  R3=1     /     R3=2
008200*               LARGE URBAN / OTHER URBAN
008300*               LABOR / NON / LABOR / NON
008400*                     /LABOR/       /LABOR
008500*             --------------------------------------------
008600         05  FILLER PIC X(08) VALUE '20131001'.
008700         05  TB2-NAT    PIC X(30) VALUE
008800            ' 0366421 160046 0366421 160046'.
008900         05  TB2-PR     PIC X(30) VALUE
009000            ' 0160890 093682 0160890 093682'.
009100         05  TB2-NATPR  PIC X(30) VALUE
009200            ' 0373771 163257 0373771 163257'.
009300***************************************************************
009400     02  TB2-RATE-TAB REDEFINES TB2-RATE-WORK.
009500         05  TB2-RATE-PERIOD             OCCURS 1.
009600             10  TB2-RATE-EFF-DATE       PIC X(08).
009700             10  TB2-REG-NAT             OCCURS 3.
009800                 15  TB2-LARGE-OTHER     OCCURS 2.
009900                     20  FILLER          PIC X(01).
010000                     20  TB2-REG-LABOR   PIC 9(05)V9(02).
010100                     20  FILLER          PIC X(01).
010200                     20  TB2-REG-NLABOR  PIC 9(04)V9(02).
010300***************************************************************
010400************YEARCHANGE 2014.0 *********************************
010500* TABLE 3                                                     *
010600*    (62% LABOR SHARE/38% NONLABOR SHARE)                     *
010700*    (FULL UPDATE                                             *
010800*    (QUALITY = 1 WAGE INDEX <= 1)                            *
010900***************************************************************
011000 01  TB3-RATE-TABLE.
011100     02  TB3-RATE-WORK.
011200*RATE 20131001 REGION  LABOR AND NON-LABOR RATES
011300*                  R3=1     /     R3=2
011400*               LARGE URBAN / OTHER URBAN
011500*               LABOR / NON / LABOR / NON
011600*                     /LABOR/       /LABOR
011700*             --------------------------------------------
011800         05  FILLER PIC X(08) VALUE '20131001'.
011900         05  TB3-NAT    PIC X(30) VALUE
012000            ' 0332957 204071 0332957 204071'.
012100         05  TB3-PR     PIC X(30) VALUE
012200            ' 0157835 096737 0157835 096737'.
012300         05  TB3-NATPR  PIC X(30) VALUE
012400            ' 0332957 204071 0332957 204071'.
012500****************************************************************
012600     02  TB3-RATE-TAB REDEFINES TB3-RATE-WORK.
012700         05  TB3-RATE-PERIOD            OCCURS 1.
012800             10  TB3-RATE-EFF-DATE      PIC X(08).
012900             10  TB3-REG-NAT            OCCURS 3.
013000                 15  TB3-LARGE-OTHER    OCCURS 2.
013100                     20  FILLER         PIC X(01).
013200                     20  TB3-REG-LABOR  PIC 9(05)V9(02).
013300                     20  FILLER         PIC X(01).
013400                     20  TB3-REG-NLABOR PIC 9(04)V9(02).
013500
013600***************************************************************
013700**********YEARCHANGE 2014.0 ***********************************
013800* TABLE 4                                                     *
013900*    (62% LABOR SHARE/38% NONLABOR SHARE)                     *
014000*    (REDUCED UPDATE                                          *
014100*    (QUALITY NOT = 1 WAGE INDEX <=1)                         *
014200***************************************************************
014300 01  TB4-RATE-TABLE.
014400     02  TB4-RATE-WORK.
014500*RATE 20131001 REGION  LABOR AND NON-LABOR RATES
014600*                  R3=1     /     R3=2
014700*               LARGE URBAN / OTHER URBAN
014800*               LABOR / NON / LABOR / NON
014900*                     /LABOR/       /LABOR
015000*             --------------------------------------------
015100         05  FILLER PIC X(08) VALUE '20131001'.
015200         05  TB4-NAT    PIC X(30) VALUE
015300            ' 0326410 200057 0326410 200057'.
015400         05  TB4-PR     PIC X(30) VALUE
015500            ' 0157835 096737 0157835 096737'.
015600         05  TB4-NATPR  PIC X(30) VALUE
015700            ' 0332957 204071 0332957 204071'.
015800***************************************************************
015900     02  TB4-RATE-TAB REDEFINES TB4-RATE-WORK.
016000         05  TB4-RATE-PERIOD             OCCURS 1.
016100             10  TB4-RATE-EFF-DATE       PIC X(08).
016200             10  TB4-REG-NAT             OCCURS 3.
016300                 15  TB4-LARGE-OTHER     OCCURS 2.
016400                     20  FILLER          PIC X(01).
016500                     20  TB4-REG-LABOR   PIC 9(05)V9(02).
016600                     20  FILLER          PIC X(01).
016700                     20  TB4-REG-NLABOR  PIC 9(04)V9(02).
016800
016900***************************************************************
017000*  TABLE 5 FROM ANNUAL IPPS FINAL RULE
017100***************************************************************
017200 01  WK-DRGX-EFF-DATE      PIC X(08) VALUE '20131001'.
017300 01  PPS-DRG-TABLE.
017400     02  WK-DRG-DATA.
017500****** 08/01/2013 **********
017600         05  FILLER   PIC X(57)  VALUE
017700     '001 253518 283       359       HEART TRANSPLANT OR IMPLAN'.
017800         05  FILLER   PIC X(57)  VALUE
017900     '002 152738 159       186       HEART TRANSPLANT OR IMPLAN'.
018000         05  FILLER   PIC X(57)  VALUE
018100     '003 176369 272       332  Y    ECMO OR TRACH W MV 96+ HRS'.
018200         05  FILLER   PIC X(57)  VALUE
018300     '004 109288 203       247  Y    TRACH W MV 96+ HRS OR PDX '.
018400         05  FILLER   PIC X(57)  VALUE
018500     '005 104214 151       201       LIVER TRANSPLANT W MCC OR '.
018600         05  FILLER   PIC X(57)  VALUE
018700     '006 047639 079       090       LIVER TRANSPLANT W/O MCC  '.
018800         05  FILLER   PIC X(57)  VALUE
018900     '007 091929 154       179       LUNG TRANSPLANT           '.
019000         05  FILLER   PIC X(57)  VALUE
019100     '008 051527 095       110       SIMULTANEOUS PANCREAS/KIDN'.
019200         05  FILLER   PIC X(57)  VALUE
019300     '010 041554 088       103       PANCREAS TRANSPLANT       '.
019400         05  FILLER   PIC X(57)  VALUE
019500     '011 047246 114       140       TRACHEOSTOMY FOR FACE,MOUT'.
019600         05  FILLER   PIC X(57)  VALUE
019700     '012 032291 083       098       TRACHEOSTOMY FOR FACE,MOUT'.
019800         05  FILLER   PIC X(57)  VALUE
019900     '013 021647 057       065       TRACHEOSTOMY FOR FACE,MOUT'.
020000         05  FILLER   PIC X(57)  VALUE
020100     '014 106157 207       262       ALLOGENEIC BONE MARROW TRA'.
020200         05  FILLER   PIC X(57)  VALUE
020300     '016 060304 181       195       AUTOLOGOUS BONE MARROW TRA'.
020400         05  FILLER   PIC X(57)  VALUE
020500     '017 042906 099       132       AUTOLOGOUS BONE MARROW TRA'.
020600         05  FILLER   PIC X(57)  VALUE
020700     '020 093897 143       174       INTRACRANIAL VASCULAR PROC'.
020800         05  FILLER   PIC X(57)  VALUE
020900     '021 064458 119       134       INTRACRANIAL VASCULAR PROC'.
021000         05  FILLER   PIC X(57)  VALUE
021100     '022 047113 055       073       INTRACRANIAL VASCULAR PROC'.
021200         05  FILLER   PIC X(57)  VALUE
021300     '023 051587 080       112  Y    CRANIO W MAJOR DEV IMPL/AC'.
021400         05  FILLER   PIC X(57)  VALUE
021500     '024 037121 045       066  Y    CRANIO W MAJOR DEV IMPL/AC'.
021600         05  FILLER   PIC X(57)  VALUE
021700     '025 044422 078       101  Y    CRANIOTOMY & ENDOVASCULAR '.
021800         05  FILLER   PIC X(57)  VALUE
021900     '026 029842 050       065  Y    CRANIOTOMY & ENDOVASCULAR '.
022000         05  FILLER   PIC X(57)  VALUE
022100     '027 022505 026       034  Y    CRANIOTOMY & ENDOVASCULAR '.
022200         05  FILLER   PIC X(57)  VALUE
022300     '028 054339 096       123  Y Y  SPINAL PROCEDURES W MCC   '.
022400         05  FILLER   PIC X(57)  VALUE
022500     '029 030782 046       062  Y Y  SPINAL PROCEDURES W CC OR '.
022600         05  FILLER   PIC X(57)  VALUE
022700     '030 018091 025       033  Y Y  SPINAL PROCEDURES W/O CC/M'.
022800         05  FILLER   PIC X(57)  VALUE
022900     '031 039460 077       110  Y    VENTRICULAR SHUNT PROCEDUR'.
023000         05  FILLER   PIC X(57)  VALUE
023100     '032 019780 034       049  Y    VENTRICULAR SHUNT PROCEDUR'.
023200         05  FILLER   PIC X(57)  VALUE
023300     '033 015226 020       025  Y    VENTRICULAR SHUNT PROCEDUR'.
023400         05  FILLER   PIC X(57)  VALUE
023500     '034 034145 047       069       CAROTID ARTERY STENT PROCE'.
023600         05  FILLER   PIC X(57)  VALUE
023700     '035 021781 021       031       CAROTID ARTERY STENT PROCE'.
023800         05  FILLER   PIC X(57)  VALUE
023900     '036 017224 013       015       CAROTID ARTERY STENT PROCE'.
024000         05  FILLER   PIC X(57)  VALUE
024100     '037 030641 055       079       EXTRACRANIAL PROCEDURES W '.
024200         05  FILLER   PIC X(57)  VALUE
024300     '038 015958 024       035       EXTRACRANIAL PROCEDURES W '.
024400         05  FILLER   PIC X(57)  VALUE
024500     '039 010452 014       016       EXTRACRANIAL PROCEDURES W/'.
024600         05  FILLER   PIC X(57)  VALUE
024700     '040 037851 083       110  Y Y  PERIPH/CRANIAL NERVE & OTH'.
024800         05  FILLER   PIC X(57)  VALUE
024900     '041 021731 050       064  Y Y  PERIPH/CRANIAL NERVE & OTH'.
025000         05  FILLER   PIC X(57)  VALUE
025100     '042 018616 026       034  Y Y  PERIPH/CRANIAL NERVE & OTH'.
025200         05  FILLER   PIC X(57)  VALUE
025300     '052 014102 040       053       SPINAL DISORDERS & INJURIE'.
025400         05  FILLER   PIC X(57)  VALUE
025500     '053 008746 027       033       SPINAL DISORDERS & INJURIE'.
025600         05  FILLER   PIC X(57)  VALUE
025700     '054 013195 041       055  Y    NERVOUS SYSTEM NEOPLASMS W'.
025800         05  FILLER   PIC X(57)  VALUE
025900     '055 010100 031       042  Y    NERVOUS SYSTEM NEOPLASMS W'.
026000         05  FILLER   PIC X(57)  VALUE
026100     '056 017368 053       071  Y    DEGENERATIVE NERVOUS SYSTE'.
026200         05  FILLER   PIC X(57)  VALUE
026300     '057 009841 036       047  Y    DEGENERATIVE NERVOUS SYSTE'.
026400         05  FILLER   PIC X(57)  VALUE
026500     '058 016027 054       071       MULTIPLE SCLEROSIS & CEREB'.
026600         05  FILLER   PIC X(57)  VALUE
026700     '059 010399 040       049       MULTIPLE SCLEROSIS & CEREB'.
026800         05  FILLER   PIC X(57)  VALUE
026900     '060 007899 031       037       MULTIPLE SCLEROSIS & CEREB'.
027000         05  FILLER   PIC X(57)  VALUE
027100     '061 027316 058       075       ACUTE ISCHEMIC STROKE W US'.
027200         05  FILLER   PIC X(57)  VALUE
027300     '062 018561 042       049       ACUTE ISCHEMIC STROKE W US'.
027400         05  FILLER   PIC X(57)  VALUE
027500     '063 014685 030       034       ACUTE ISCHEMIC STROKE W US'.
027600         05  FILLER   PIC X(57)  VALUE
027700     '064 017417 047       063  Y    INTRACRANIAL HEMORRHAGE OR'.
027800         05  FILLER   PIC X(57)  VALUE
027900     '065 010776 035       043  Y    INTRACRANIAL HEMORRHAGE OR'.
028000         05  FILLER   PIC X(57)  VALUE
028100     '066 007566 025       029  Y    INTRACRANIAL HEMORRHAGE OR'.
028200         05  FILLER   PIC X(57)  VALUE
028300     '067 014172 041       053       NONSPECIFIC CVA & PRECEREB'.
028400         05  FILLER   PIC X(57)  VALUE
028500     '068 008582 025       031       NONSPECIFIC CVA & PRECEREB'.
028600         05  FILLER   PIC X(57)  VALUE
028700     '069 006948 022       026       TRANSIENT ISCHEMIA        '.
028800         05  FILLER   PIC X(57)  VALUE
028900     '070 016593 049       066  Y    NONSPECIFIC CEREBROVASCULA'.
029000         05  FILLER   PIC X(57)  VALUE
029100     '071 009796 036       046  Y    NONSPECIFIC CEREBROVASCULA'.
029200         05  FILLER   PIC X(57)  VALUE
029300     '072 006919 023       029  Y    NONSPECIFIC CEREBROVASCULA'.
029400         05  FILLER   PIC X(57)  VALUE
029500     '073 013014 039       053       CRANIAL & PERIPHERAL NERVE'.
029600         05  FILLER   PIC X(57)  VALUE
029700     '074 008786 031       039       CRANIAL & PERIPHERAL NERVE'.
029800         05  FILLER   PIC X(57)  VALUE
029900     '075 015918 052       065       VIRAL MENINGITIS W CC/MCC '.
030000         05  FILLER   PIC X(57)  VALUE
030100     '076 008425 032       037       VIRAL MENINGITIS W/O CC/MC'.
030200         05  FILLER   PIC X(57)  VALUE
030300     '077 016290 046       060       HYPERTENSIVE ENCEPHALOPATH'.
030400         05  FILLER   PIC X(57)  VALUE
030500     '078 009467 031       039       HYPERTENSIVE ENCEPHALOPATH'.
030600         05  FILLER   PIC X(57)  VALUE
030700     '079 007118 023       028       HYPERTENSIVE ENCEPHALOPATH'.
030800         05  FILLER   PIC X(57)  VALUE
030900     '080 012252 037       051       NONTRAUMATIC STUPOR & COMA'.
031000         05  FILLER   PIC X(57)  VALUE
031100     '081 007455 026       034       NONTRAUMATIC STUPOR & COMA'.
031200         05  FILLER   PIC X(57)  VALUE
031300     '082 019463 034       057       TRAUMATIC STUPOR & COMA, C'.
031400         05  FILLER   PIC X(57)  VALUE
031500     '083 012643 034       044       TRAUMATIC STUPOR & COMA, C'.
031600         05  FILLER   PIC X(57)  VALUE
031700     '084 008491 021       027       TRAUMATIC STUPOR & COMA, C'.
031800         05  FILLER   PIC X(57)  VALUE
031900     '085 019733 049       067  Y    TRAUMATIC STUPOR & COMA, C'.
032000         05  FILLER   PIC X(57)  VALUE
032100     '086 011105 033       042  Y    TRAUMATIC STUPOR & COMA, C'.
032200         05  FILLER   PIC X(57)  VALUE
032300     '087 007345 022       027  Y    TRAUMATIC STUPOR & COMA, C'.
032400         05  FILLER   PIC X(57)  VALUE
032500     '088 015029 039       051       CONCUSSION W MCC          '.
032600         05  FILLER   PIC X(57)  VALUE
032700     '089 009406 027       033       CONCUSSION W CC           '.
032800         05  FILLER   PIC X(57)  VALUE
032900     '090 007140 019       023       CONCUSSION W/O CC/MCC     '.
033000         05  FILLER   PIC X(57)  VALUE
033100     '091 015851 043       059  Y    OTHER DISORDERS OF NERVOUS'.
033200         05  FILLER   PIC X(57)  VALUE
033300     '092 008918 031       039  Y    OTHER DISORDERS OF NERVOUS'.
033400         05  FILLER   PIC X(57)  VALUE
033500     '093 006614 022       027  Y    OTHER DISORDERS OF NERVOUS'.
033600         05  FILLER   PIC X(57)  VALUE
033700     '094 034974 083       108       BACTERIAL & TUBERCULOUS IN'.
033800         05  FILLER   PIC X(57)  VALUE
033900     '095 022787 062       077       BACTERIAL & TUBERCULOUS IN'.
034000         05  FILLER   PIC X(57)  VALUE
034100     '096 019694 045       054       BACTERIAL & TUBERCULOUS IN'.
034200         05  FILLER   PIC X(57)  VALUE
034300     '097 031963 085       110       NON-BACTERIAL INFECT OF NE'.
034400         05  FILLER   PIC X(57)  VALUE
034500     '098 017657 058       074       NON-BACTERIAL INFECT OF NE'.
034600         05  FILLER   PIC X(57)  VALUE
034700     '099 011835 041       050       NON-BACTERIAL INFECT OF NE'.
034800         05  FILLER   PIC X(57)  VALUE
034900     '100 015185 042       057  Y    SEIZURES W MCC            '.
035000         05  FILLER   PIC X(57)  VALUE
035100     '101 007569 026       033  Y    SEIZURES W/O MCC          '.
035200         05  FILLER   PIC X(57)  VALUE
035300     '102 010430 031       042       HEADACHES W MCC           '.
035400         05  FILLER   PIC X(57)  VALUE
035500     '103 006663 023       029       HEADACHES W/O MCC         '.
035600         05  FILLER   PIC X(57)  VALUE
035700     '113 018998 040       056       ORBITAL PROCEDURES W CC/MC'.
035800         05  FILLER   PIC X(57)  VALUE
035900     '114 010216 023       029       ORBITAL PROCEDURES W/O CC/'.
036000         05  FILLER   PIC X(57)  VALUE
036100     '115 012543 032       043       EXTRAOCULAR PROCEDURES EXC'.
036200         05  FILLER   PIC X(57)  VALUE
036300     '116 014806 032       048       INTRAOCULAR PROCEDURES W C'.
036400         05  FILLER   PIC X(57)  VALUE
036500     '117 008211 018       024       INTRAOCULAR PROCEDURES W/O'.
036600         05  FILLER   PIC X(57)  VALUE
036700     '121 010215 039       048       ACUTE MAJOR EYE INFECTIONS'.
036800         05  FILLER   PIC X(57)  VALUE
036900     '122 006147 029       035       ACUTE MAJOR EYE INFECTIONS'.
037000         05  FILLER   PIC X(57)  VALUE
037100     '123 006963 022       027       NEUROLOGICAL EYE DISORDERS'.
037200         05  FILLER   PIC X(57)  VALUE
037300     '124 011990 037       051       OTHER DISORDERS OF THE EYE'.
037400         05  FILLER   PIC X(57)  VALUE
037500     '125 006812 025       031       OTHER DISORDERS OF THE EYE'.
037600         05  FILLER   PIC X(57)  VALUE
037700     '129 021925 036       051       MAJOR HEAD & NECK PROCEDUR'.
037800         05  FILLER   PIC X(57)  VALUE
037900     '130 012687 021       026       MAJOR HEAD & NECK PROCEDUR'.
038000         05  FILLER   PIC X(57)  VALUE
038100     '131 022038 039       054       CRANIAL/FACIAL PROCEDURES '.
038200         05  FILLER   PIC X(57)  VALUE
038300     '132 012855 020       026       CRANIAL/FACIAL PROCEDURES '.
038400         05  FILLER   PIC X(57)  VALUE
038500     '133 017824 036       053       OTHER EAR, NOSE, MOUTH & T'.
038600         05  FILLER   PIC X(57)  VALUE
038700     '134 009584 018       024       OTHER EAR, NOSE, MOUTH & T'.
038800         05  FILLER   PIC X(57)  VALUE
038900     '135 020110 041       059       SINUS & MASTOID PROCEDURES'.
039000         05  FILLER   PIC X(57)  VALUE
039100     '136 009709 018       024       SINUS & MASTOID PROCEDURES'.
039200         05  FILLER   PIC X(57)  VALUE
039300     '137 013477 037       050       MOUTH PROCEDURES W CC/MCC '.
039400         05  FILLER   PIC X(57)  VALUE
039500     '138 008304 020       025       MOUTH PROCEDURES W/O CC/MC'.
039600         05  FILLER   PIC X(57)  VALUE
039700     '139 009169 015       020       SALIVARY GLAND PROCEDURES '.
039800         05  FILLER   PIC X(57)  VALUE
039900     '146 020402 056       082       EAR, NOSE, MOUTH & THROAT '.
040000         05  FILLER   PIC X(57)  VALUE
040100     '147 012317 039       054       EAR, NOSE, MOUTH & THROAT '.
040200         05  FILLER   PIC X(57)  VALUE
040300     '148 007688 023       030       EAR, NOSE, MOUTH & THROAT '.
040400         05  FILLER   PIC X(57)  VALUE
040500     '149 006184 021       025       DYSEQUILIBRIUM            '.
040600         05  FILLER   PIC X(57)  VALUE
040700     '150 013298 037       049       EPISTAXIS W MCC           '.
040800         05  FILLER   PIC X(57)  VALUE
040900     '151 006557 022       028       EPISTAXIS W/O MCC         '.
041000         05  FILLER   PIC X(57)  VALUE
041100     '152 010042 033       043       OTITIS MEDIA & URI W MCC  '.
041200         05  FILLER   PIC X(57)  VALUE
041300     '153 006439 024       029       OTITIS MEDIA & URI W/O MCC'.
041400         05  FILLER   PIC X(57)  VALUE
041500     '154 013785 041       055       OTHER EAR, NOSE, MOUTH & T'.
041600         05  FILLER   PIC X(57)  VALUE
041700     '155 008610 031       039       OTHER EAR, NOSE, MOUTH & T'.
041800         05  FILLER   PIC X(57)  VALUE
041900     '156 006160 023       028       OTHER EAR, NOSE, MOUTH & T'.
042000         05  FILLER   PIC X(57)  VALUE
042100     '157 015380 045       061       DENTAL & ORAL DISEASES W M'.
042200         05  FILLER   PIC X(57)  VALUE
042300     '158 008525 031       039       DENTAL & ORAL DISEASES W C'.
042400         05  FILLER   PIC X(57)  VALUE
042500     '159 006100 021       026       DENTAL & ORAL DISEASES W/O'.
042600         05  FILLER   PIC X(57)  VALUE
042700     '163 050952 110       134  Y    MAJOR CHEST PROCEDURES W M'.
042800         05  FILLER   PIC X(57)  VALUE
042900     '164 026086 056       067  Y    MAJOR CHEST PROCEDURES W C'.
043000         05  FILLER   PIC X(57)  VALUE
043100     '165 017943 033       040  Y    MAJOR CHEST PROCEDURES W/O'.
043200         05  FILLER   PIC X(57)  VALUE
043300     '166 036741 088       112  Y    OTHER RESP SYSTEM O.R. PRO'.
043400         05  FILLER   PIC X(57)  VALUE
043500     '167 019860 052       066  Y    OTHER RESP SYSTEM O.R. PRO'.
043600         05  FILLER   PIC X(57)  VALUE
043700     '168 013101 030       039  Y    OTHER RESP SYSTEM O.R. PRO'.
043800         05  FILLER   PIC X(57)  VALUE
043900     '175 015346 053       064  Y    PULMONARY EMBOLISM W MCC  '.
044000         05  FILLER   PIC X(57)  VALUE
044100     '176 009891 037       044  Y    PULMONARY EMBOLISM W/O MCC'.
044200         05  FILLER   PIC X(57)  VALUE
044300     '177 019934 064       079  Y    RESPIRATORY INFECTIONS & I'.
044400         05  FILLER   PIC X(57)  VALUE
044500     '178 013955 051       061  Y    RESPIRATORY INFECTIONS & I'.
044600         05  FILLER   PIC X(57)  VALUE
044700     '179 009741 037       045  Y    RESPIRATORY INFECTIONS & I'.
044800         05  FILLER   PIC X(57)  VALUE
044900     '180 017026 054       071       RESPIRATORY NEOPLASMS W MC'.
045000         05  FILLER   PIC X(57)  VALUE
045100     '181 011725 038       050       RESPIRATORY NEOPLASMS W CC'.
045200         05  FILLER   PIC X(57)  VALUE
045300     '182 007905 026       033       RESPIRATORY NEOPLASMS W/O '.
045400         05  FILLER   PIC X(57)  VALUE
045500     '183 014649 048       059       MAJOR CHEST TRAUMA W MCC  '.
045600         05  FILLER   PIC X(57)  VALUE
045700     '184 009832 034       041       MAJOR CHEST TRAUMA W CC   '.
045800         05  FILLER   PIC X(57)  VALUE
045900     '185 006907 025       029       MAJOR CHEST TRAUMA W/O CC/'.
046000         05  FILLER   PIC X(57)  VALUE
046100     '186 015727 049       063  Y    PLEURAL EFFUSION W MCC    '.
046200         05  FILLER   PIC X(57)  VALUE
046300     '187 010808 036       045  Y    PLEURAL EFFUSION W CC     '.
046400         05  FILLER   PIC X(57)  VALUE
046500     '188 007468 026       033  Y    PLEURAL EFFUSION W/O CC/MC'.
046600         05  FILLER   PIC X(57)  VALUE
046700     '189 012184 039       050       PULMONARY EDEMA & RESPIRAT'.
046800         05  FILLER   PIC X(57)  VALUE
046900     '190 011708 042       051  Y    CHRONIC OBSTRUCTIVE PULMON'.
047000         05  FILLER   PIC X(57)  VALUE
047100     '191 009343 035       042  Y    CHRONIC OBSTRUCTIVE PULMON'.
047200         05  FILLER   PIC X(57)  VALUE
047300     '192 007120 028       033  Y    CHRONIC OBSTRUCTIVE PULMON'.
047400         05  FILLER   PIC X(57)  VALUE
047500     '193 014550 050       061  Y    SIMPLE PNEUMONIA & PLEURIS'.
047600         05  FILLER   PIC X(57)  VALUE
047700     '194 009771 038       046  Y    SIMPLE PNEUMONIA & PLEURIS'.
047800         05  FILLER   PIC X(57)  VALUE
047900     '195 006997 029       034  Y    SIMPLE PNEUMONIA & PLEURIS'.
048000         05  FILLER   PIC X(57)  VALUE
048100     '196 016686 054       068  Y    INTERSTITIAL LUNG DISEASE '.
048200         05  FILLER   PIC X(57)  VALUE
048300     '197 010627 038       047  Y    INTERSTITIAL LUNG DISEASE '.
048400         05  FILLER   PIC X(57)  VALUE
048500     '198 007958 029       036  Y    INTERSTITIAL LUNG DISEASE '.
048600         05  FILLER   PIC X(57)  VALUE
048700     '199 018127 059       076       PNEUMOTHORAX W MCC        '.
048800         05  FILLER   PIC X(57)  VALUE
048900     '200 009692 033       043       PNEUMOTHORAX W CC         '.
049000         05  FILLER   PIC X(57)  VALUE
049100     '201 007053 026       033       PNEUMOTHORAX W/O CC/MCC   '.
049200         05  FILLER   PIC X(57)  VALUE
049300     '202 008678 032       039       BRONCHITIS & ASTHMA W CC/M'.
049400         05  FILLER   PIC X(57)  VALUE
049500     '203 006391 025       030       BRONCHITIS & ASTHMA W/O CC'.
049600         05  FILLER   PIC X(57)  VALUE
049700     '204 006780 021       027       RESPIRATORY SIGNS & SYMPTO'.
049800         05  FILLER   PIC X(57)  VALUE
049900     '205 013935 040       054  Y    OTHER RESPIRATORY SYSTEM D'.
050000         05  FILLER   PIC X(57)  VALUE
050100     '206 007911 025       032  Y    OTHER RESPIRATORY SYSTEM D'.
050200         05  FILLER   PIC X(57)  VALUE
050300     '207 052556 121       141  Y    RESPIRATORY SYSTEM DIAGNOS'.
050400         05  FILLER   PIC X(57)  VALUE
050500     '208 022871 050       068       RESPIRATORY SYSTEM DIAGNOS'.
050600         05  FILLER   PIC X(57)  VALUE
050700     '215 147790 100       167       OTHER HEART ASSIST SYSTEM '.
050800         05  FILLER   PIC X(57)  VALUE
050900     '216 094801 131       158  Y Y  CARDIAC VALVE & OTH MAJ CA'.
051000         05  FILLER   PIC X(57)  VALUE
051100     '217 062835 084       097  Y Y  CARDIAC VALVE & OTH MAJ CA'.
051200         05  FILLER   PIC X(57)  VALUE
051300     '218 054262 061       072  Y Y  CARDIAC VALVE & OTH MAJ CA'.
051400         05  FILLER   PIC X(57)  VALUE
051500     '219 079191 100       121  Y Y  CARDIAC VALVE & OTH MAJ CA'.
051600         05  FILLER   PIC X(57)  VALUE
051700     '220 052917 066       073  Y Y  CARDIAC VALVE & OTH MAJ CA'.
051800         05  FILLER   PIC X(57)  VALUE
051900     '221 046424 049       055  Y Y  CARDIAC VALVE & OTH MAJ CA'.
052000         05  FILLER   PIC X(57)  VALUE
052100     '222 088167 096       119       CARDIAC DEFIB IMPLANT W CA'.
052200         05  FILLER   PIC X(57)  VALUE
052300     '223 064257 046       062       CARDIAC DEFIB IMPLANT W CA'.
052400         05  FILLER   PIC X(57)  VALUE
052500     '224 077224 081       100       CARDIAC DEFIB IMPLANT W CA'.
052600         05  FILLER   PIC X(57)  VALUE
052700     '225 059206 041       049       CARDIAC DEFIB IMPLANT W CA'.
052800         05  FILLER   PIC X(57)  VALUE
052900     '226 070099 060       084       CARDIAC DEFIBRILLATOR IMPL'.
053000         05  FILLER   PIC X(57)  VALUE
053100     '227 055397 022       032       CARDIAC DEFIBRILLATOR IMPL'.
053200         05  FILLER   PIC X(57)  VALUE
053300     '228 068682 111       132       OTHER CARDIOTHORACIC PROCE'.
053400         05  FILLER   PIC X(57)  VALUE
053500     '229 044413 069       078       OTHER CARDIOTHORACIC PROCE'.
053600         05  FILLER   PIC X(57)  VALUE
053700     '230 036669 044       051       OTHER CARDIOTHORACIC PROCE'.
053800         05  FILLER   PIC X(57)  VALUE
053900     '231 078158 107       124       CORONARY BYPASS W PTCA W M'.
054000         05  FILLER   PIC X(57)  VALUE
054100     '232 056145 081       089       CORONARY BYPASS W PTCA W/O'.
054200         05  FILLER   PIC X(57)  VALUE
054300     '233 073887 119       134  Y    CORONARY BYPASS W CARDIAC '.
054400         05  FILLER   PIC X(57)  VALUE
054500     '234 048270 080       086  Y    CORONARY BYPASS W CARDIAC '.
054600         05  FILLER   PIC X(57)  VALUE
054700     '235 058478 092       106  Y    CORONARY BYPASS W/O CARDIA'.
054800         05  FILLER   PIC X(57)  VALUE
054900     '236 038011 060       065  Y    CORONARY BYPASS W/O CARDIA'.
055000         05  FILLER   PIC X(57)  VALUE
055100     '237 050962 069       098       MAJOR CARDIOVASC PROCEDURE'.
055200         05  FILLER   PIC X(57)  VALUE
055300     '238 033576 026       038       MAJOR CARDIOVASC PROCEDURE'.
055400         05  FILLER   PIC X(57)  VALUE
055500     '239 048601 109       139  Y    AMPUTATION FOR CIRC SYS DI'.
055600         05  FILLER   PIC X(57)  VALUE
055700     '240 026789 072       088  Y    AMPUTATION FOR CIRC SYS DI'.
055800         05  FILLER   PIC X(57)  VALUE
055900     '241 014226 046       055  Y    AMPUTATION FOR CIRC SYS DI'.
056000         05  FILLER   PIC X(57)  VALUE
056100     '242 037491 059       076  Y    PERMANENT CARDIAC PACEMAKE'.
056200         05  FILLER   PIC X(57)  VALUE
056300     '243 026716 037       046  Y    PERMANENT CARDIAC PACEMAKE'.
056400         05  FILLER   PIC X(57)  VALUE
056500     '244 021608 024       029  Y    PERMANENT CARDIAC PACEMAKE'.
056600         05  FILLER   PIC X(57)  VALUE
056700     '245 047022 033       047       AICD GENERATOR PROCEDURES '.
056800         05  FILLER   PIC X(57)  VALUE
056900     '246 031830 039       052       PERC CARDIOVASC PROC W DRU'.
057000         05  FILLER   PIC X(57)  VALUE
057100     '247 020408 021       025       PERC CARDIOVASC PROC W DRU'.
057200         05  FILLER   PIC X(57)  VALUE
057300     '248 029479 046       062       PERC CARDIOVASC PROC W NON'.
057400         05  FILLER   PIC X(57)  VALUE
057500     '249 018245 024       030       PERC CARDIOVASC PROC W NON'.
057600         05  FILLER   PIC X(57)  VALUE
057700     '250 029881 051       070       PERC CARDIOVASC PROC W/O C'.
057800         05  FILLER   PIC X(57)  VALUE
057900     '251 019737 024       031       PERC CARDIOVASC PROC W/O C'.
058000         05  FILLER   PIC X(57)  VALUE
058100     '252 031477 053       077       OTHER VASCULAR PROCEDURES '.
058200         05  FILLER   PIC X(57)  VALUE
058300     '253 025172 041       055       OTHER VASCULAR PROCEDURES '.
058400         05  FILLER   PIC X(57)  VALUE
058500     '254 017012 022       029       OTHER VASCULAR PROCEDURES '.
058600         05  FILLER   PIC X(57)  VALUE
058700     '255 026404 068       088  Y    UPPER LIMB & TOE AMPUTATIO'.
058800         05  FILLER   PIC X(57)  VALUE
058900     '256 015973 053       065  Y    UPPER LIMB & TOE AMPUTATIO'.
059000         05  FILLER   PIC X(57)  VALUE
059100     '257 009017 030       037  Y    UPPER LIMB & TOE AMPUTATIO'.
059200         05  FILLER   PIC X(57)  VALUE
059300     '258 027229 049       062       CARDIAC PACEMAKER DEVICE R'.
059400         05  FILLER   PIC X(57)  VALUE
059500     '259 019462 027       034       CARDIAC PACEMAKER DEVICE R'.
059600         05  FILLER   PIC X(57)  VALUE
059700     '260 037238 077       105       CARDIAC PACEMAKER REVISION'.
059800         05  FILLER   PIC X(57)  VALUE
059900     '261 017284 032       043       CARDIAC PACEMAKER REVISION'.
060000         05  FILLER   PIC X(57)  VALUE
060100     '262 013866 023       029       CARDIAC PACEMAKER REVISION'.
060200         05  FILLER   PIC X(57)  VALUE
060300     '263 018888 036       052       VEIN LIGATION & STRIPPING '.
060400         05  FILLER   PIC X(57)  VALUE
060500     '264 027138 056       082  Y    OTHER CIRCULATORY SYSTEM O'.
060600         05  FILLER   PIC X(57)  VALUE
060700     '265 026890 025       036       AICD LEAD PROCEDURES      '.
060800         05  FILLER   PIC X(57)  VALUE
060900     '280 017431 047       060  Y    ACUTE MYOCARDIAL INFARCTIO'.
061000         05  FILLER   PIC X(57)  VALUE
061100     '281 010568 031       038  Y    ACUTE MYOCARDIAL INFARCTIO'.
061200         05  FILLER   PIC X(57)  VALUE
061300     '282 007551 021       025  Y    ACUTE MYOCARDIAL INFARCTIO'.
061400         05  FILLER   PIC X(57)  VALUE
061500     '283 016885 030       047       ACUTE MYOCARDIAL INFARCTIO'.
061600         05  FILLER   PIC X(57)  VALUE
061700     '284 007614 018       025       ACUTE MYOCARDIAL INFARCTIO'.
061800         05  FILLER   PIC X(57)  VALUE
061900     '285 005227 014       017       ACUTE MYOCARDIAL INFARCTIO'.
062000         05  FILLER   PIC X(57)  VALUE
062100     '286 021058 049       067       CIRCULATORY DISORDERS EXCE'.
062200         05  FILLER   PIC X(57)  VALUE
062300     '287 010866 024       031       CIRCULATORY DISORDERS EXCE'.
062400         05  FILLER   PIC X(57)  VALUE
062500     '288 027956 078       099  Y    ACUTE & SUBACUTE ENDOCARDI'.
062600         05  FILLER   PIC X(57)  VALUE
062700     '289 017891 057       070  Y    ACUTE & SUBACUTE ENDOCARDI'.
062800         05  FILLER   PIC X(57)  VALUE
062900     '290 012359 039       048  Y    ACUTE & SUBACUTE ENDOCARDI'.
063000         05  FILLER   PIC X(57)  VALUE
063100     '291 015031 046       059  Y    HEART FAILURE & SHOCK W MC'.
063200         05  FILLER   PIC X(57)  VALUE
063300     '292 009938 037       045  Y    HEART FAILURE & SHOCK W CC'.
063400         05  FILLER   PIC X(57)  VALUE
063500     '293 006723 026       031  Y    HEART FAILURE & SHOCK W/O '.
063600         05  FILLER   PIC X(57)  VALUE
063700     '294 009439 040       049       DEEP VEIN THROMBOPHLEBITIS'.
063800         05  FILLER   PIC X(57)  VALUE
063900     '295 006287 031       036       DEEP VEIN THROMBOPHLEBITIS'.
064000         05  FILLER   PIC X(57)  VALUE
064100     '296 013013 019       029       CARDIAC ARREST, UNEXPLAINE'.
064200         05  FILLER   PIC X(57)  VALUE
064300     '297 006063 012       015       CARDIAC ARREST, UNEXPLAINE'.
064400         05  FILLER   PIC X(57)  VALUE
064500     '298 004260 010       011       CARDIAC ARREST, UNEXPLAINE'.
064600         05  FILLER   PIC X(57)  VALUE
064700     '299 013647 044       056  Y    PERIPHERAL VASCULAR DISORD'.
064800         05  FILLER   PIC X(57)  VALUE
064900     '300 009666 036       045  Y    PERIPHERAL VASCULAR DISORD'.
065000         05  FILLER   PIC X(57)  VALUE
065100     '301 006681 027       033  Y    PERIPHERAL VASCULAR DISORD'.
065200         05  FILLER   PIC X(57)  VALUE
065300     '302 010287 029       039       ATHEROSCLEROSIS W MCC     '.
065400         05  FILLER   PIC X(57)  VALUE
065500     '303 006034 019       023       ATHEROSCLEROSIS W/O MCC   '.
065600         05  FILLER   PIC X(57)  VALUE
065700     '304 010268 033       044       HYPERTENSION W MCC        '.
065800         05  FILLER   PIC X(57)  VALUE
065900     '305 006176 021       026       HYPERTENSION W/O MCC      '.
066000         05  FILLER   PIC X(57)  VALUE
066100     '306 013659 039       053       CARDIAC CONGENITAL & VALVU'.
066200         05  FILLER   PIC X(57)  VALUE
066300     '307 007917 026       033       CARDIAC CONGENITAL & VALVU'.
066400         05  FILLER   PIC X(57)  VALUE
066500     '308 012088 038       049       CARDIAC ARRHYTHMIA & CONDU'.
066600         05  FILLER   PIC X(57)  VALUE
066700     '309 007867 027       033       CARDIAC ARRHYTHMIA & CONDU'.
066800         05  FILLER   PIC X(57)  VALUE
066900     '310 005512 019       023       CARDIAC ARRHYTHMIA & CONDU'.
067000         05  FILLER   PIC X(57)  VALUE
067100     '311 005649 018       022       ANGINA PECTORIS           '.
067200         05  FILLER   PIC X(57)  VALUE
067300     '312 007228 024       030       SYNCOPE & COLLAPSE        '.
067400         05  FILLER   PIC X(57)  VALUE
067500     '313 005992 018       021       CHEST PAIN                '.
067600         05  FILLER   PIC X(57)  VALUE
067700     '314 018941 049       067  Y    OTHER CIRCULATORY SYSTEM D'.
067800         05  FILLER   PIC X(57)  VALUE
067900     '315 009534 031       040  Y    OTHER CIRCULATORY SYSTEM D'.
068000         05  FILLER   PIC X(57)  VALUE
068100     '316 006358 020       025  Y    OTHER CIRCULATORY SYSTEM D'.
068200         05  FILLER   PIC X(57)  VALUE
068300     '326 056013 116       149  Y    STOMACH, ESOPHAGEAL & DUOD'.
068400         05  FILLER   PIC X(57)  VALUE
068500     '327 026598 061       080  Y    STOMACH, ESOPHAGEAL & DUOD'.
068600         05  FILLER   PIC X(57)  VALUE
068700     '328 014765 026       034  Y    STOMACH, ESOPHAGEAL & DUOD'.
068800         05  FILLER   PIC X(57)  VALUE
068900     '329 051272 119       146  Y    MAJOR SMALL & LARGE BOWEL '.
069000         05  FILLER   PIC X(57)  VALUE
069100     '330 025609 073       085  Y    MAJOR SMALL & LARGE BOWEL '.
069200         05  FILLER   PIC X(57)  VALUE
069300     '331 016380 044       049  Y    MAJOR SMALL & LARGE BOWEL '.
069400         05  FILLER   PIC X(57)  VALUE
069500     '332 047072 109       132  Y    RECTAL RESECTION W MCC    '.
069600         05  FILLER   PIC X(57)  VALUE
069700     '333 024466 064       074  Y    RECTAL RESECTION W CC     '.
069800         05  FILLER   PIC X(57)  VALUE
069900     '334 015849 037       043  Y    RECTAL RESECTION W/O CC/MC'.
070000         05  FILLER   PIC X(57)  VALUE
070100     '335 041615 107       130  Y    PERITONEAL ADHESIOLYSIS W '.
070200         05  FILLER   PIC X(57)  VALUE
070300     '336 023513 070       084  Y    PERITONEAL ADHESIOLYSIS W '.
070400         05  FILLER   PIC X(57)  VALUE
070500     '337 015742 041       050  Y    PERITONEAL ADHESIOLYSIS W/'.
070600         05  FILLER   PIC X(57)  VALUE
070700     '338 031217 078       095       APPENDECTOMY W COMPLICATED'.
070800         05  FILLER   PIC X(57)  VALUE
070900     '339 017117 051       060       APPENDECTOMY W COMPLICATED'.
071000         05  FILLER   PIC X(57)  VALUE
071100     '340 011741 030       035       APPENDECTOMY W COMPLICATED'.
071200         05  FILLER   PIC X(57)  VALUE
071300     '341 021821 046       063       APPENDECTOMY W/O COMPLICAT'.
071400         05  FILLER   PIC X(57)  VALUE
071500     '342 012968 028       035       APPENDECTOMY W/O COMPLICAT'.
071600         05  FILLER   PIC X(57)  VALUE
071700     '343 009358 016       019       APPENDECTOMY W/O COMPLICAT'.
071800         05  FILLER   PIC X(57)  VALUE
071900     '344 035966 089       113       MINOR SMALL & LARGE BOWEL '.
072000         05  FILLER   PIC X(57)  VALUE
072100     '345 016865 055       065       MINOR SMALL & LARGE BOWEL '.
072200         05  FILLER   PIC X(57)  VALUE
072300     '346 012174 040       044       MINOR SMALL & LARGE BOWEL '.
072400         05  FILLER   PIC X(57)  VALUE
072500     '347 025182 063       085       ANAL & STOMAL PROCEDURES W'.
072600         05  FILLER   PIC X(57)  VALUE
072700     '348 013585 040       051       ANAL & STOMAL PROCEDURES W'.
072800         05  FILLER   PIC X(57)  VALUE
072900     '349 008834 024       030       ANAL & STOMAL PROCEDURES W'.
073000         05  FILLER   PIC X(57)  VALUE
073100     '350 024598 058       078       INGUINAL & FEMORAL HERNIA '.
073200         05  FILLER   PIC X(57)  VALUE
073300     '351 013761 035       045       INGUINAL & FEMORAL HERNIA '.
073400         05  FILLER   PIC X(57)  VALUE
073500     '352 009239 020       025       INGUINAL & FEMORAL HERNIA '.
073600         05  FILLER   PIC X(57)  VALUE
073700     '353 027885 062       080       HERNIA PROCEDURES EXCEPT I'.
073800         05  FILLER   PIC X(57)  VALUE
073900     '354 016401 040       050       HERNIA PROCEDURES EXCEPT I'.
074000         05  FILLER   PIC X(57)  VALUE
074100     '355 011783 025       030       HERNIA PROCEDURES EXCEPT I'.
074200         05  FILLER   PIC X(57)  VALUE
074300     '356 038388 086       115  Y    OTHER DIGESTIVE SYSTEM O.R'.
074400         05  FILLER   PIC X(57)  VALUE
074500     '357 021448 054       069  Y    OTHER DIGESTIVE SYSTEM O.R'.
074600         05  FILLER   PIC X(57)  VALUE
074700     '358 013942 032       041  Y    OTHER DIGESTIVE SYSTEM O.R'.
074800         05  FILLER   PIC X(57)  VALUE
074900     '368 018779 050       066       MAJOR ESOPHAGEAL DISORDERS'.
075000         05  FILLER   PIC X(57)  VALUE
075100     '369 010660 035       042       MAJOR ESOPHAGEAL DISORDERS'.
075200         05  FILLER   PIC X(57)  VALUE
075300     '370 007486 025       030       MAJOR ESOPHAGEAL DISORDERS'.
075400         05  FILLER   PIC X(57)  VALUE
075500     '371 019027 062       079  Y    MAJOR GASTROINTESTINAL DIS'.
075600         05  FILLER   PIC X(57)  VALUE
075700     '372 011733 048       058  Y    MAJOR GASTROINTESTINAL DIS'.
075800         05  FILLER   PIC X(57)  VALUE
075900     '373 008103 036       042  Y    MAJOR GASTROINTESTINAL DIS'.
076000         05  FILLER   PIC X(57)  VALUE
076100     '374 021051 062       084  Y    DIGESTIVE MALIGNANCY W MCC'.
076200         05  FILLER   PIC X(57)  VALUE
076300     '375 012561 042       054  Y    DIGESTIVE MALIGNANCY W CC '.
076400         05  FILLER   PIC X(57)  VALUE
076500     '376 008738 027       035  Y    DIGESTIVE MALIGNANCY W/O C'.
076600         05  FILLER   PIC X(57)  VALUE
076700     '377 017629 048       061  Y    G.I. HEMORRHAGE W MCC     '.
076800         05  FILLER   PIC X(57)  VALUE
076900     '378 010029 033       039  Y    G.I. HEMORRHAGE W CC      '.
077000         05  FILLER   PIC X(57)  VALUE
077100     '379 006937 024       028  Y    G.I. HEMORRHAGE W/O CC/MCC'.
077200         05  FILLER   PIC X(57)  VALUE
077300     '380 019223 055       072  Y    COMPLICATED PEPTIC ULCER W'.
077400         05  FILLER   PIC X(57)  VALUE
077500     '381 011199 038       046  Y    COMPLICATED PEPTIC ULCER W'.
077600         05  FILLER   PIC X(57)  VALUE
077700     '382 007784 027       033  Y    COMPLICATED PEPTIC ULCER W'.
077800         05  FILLER   PIC X(57)  VALUE
077900     '383 013850 044       055       UNCOMPLICATED PEPTIC ULCER'.
078000         05  FILLER   PIC X(57)  VALUE
078100     '384 008501 030       036       UNCOMPLICATED PEPTIC ULCER'.
078200         05  FILLER   PIC X(57)  VALUE
078300     '385 017973 060       078       INFLAMMATORY BOWEL DISEASE'.
078400         05  FILLER   PIC X(57)  VALUE
078500     '386 010097 040       050       INFLAMMATORY BOWEL DISEASE'.
078600         05  FILLER   PIC X(57)  VALUE
078700     '387 007533 031       038       INFLAMMATORY BOWEL DISEASE'.
078800         05  FILLER   PIC X(57)  VALUE
078900     '388 016170 053       070  Y    G.I. OBSTRUCTION W MCC    '.
079000         05  FILLER   PIC X(57)  VALUE
079100     '389 008853 036       045  Y    G.I. OBSTRUCTION W CC     '.
079200         05  FILLER   PIC X(57)  VALUE
079300     '390 006046 027       032  Y    G.I. OBSTRUCTION W/O CC/MC'.
079400         05  FILLER   PIC X(57)  VALUE
079500     '391 011903 039       051       ESOPHAGITIS, GASTROENT & M'.
079600         05  FILLER   PIC X(57)  VALUE
079700     '392 007395 029       035       ESOPHAGITIS, GASTROENT & M'.
079800         05  FILLER   PIC X(57)  VALUE
079900     '393 016563 047       065       OTHER DIGESTIVE SYSTEM DIA'.
080000         05  FILLER   PIC X(57)  VALUE
080100     '394 009653 035       044       OTHER DIGESTIVE SYSTEM DIA'.
080200         05  FILLER   PIC X(57)  VALUE
080300     '395 006669 024       030       OTHER DIGESTIVE SYSTEM DIA'.
080400         05  FILLER   PIC X(57)  VALUE
080500     '405 054333 110       145  Y    PANCREAS, LIVER & SHUNT PR'.
080600         05  FILLER   PIC X(57)  VALUE
080700     '406 027667 060       076  Y    PANCREAS, LIVER & SHUNT PR'.
080800         05  FILLER   PIC X(57)  VALUE
080900     '407 019139 042       051  Y    PANCREAS, LIVER & SHUNT PR'.
081000         05  FILLER   PIC X(57)  VALUE
081100     '408 041182 106       132       BILIARY TRACT PROC EXCEPT '.
081200         05  FILLER   PIC X(57)  VALUE
081300     '409 024337 067       079       BILIARY TRACT PROC EXCEPT '.
081400         05  FILLER   PIC X(57)  VALUE
081500     '410 015123 043       050       BILIARY TRACT PROC EXCEPT '.
081600         05  FILLER   PIC X(57)  VALUE
081700     '411 035968 093       113       CHOLECYSTECTOMY W C.D.E. W'.
081800         05  FILLER   PIC X(57)  VALUE
081900     '412 023659 065       076       CHOLECYSTECTOMY W C.D.E. W'.
082000         05  FILLER   PIC X(57)  VALUE
082100     '413 017220 042       050       CHOLECYSTECTOMY W C.D.E. W'.
082200         05  FILLER   PIC X(57)  VALUE
082300     '414 036208 088       106  Y    CHOLECYSTECTOMY EXCEPT BY '.
082400         05  FILLER   PIC X(57)  VALUE
082500     '415 020173 058       067  Y    CHOLECYSTECTOMY EXCEPT BY '.
082600         05  FILLER   PIC X(57)  VALUE
082700     '416 013268 035       041  Y    CHOLECYSTECTOMY EXCEPT BY '.
082800         05  FILLER   PIC X(57)  VALUE
082900     '417 024784 060       075       LAPAROSCOPIC CHOLECYSTECTO'.
083000         05  FILLER   PIC X(57)  VALUE
083100     '418 016536 041       050       LAPAROSCOPIC CHOLECYSTECTO'.
083200         05  FILLER   PIC X(57)  VALUE
083300     '419 012239 026       031       LAPAROSCOPIC CHOLECYSTECTO'.
083400         05  FILLER   PIC X(57)  VALUE
083500     '420 036786 087       123       HEPATOBILIARY DIAGNOSTIC P'.
083600         05  FILLER   PIC X(57)  VALUE
083700     '421 017714 046       063       HEPATOBILIARY DIAGNOSTIC P'.
083800         05  FILLER   PIC X(57)  VALUE
083900     '422 012175 031       039       HEPATOBILIARY DIAGNOSTIC P'.
084000         05  FILLER   PIC X(57)  VALUE
084100     '423 042183 096       130       OTHER HEPATOBILIARY OR PAN'.
084200         05  FILLER   PIC X(57)  VALUE
084300     '424 023149 063       082       OTHER HEPATOBILIARY OR PAN'.
084400         05  FILLER   PIC X(57)  VALUE
084500     '425 016396 038       049       OTHER HEPATOBILIARY OR PAN'.
084600         05  FILLER   PIC X(57)  VALUE
084700     '432 017150 047       063       CIRRHOSIS & ALCOHOLIC HEPA'.
084800         05  FILLER   PIC X(57)  VALUE
084900     '433 009249 033       041       CIRRHOSIS & ALCOHOLIC HEPA'.
085000         05  FILLER   PIC X(57)  VALUE
085100     '434 006156 024       030       CIRRHOSIS & ALCOHOLIC HEPA'.
085200         05  FILLER   PIC X(57)  VALUE
085300     '435 017356 052       069       MALIGNANCY OF HEPATOBILIAR'.
085400         05  FILLER   PIC X(57)  VALUE
085500     '436 011548 039       050       MALIGNANCY OF HEPATOBILIAR'.
085600         05  FILLER   PIC X(57)  VALUE
085700     '437 009282 028       036       MALIGNANCY OF HEPATOBILIAR'.
085800         05  FILLER   PIC X(57)  VALUE
085900     '438 017210 051       070       DISORDERS OF PANCREAS EXCE'.
086000         05  FILLER   PIC X(57)  VALUE
086100     '439 009162 036       045       DISORDERS OF PANCREAS EXCE'.
086200         05  FILLER   PIC X(57)  VALUE
086300     '440 006452 027       032       DISORDERS OF PANCREAS EXCE'.
086400         05  FILLER   PIC X(57)  VALUE
086500     '441 018534 050       068  Y    DISORDERS OF LIVER EXCEPT '.
086600         05  FILLER   PIC X(57)  VALUE
086700     '442 009280 034       043  Y    DISORDERS OF LIVER EXCEPT '.
086800         05  FILLER   PIC X(57)  VALUE
086900     '443 006418 026       032  Y    DISORDERS OF LIVER EXCEPT '.
087000         05  FILLER   PIC X(57)  VALUE
087100     '444 016060 047       061       DISORDERS OF THE BILIARY T'.
087200         05  FILLER   PIC X(57)  VALUE
087300     '445 010476 034       042       DISORDERS OF THE BILIARY T'.
087400         05  FILLER   PIC X(57)  VALUE
087500     '446 007499 024       029       DISORDERS OF THE BILIARY T'.
087600         05  FILLER   PIC X(57)  VALUE
087700     '453 117453 097       122       COMBINED ANTERIOR/POSTERIO'.
087800         05  FILLER   PIC X(57)  VALUE
087900     '454 080200 051       061       COMBINED ANTERIOR/POSTERIO'.
088000         05  FILLER   PIC X(57)  VALUE
088100     '455 062882 031       036       COMBINED ANTERIOR/POSTERIO'.
088200         05  FILLER   PIC X(57)  VALUE
088300     '456 095871 102       125       SPINAL FUS EXC CERV W SPIN'.
088400         05  FILLER   PIC X(57)  VALUE
088500     '457 068188 056       065       SPINAL FUS EXC CERV W SPIN'.
088600         05  FILLER   PIC X(57)  VALUE
088700     '458 051378 033       038       SPINAL FUS EXC CERV W SPIN'.
088800         05  FILLER   PIC X(57)  VALUE
088900     '459 068163 071       087  Y    SPINAL FUSION EXCEPT CERVI'.
089000         05  FILLER   PIC X(57)  VALUE
089100     '460 040221 031       036  Y    SPINAL FUSION EXCEPT CERVI'.
089200         05  FILLER   PIC X(57)  VALUE
089300     '461 050254 061       075       BILATERAL OR MULTIPLE MAJO'.
089400         05  FILLER   PIC X(57)  VALUE
089500     '462 035190 035       038       BILATERAL OR MULTIPLE MAJO'.
089600         05  FILLER   PIC X(57)  VALUE
089700     '463 051152 104       140  Y    WND DEBRID & SKN GRFT EXC '.
089800         05  FILLER   PIC X(57)  VALUE
089900     '464 030243 062       080  Y    WND DEBRID & SKN GRFT EXC '.
090000         05  FILLER   PIC X(57)  VALUE
090100     '465 019199 038       048  Y    WND DEBRID & SKN GRFT EXC '.
090200         05  FILLER   PIC X(57)  VALUE
090300     '466 052748 070       086  Y    REVISION OF HIP OR KNEE RE'.
090400         05  FILLER   PIC X(57)  VALUE
090500     '467 034140 039       045  Y    REVISION OF HIP OR KNEE RE'.
090600         05  FILLER   PIC X(57)  VALUE
090700     '468 027624 030       032  Y    REVISION OF HIP OR KNEE RE'.
090800         05  FILLER   PIC X(57)  VALUE
090900     '469 034377 062       074  Y    MAJOR JOINT REPLACEMENT OR'.
091000         05  FILLER   PIC X(57)  VALUE
091100     '470 021463 031       034  Y    MAJOR JOINT REPLACEMENT OR'.
091200         05  FILLER   PIC X(57)  VALUE
091300     '471 049444 064       089       CERVICAL SPINAL FUSION W M'.
091400         05  FILLER   PIC X(57)  VALUE
091500     '472 029288 025       035       CERVICAL SPINAL FUSION W C'.
091600         05  FILLER   PIC X(57)  VALUE
091700     '473 022458 015       018       CERVICAL SPINAL FUSION W/O'.
091800         05  FILLER   PIC X(57)  VALUE
091900     '474 036884 088       112  Y    AMPUTATION FOR MUSCULOSKEL'.
092000         05  FILLER   PIC X(57)  VALUE
092100     '475 020488 057       071  Y    AMPUTATION FOR MUSCULOSKEL'.
092200         05  FILLER   PIC X(57)  VALUE
092300     '476 010717 031       039  Y    AMPUTATION FOR MUSCULOSKEL'.
092400         05  FILLER   PIC X(57)  VALUE
092500     '477 032827 086       108  Y Y  BIOPSIES OF MUSCULOSKELETA'.
092600         05  FILLER   PIC X(57)  VALUE
092700     '478 022115 054       067  Y Y  BIOPSIES OF MUSCULOSKELETA'.
092800         05  FILLER   PIC X(57)  VALUE
092900     '479 017340 033       042  Y Y  BIOPSIES OF MUSCULOSKELETA'.
093000         05  FILLER   PIC X(57)  VALUE
093100     '480 030694 071       083  Y Y  HIP & FEMUR PROCEDURES EXC'.
093200         05  FILLER   PIC X(57)  VALUE
093300     '481 019721 048       052  Y Y  HIP & FEMUR PROCEDURES EXC'.
093400         05  FILLER   PIC X(57)  VALUE
093500     '482 016305 039       042  Y Y  HIP & FEMUR PROCEDURES EXC'.
093600         05  FILLER   PIC X(57)  VALUE
093700     '483 026488 028       034  Y    MAJOR JOINT & LIMB REATTAC'.
093800         05  FILLER   PIC X(57)  VALUE
093900     '484 022298 018       020  Y    MAJOR JOINT & LIMB REATTAC'.
094000         05  FILLER   PIC X(57)  VALUE
094100     '485 032719 084       103       KNEE PROCEDURES W PDX OF I'.
094200         05  FILLER   PIC X(57)  VALUE
094300     '486 020199 056       065       KNEE PROCEDURES W PDX OF I'.
094400         05  FILLER   PIC X(57)  VALUE
094500     '487 015215 041       046       KNEE PROCEDURES W PDX OF I'.
094600         05  FILLER   PIC X(57)  VALUE
094700     '488 017379 035       043  Y    KNEE PROCEDURES W/O PDX OF'.
094800         05  FILLER   PIC X(57)  VALUE
094900     '489 012799 025       028  Y    KNEE PROCEDURES W/O PDX OF'.
095000         05  FILLER   PIC X(57)  VALUE
095100     '490 018845 034       046       BACK & NECK PROC EXC SPINA'.
095200         05  FILLER   PIC X(57)  VALUE
095300     '491 010893 019       023       BACK & NECK PROC EXC SPINA'.
095400         05  FILLER   PIC X(57)  VALUE
095500     '492 031831 064       080  Y Y  LOWER EXTREM & HUMER PROC '.
095600         05  FILLER   PIC X(57)  VALUE
095700     '493 019971 040       048  Y Y  LOWER EXTREM & HUMER PROC '.
095800         05  FILLER   PIC X(57)  VALUE
095900     '494 015073 027       032  Y Y  LOWER EXTREM & HUMER PROC '.
096000         05  FILLER   PIC X(57)  VALUE
096100     '495 029110 072       096  Y Y  LOCAL EXCISION & REMOVAL I'.
096200         05  FILLER   PIC X(57)  VALUE
096300     '496 017290 040       052  Y Y  LOCAL EXCISION & REMOVAL I'.
096400         05  FILLER   PIC X(57)  VALUE
096500     '497 011731 021       026  Y Y  LOCAL EXCISION & REMOVAL I'.
096600         05  FILLER   PIC X(57)  VALUE
096700     '498 021924 053       072       LOCAL EXCISION & REMOVAL I'.
096800         05  FILLER   PIC X(57)  VALUE
096900     '499 009577 021       026       LOCAL EXCISION & REMOVAL I'.
097000         05  FILLER   PIC X(57)  VALUE
097100     '500 030116 073       098  Y Y  SOFT TISSUE PROCEDURES W M'.
097200         05  FILLER   PIC X(57)  VALUE
097300     '501 015804 044       055  Y Y  SOFT TISSUE PROCEDURES W C'.
097400         05  FILLER   PIC X(57)  VALUE
097500     '502 011277 024       029  Y Y  SOFT TISSUE PROCEDURES W/O'.
097600         05  FILLER   PIC X(57)  VALUE
097700     '503 022584 063       078       FOOT PROCEDURES W MCC     '.
097800         05  FILLER   PIC X(57)  VALUE
097900     '504 016133 049       059       FOOT PROCEDURES W CC      '.
098000         05  FILLER   PIC X(57)  VALUE
098100     '505 012072 027       033       FOOT PROCEDURES W/O CC/MCC'.
098200         05  FILLER   PIC X(57)  VALUE
098300     '506 012041 029       038       MAJOR THUMB OR JOINT PROCE'.
098400         05  FILLER   PIC X(57)  VALUE
098500     '507 019667 041       056       MAJOR SHOULDER OR ELBOW JO'.
098600         05  FILLER   PIC X(57)  VALUE
098700     '508 013190 020       024       MAJOR SHOULDER OR ELBOW JO'.
098800         05  FILLER   PIC X(57)  VALUE
098900     '509 013245 027       035       ARTHROSCOPY               '.
099000         05  FILLER   PIC X(57)  VALUE
099100     '510 022717 048       060  Y    SHOULDER,ELBOW OR FOREARM '.
099200         05  FILLER   PIC X(57)  VALUE
099300     '511 015894 032       038  Y    SHOULDER,ELBOW OR FOREARM '.
099400         05  FILLER   PIC X(57)  VALUE
099500     '512 012266 020       023  Y    SHOULDER,ELBOW OR FOREARM '.
099600         05  FILLER   PIC X(57)  VALUE
099700     '513 014122 037       049       HAND OR WRIST PROC, EXCEPT'.
099800         05  FILLER   PIC X(57)  VALUE
099900     '514 008781 022       027       HAND OR WRIST PROC, EXCEPT'.
100000         05  FILLER   PIC X(57)  VALUE
100100     '515 033340 075       096  Y Y  OTHER MUSCULOSKELET SYS & '.
100200         05  FILLER   PIC X(57)  VALUE
100300     '516 020160 045       055  Y Y  OTHER MUSCULOSKELET SYS & '.
100400         05  FILLER   PIC X(57)  VALUE
100500     '517 016777 028       034  Y Y  OTHER MUSCULOSKELET SYS & '.
100600         05  FILLER   PIC X(57)  VALUE
100700     '533 013759 043       056  Y    FRACTURES OF FEMUR W MCC  '.
100800         05  FILLER   PIC X(57)  VALUE
100900     '534 007364 029       036  Y    FRACTURES OF FEMUR W/O MCC'.
101000         05  FILLER   PIC X(57)  VALUE
101100     '535 013085 042       054  Y    FRACTURES OF HIP & PELVIS '.
101200         05  FILLER   PIC X(57)  VALUE
101300     '536 007091 030       035  Y    FRACTURES OF HIP & PELVIS '.
101400         05  FILLER   PIC X(57)  VALUE
101500     '537 008604 034       040       SPRAINS, STRAINS, & DISLOC'.
101600         05  FILLER   PIC X(57)  VALUE
101700     '538 006870 024       028       SPRAINS, STRAINS, & DISLOC'.
101800         05  FILLER   PIC X(57)  VALUE
101900     '539 018631 062       081  Y    OSTEOMYELITIS W MCC       '.
102000         05  FILLER   PIC X(57)  VALUE
102100     '540 013063 049       061  Y    OSTEOMYELITIS W CC        '.
102200         05  FILLER   PIC X(57)  VALUE
102300     '541 009743 036       047  Y    OSTEOMYELITIS W/O CC/MCC  '.
102400         05  FILLER   PIC X(57)  VALUE
102500     '542 019451 060       079  Y    PATHOLOGICAL FRACTURES & M'.
102600         05  FILLER   PIC X(57)  VALUE
102700     '543 011267 042       052  Y    PATHOLOGICAL FRACTURES & M'.
102800         05  FILLER   PIC X(57)  VALUE
102900     '544 007736 032       037  Y    PATHOLOGICAL FRACTURES & M'.
103000         05  FILLER   PIC X(57)  VALUE
103100     '545 024445 060       085  Y    CONNECTIVE TISSUE DISORDER'.
103200         05  FILLER   PIC X(57)  VALUE
103300     '546 011711 040       050  Y    CONNECTIVE TISSUE DISORDER'.
103400         05  FILLER   PIC X(57)  VALUE
103500     '547 008061 029       036  Y    CONNECTIVE TISSUE DISORDER'.
103600         05  FILLER   PIC X(57)  VALUE
103700     '548 017811 059       076       SEPTIC ARTHRITIS W MCC    '.
103800         05  FILLER   PIC X(57)  VALUE
103900     '549 011101 043       052       SEPTIC ARTHRITIS W CC     '.
104000         05  FILLER   PIC X(57)  VALUE
104100     '550 008149 031       038       SEPTIC ARTHRITIS W/O CC/MC'.
104200         05  FILLER   PIC X(57)  VALUE
104300     '551 016317 050       064  Y    MEDICAL BACK PROBLEMS W MC'.
104400         05  FILLER   PIC X(57)  VALUE
104500     '552 008467 032       039  Y    MEDICAL BACK PROBLEMS W/O '.
104600         05  FILLER   PIC X(57)  VALUE
104700     '553 012370 044       056       BONE DISEASES & ARTHROPATH'.
104800         05  FILLER   PIC X(57)  VALUE
104900     '554 007181 029       036       BONE DISEASES & ARTHROPATH'.
105000         05  FILLER   PIC X(57)  VALUE
105100     '555 011974 037       050       SIGNS & SYMPTOMS OF MUSCUL'.
105200         05  FILLER   PIC X(57)  VALUE
105300     '556 007066 026       032       SIGNS & SYMPTOMS OF MUSCUL'.
105400         05  FILLER   PIC X(57)  VALUE
105500     '557 014756 051       064  Y    TENDONITIS, MYOSITIS & BUR'.
105600         05  FILLER   PIC X(57)  VALUE
105700     '558 008337 034       040  Y    TENDONITIS, MYOSITIS & BUR'.
105800         05  FILLER   PIC X(57)  VALUE
105900     '559 018639 050       069  Y    AFTERCARE, MUSCULOSKELETAL'.
106000         05  FILLER   PIC X(57)  VALUE
106100     '560 010260 034       044  Y    AFTERCARE, MUSCULOSKELETAL'.
106200         05  FILLER   PIC X(57)  VALUE
106300     '561 006408 020       025  Y    AFTERCARE, MUSCULOSKELETAL'.
106400         05  FILLER   PIC X(57)  VALUE
106500     '562 013528 044       055  Y    FX, SPRN, STRN & DISL EXCE'.
106600         05  FILLER   PIC X(57)  VALUE
106700     '563 007535 030       035  Y    FX, SPRN, STRN & DISL EXCE'.
106800         05  FILLER   PIC X(57)  VALUE
106900     '564 014855 045       061       OTHER MUSCULOSKELETAL SYS '.
107000         05  FILLER   PIC X(57)  VALUE
107100     '565 009281 036       044       OTHER MUSCULOSKELETAL SYS '.
107200         05  FILLER   PIC X(57)  VALUE
107300     '566 006642 026       033       OTHER MUSCULOSKELETAL SYS '.
107400         05  FILLER   PIC X(57)  VALUE
107500     '570 024154 072       094  Y    SKIN DEBRIDEMENT W MCC    '.
107600         05  FILLER   PIC X(57)  VALUE
107700     '571 014906 054       065  Y    SKIN DEBRIDEMENT W CC     '.
107800         05  FILLER   PIC X(57)  VALUE
107900     '572 010077 038       046  Y    SKIN DEBRIDEMENT W/O CC/MC'.
108000         05  FILLER   PIC X(57)  VALUE
108100     '573 034623 082       123  Y    SKIN GRAFT FOR SKIN ULCER '.
108200         05  FILLER   PIC X(57)  VALUE
108300     '574 026883 071       096  Y    SKIN GRAFT FOR SKIN ULCER '.
108400         05  FILLER   PIC X(57)  VALUE
108500     '575 014376 042       054  Y    SKIN GRAFT FOR SKIN ULCER '.
108600         05  FILLER   PIC X(57)  VALUE
108700     '576 042927 079       123       SKIN GRAFT EXC FOR SKIN UL'.
108800         05  FILLER   PIC X(57)  VALUE
108900     '577 020212 040       059       SKIN GRAFT EXC FOR SKIN UL'.
109000         05  FILLER   PIC X(57)  VALUE
109100     '578 012617 024       033       SKIN GRAFT EXC FOR SKIN UL'.
109200         05  FILLER   PIC X(57)  VALUE
109300     '579 026106 070       092  Y    OTHER SKIN, SUBCUT TISS & '.
109400         05  FILLER   PIC X(57)  VALUE
109500     '580 015398 038       051  Y    OTHER SKIN, SUBCUT TISS & '.
109600         05  FILLER   PIC X(57)  VALUE
109700     '581 010605 020       026  Y    OTHER SKIN, SUBCUT TISS & '.
109800         05  FILLER   PIC X(57)  VALUE
109900     '582 011913 020       027       MASTECTOMY FOR MALIGNANCY '.
110000         05  FILLER   PIC X(57)  VALUE
110100     '583 009711 015       017       MASTECTOMY FOR MALIGNANCY '.
110200         05  FILLER   PIC X(57)  VALUE
110300     '584 016998 035       048       BREAST BIOPSY, LOCAL EXCIS'.
110400         05  FILLER   PIC X(57)  VALUE
110500     '585 013162 020       026       BREAST BIOPSY, LOCAL EXCIS'.
110600         05  FILLER   PIC X(57)  VALUE
110700     '592 014131 051       066  Y    SKIN ULCERS W MCC         '.
110800         05  FILLER   PIC X(57)  VALUE
110900     '593 010094 042       051  Y    SKIN ULCERS W CC          '.
111000         05  FILLER   PIC X(57)  VALUE
111100     '594 006814 031       039  Y    SKIN ULCERS W/O CC/MCC    '.
111200         05  FILLER   PIC X(57)  VALUE
111300     '595 019464 057       078       MAJOR SKIN DISORDERS W MCC'.
111400         05  FILLER   PIC X(57)  VALUE
111500     '596 009284 036       046       MAJOR SKIN DISORDERS W/O M'.
111600         05  FILLER   PIC X(57)  VALUE
111700     '597 017064 052       071       MALIGNANT BREAST DISORDERS'.
111800         05  FILLER   PIC X(57)  VALUE
111900     '598 010817 039       051       MALIGNANT BREAST DISORDERS'.
112000         05  FILLER   PIC X(57)  VALUE
112100     '599 006547 025       031       MALIGNANT BREAST DISORDERS'.
112200         05  FILLER   PIC X(57)  VALUE
112300     '600 009963 038       047       NON-MALIGNANT BREAST DISOR'.
112400         05  FILLER   PIC X(57)  VALUE
112500     '601 006445 028       034       NON-MALIGNANT BREAST DISOR'.
112600         05  FILLER   PIC X(57)  VALUE
112700     '602 014607 050       063  Y    CELLULITIS W MCC          '.
112800         05  FILLER   PIC X(57)  VALUE
112900     '603 008402 036       042  Y    CELLULITIS W/O MCC        '.
113000         05  FILLER   PIC X(57)  VALUE
113100     '604 013223 039       051       TRAUMA TO THE SKIN, SUBCUT'.
113200         05  FILLER   PIC X(57)  VALUE
113300     '605 007372 026       032       TRAUMA TO THE SKIN, SUBCUT'.
113400         05  FILLER   PIC X(57)  VALUE
113500     '606 013594 043       060       MINOR SKIN DISORDERS W MCC'.
113600         05  FILLER   PIC X(57)  VALUE
113700     '607 007043 028       036       MINOR SKIN DISORDERS W/O M'.
113800         05  FILLER   PIC X(57)  VALUE
113900     '614 025455 043       059       ADRENAL & PITUITARY PROCED'.
114000         05  FILLER   PIC X(57)  VALUE
114100     '615 014579 023       027       ADRENAL & PITUITARY PROCED'.
114200         05  FILLER   PIC X(57)  VALUE
114300     '616 040773 109       131  Y    AMPUTAT OF LOWER LIMB FOR '.
114400         05  FILLER   PIC X(57)  VALUE
114500     '617 020071 061       074  Y    AMPUTAT OF LOWER LIMB FOR '.
114600         05  FILLER   PIC X(57)  VALUE
114700     '618 012489 043       052  Y    AMPUTAT OF LOWER LIMB FOR '.
114800         05  FILLER   PIC X(57)  VALUE
114900     '619 036200 048       077       O.R. PROCEDURES FOR OBESIT'.
115000         05  FILLER   PIC X(57)  VALUE
115100     '620 019399 027       032       O.R. PROCEDURES FOR OBESIT'.
115200         05  FILLER   PIC X(57)  VALUE
115300     '621 015772 018       020       O.R. PROCEDURES FOR OBESIT'.
115400         05  FILLER   PIC X(57)  VALUE
115500     '622 033505 091       122  Y    SKIN GRAFTS & WOUND DEBRID'.
115600         05  FILLER   PIC X(57)  VALUE
115700     '623 018239 057       071  Y    SKIN GRAFTS & WOUND DEBRID'.
115800         05  FILLER   PIC X(57)  VALUE
115900     '624 009635 035       042  Y    SKIN GRAFTS & WOUND DEBRID'.
116000         05  FILLER   PIC X(57)  VALUE
116100     '625 024009 044       073       THYROID, PARATHYROID & THY'.
116200         05  FILLER   PIC X(57)  VALUE
116300     '626 012459 020       028       THYROID, PARATHYROID & THY'.
116400         05  FILLER   PIC X(57)  VALUE
116500     '627 008458 013       014       THYROID, PARATHYROID & THY'.
116600         05  FILLER   PIC X(57)  VALUE
116700     '628 033515 066       096  Y    OTHER ENDOCRINE, NUTRIT & '.
116800         05  FILLER   PIC X(57)  VALUE
116900     '629 021292 060       072  Y    OTHER ENDOCRINE, NUTRIT & '.
117000         05  FILLER   PIC X(57)  VALUE
117100     '630 013444 030       038  Y    OTHER ENDOCRINE, NUTRIT & '.
117200         05  FILLER   PIC X(57)  VALUE
117300     '637 013888 042       055  Y    DIABETES W MCC            '.
117400         05  FILLER   PIC X(57)  VALUE
117500     '638 008252 030       037  Y    DIABETES W CC             '.
117600         05  FILLER   PIC X(57)  VALUE
117700     '639 005708 022       026  Y    DIABETES W/O CC/MCC       '.
117800         05  FILLER   PIC X(57)  VALUE
117900     '640 011111 033       046  Y    MISC DISORDERS OF NUTRITIO'.
118000         05  FILLER   PIC X(57)  VALUE
118100     '641 006992 028       034  Y    MISC DISORDERS OF NUTRITIO'.
118200         05  FILLER   PIC X(57)  VALUE
118300     '642 010674 032       042       INBORN AND OTHER DISORDERS'.
118400         05  FILLER   PIC X(57)  VALUE
118500     '643 016693 055       069  Y    ENDOCRINE DISORDERS W MCC '.
118600         05  FILLER   PIC X(57)  VALUE
118700     '644 010194 039       047  Y    ENDOCRINE DISORDERS W CC  '.
118800         05  FILLER   PIC X(57)  VALUE
118900     '645 007041 028       034  Y    ENDOCRINE DISORDERS W/O CC'.
119000         05  FILLER   PIC X(57)  VALUE
119100     '652 031530 058       068       KIDNEY TRANSPLANT         '.
119200         05  FILLER   PIC X(57)  VALUE
119300     '653 059558 127       154  Y    MAJOR BLADDER PROCEDURES W'.
119400         05  FILLER   PIC X(57)  VALUE
119500     '654 030944 078       089  Y    MAJOR BLADDER PROCEDURES W'.
119600         05  FILLER   PIC X(57)  VALUE
119700     '655 021671 047       055  Y    MAJOR BLADDER PROCEDURES W'.
119800         05  FILLER   PIC X(57)  VALUE
119900     '656 035221 072       093       KIDNEY & URETER PROCEDURES'.
120000         05  FILLER   PIC X(57)  VALUE
120100     '657 020261 045       054       KIDNEY & URETER PROCEDURES'.
120200         05  FILLER   PIC X(57)  VALUE
120300     '658 015074 028       031       KIDNEY & URETER PROCEDURES'.
120400         05  FILLER   PIC X(57)  VALUE
120500     '659 034051 076       103  Y    KIDNEY & URETER PROCEDURES'.
120600         05  FILLER   PIC X(57)  VALUE
120700     '660 018827 043       056  Y    KIDNEY & URETER PROCEDURES'.
120800         05  FILLER   PIC X(57)  VALUE
120900     '661 013435 023       028  Y    KIDNEY & URETER PROCEDURES'.
121000         05  FILLER   PIC X(57)  VALUE
121100     '662 029801 077       102       MINOR BLADDER PROCEDURES W'.
121200         05  FILLER   PIC X(57)  VALUE
121300     '663 015666 039       053       MINOR BLADDER PROCEDURES W'.
121400         05  FILLER   PIC X(57)  VALUE
121500     '664 012208 017       022       MINOR BLADDER PROCEDURES W'.
121600         05  FILLER   PIC X(57)  VALUE
121700     '665 031414 092       117       PROSTATECTOMY W MCC       '.
121800         05  FILLER   PIC X(57)  VALUE
121900     '666 017042 045       062       PROSTATECTOMY W CC        '.
122000         05  FILLER   PIC X(57)  VALUE
122100     '667 008949 020       026       PROSTATECTOMY W/O CC/MCC  '.
122200         05  FILLER   PIC X(57)  VALUE
122300     '668 025573 066       088       TRANSURETHRAL PROCEDURES W'.
122400         05  FILLER   PIC X(57)  VALUE
122500     '669 012693 030       041       TRANSURETHRAL PROCEDURES W'.
122600         05  FILLER   PIC X(57)  VALUE
122700     '670 008354 019       024       TRANSURETHRAL PROCEDURES W'.
122800         05  FILLER   PIC X(57)  VALUE
122900     '671 015887 043       057       URETHRAL PROCEDURES W CC/M'.
123000         05  FILLER   PIC X(57)  VALUE
123100     '672 008835 019       023       URETHRAL PROCEDURES W/O CC'.
123200         05  FILLER   PIC X(57)  VALUE
123300     '673 031150 065       097       OTHER KIDNEY & URINARY TRA'.
123400         05  FILLER   PIC X(57)  VALUE
123500     '674 022378 051       069       OTHER KIDNEY & URINARY TRA'.
123600         05  FILLER   PIC X(57)  VALUE
123700     '675 013807 019       027       OTHER KIDNEY & URINARY TRA'.
123800         05  FILLER   PIC X(57)  VALUE
123900     '682 015401 047       062  Y    RENAL FAILURE W MCC       '.
124000         05  FILLER   PIC X(57)  VALUE
124100     '683 009655 037       045  Y    RENAL FAILURE W CC        '.
124200         05  FILLER   PIC X(57)  VALUE
124300     '684 006213 025       030  Y    RENAL FAILURE W/O CC/MCC  '.
124400         05  FILLER   PIC X(57)  VALUE
124500     '685 009282 026       034       ADMIT FOR RENAL DIALYSIS  '.
124600         05  FILLER   PIC X(57)  VALUE
124700     '686 017237 054       072       KIDNEY & URINARY TRACT NEO'.
124800         05  FILLER   PIC X(57)  VALUE
124900     '687 010441 037       048       KIDNEY & URINARY TRACT NEO'.
125000         05  FILLER   PIC X(57)  VALUE
125100     '688 006867 022       027       KIDNEY & URINARY TRACT NEO'.
125200         05  FILLER   PIC X(57)  VALUE
125300     '689 011300 043       053  Y    KIDNEY & URINARY TRACT INF'.
125400         05  FILLER   PIC X(57)  VALUE
125500     '690 007693 032       038  Y    KIDNEY & URINARY TRACT INF'.
125600         05  FILLER   PIC X(57)  VALUE
125700     '691 015454 030       038       URINARY STONES W ESW LITHO'.
125800         05  FILLER   PIC X(57)  VALUE
125900     '692 010690 017       020       URINARY STONES W ESW LITHO'.
126000         05  FILLER   PIC X(57)  VALUE
126100     '693 014186 041       053       URINARY STONES W/O ESW LIT'.
126200         05  FILLER   PIC X(57)  VALUE
126300     '694 006879 020       024       URINARY STONES W/O ESW LIT'.
126400         05  FILLER   PIC X(57)  VALUE
126500     '695 012773 042       055       KIDNEY & URINARY TRACT SIG'.
126600         05  FILLER   PIC X(57)  VALUE
126700     '696 006615 025       031       KIDNEY & URINARY TRACT SIG'.
126800         05  FILLER   PIC X(57)  VALUE
126900     '697 008225 025       032       URETHRAL STRICTURE        '.
127000         05  FILLER   PIC X(57)  VALUE
127100     '698 015681 051       064  Y    OTHER KIDNEY & URINARY TRA'.
127200         05  FILLER   PIC X(57)  VALUE
127300     '699 009890 035       044  Y    OTHER KIDNEY & URINARY TRA'.
127400         05  FILLER   PIC X(57)  VALUE
127500     '700 007026 026       032  Y    OTHER KIDNEY & URINARY TRA'.
127600         05  FILLER   PIC X(57)  VALUE
127700     '707 018265 030       041       MAJOR MALE PELVIC PROCEDUR'.
127800         05  FILLER   PIC X(57)  VALUE
127900     '708 012928 014       016       MAJOR MALE PELVIC PROCEDUR'.
128000         05  FILLER   PIC X(57)  VALUE
128100     '709 021038 040       062       PENIS PROCEDURES W CC/MCC '.
128200         05  FILLER   PIC X(57)  VALUE
128300     '710 013429 015       019       PENIS PROCEDURES W/O CC/MC'.
128400         05  FILLER   PIC X(57)  VALUE
128500     '711 020316 055       076       TESTES PROCEDURES W CC/MCC'.
128600         05  FILLER   PIC X(57)  VALUE
128700     '712 009580 023       030       TESTES PROCEDURES W/O CC/M'.
128800         05  FILLER   PIC X(57)  VALUE
128900     '713 013814 033       045       TRANSURETHRAL PROSTATECTOM'.
129000         05  FILLER   PIC X(57)  VALUE
129100     '714 007402 017       020       TRANSURETHRAL PROSTATECTOM'.
129200         05  FILLER   PIC X(57)  VALUE
129300     '715 022268 055       078       OTHER MALE REPRODUCTIVE SY'.
129400         05  FILLER   PIC X(57)  VALUE
129500     '716 009629 015       018       OTHER MALE REPRODUCTIVE SY'.
129600         05  FILLER   PIC X(57)  VALUE
129700     '717 017495 049       067       OTHER MALE REPRODUCTIVE SY'.
129800         05  FILLER   PIC X(57)  VALUE
129900     '718 008786 023       029       OTHER MALE REPRODUCTIVE SY'.
130000         05  FILLER   PIC X(57)  VALUE
130100     '722 016031 053       071       MALIGNANCY, MALE REPRODUCT'.
130200         05  FILLER   PIC X(57)  VALUE
130300     '723 010532 039       050       MALIGNANCY, MALE REPRODUCT'.
130400         05  FILLER   PIC X(57)  VALUE
130500     '724 005501 018       024       MALIGNANCY, MALE REPRODUCT'.
130600         05  FILLER   PIC X(57)  VALUE
130700     '725 012644 044       056       BENIGN PROSTATIC HYPERTROP'.
130800         05  FILLER   PIC X(57)  VALUE
130900     '726 007159 028       034       BENIGN PROSTATIC HYPERTROP'.
131000         05  FILLER   PIC X(57)  VALUE
131100     '727 014106 048       062       INFLAMMATION OF THE MALE R'.
131200         05  FILLER   PIC X(57)  VALUE
131300     '728 007821 032       039       INFLAMMATION OF THE MALE R'.
131400         05  FILLER   PIC X(57)  VALUE
131500     '729 011196 037       050       OTHER MALE REPRODUCTIVE SY'.
131600         05  FILLER   PIC X(57)  VALUE
131700     '730 006266 022       028       OTHER MALE REPRODUCTIVE SY'.
131800         05  FILLER   PIC X(57)  VALUE
131900     '734 025547 046       067       PELVIC EVISCERATION, RAD H'.
132000         05  FILLER   PIC X(57)  VALUE
132100     '735 011910 019       023       PELVIC EVISCERATION, RAD H'.
132200         05  FILLER   PIC X(57)  VALUE
132300     '736 042211 101       124       UTERINE & ADNEXA PROC FOR '.
132400         05  FILLER   PIC X(57)  VALUE
132500     '737 020310 053       062       UTERINE & ADNEXA PROC FOR '.
132600         05  FILLER   PIC X(57)  VALUE
132700     '738 012602 029       033       UTERINE & ADNEXA PROC FOR '.
132800         05  FILLER   PIC X(57)  VALUE
132900     '739 031647 065       087       UTERINE,ADNEXA PROC FOR NO'.
133000         05  FILLER   PIC X(57)  VALUE
133100     '740 015819 031       041       UTERINE,ADNEXA PROC FOR NO'.
133200         05  FILLER   PIC X(57)  VALUE
133300     '741 011470 018       021       UTERINE,ADNEXA PROC FOR NO'.
133400         05  FILLER   PIC X(57)  VALUE
133500     '742 014972 030       040       UTERINE & ADNEXA PROC FOR '.
133600         05  FILLER   PIC X(57)  VALUE
133700     '743 009903 017       019       UTERINE & ADNEXA PROC FOR '.
133800         05  FILLER   PIC X(57)  VALUE
133900     '744 015084 039       055       D&C, CONIZATION, LAPAROSCO'.
134000         05  FILLER   PIC X(57)  VALUE
134100     '745 008514 019       024       D&C, CONIZATION, LAPAROSCO'.
134200         05  FILLER   PIC X(57)  VALUE
134300     '746 013694 030       043       VAGINA, CERVIX & VULVA PRO'.
134400         05  FILLER   PIC X(57)  VALUE
134500     '747 008814 016       018       VAGINA, CERVIX & VULVA PRO'.
134600         05  FILLER   PIC X(57)  VALUE
134700     '748 010096 015       018       FEMALE REPRODUCTIVE SYSTEM'.
134800         05  FILLER   PIC X(57)  VALUE
134900     '749 026239 061       084       OTHER FEMALE REPRODUCTIVE '.
135000         05  FILLER   PIC X(57)  VALUE
135100     '750 010854 022       028       OTHER FEMALE REPRODUCTIVE '.
135200         05  FILLER   PIC X(57)  VALUE
135300     '754 019784 058       084       MALIGNANCY, FEMALE REPRODU'.
135400         05  FILLER   PIC X(57)  VALUE
135500     '755 010880 037       050       MALIGNANCY, FEMALE REPRODU'.
135600         05  FILLER   PIC X(57)  VALUE
135700     '756 006334 021       026       MALIGNANCY, FEMALE REPRODU'.
135800         05  FILLER   PIC X(57)  VALUE
135900     '757 015292 057       072       INFECTIONS, FEMALE REPRODU'.
136000         05  FILLER   PIC X(57)  VALUE
136100     '758 010452 042       052       INFECTIONS, FEMALE REPRODU'.
136200         05  FILLER   PIC X(57)  VALUE
136300     '759 006995 032       038       INFECTIONS, FEMALE REPRODU'.
136400         05  FILLER   PIC X(57)  VALUE
136500     '760 008063 028       036       MENSTRUAL & OTHER FEMALE R'.
136600         05  FILLER   PIC X(57)  VALUE
136700     '761 004904 018       022       MENSTRUAL & OTHER FEMALE R'.
136800         05  FILLER   PIC X(57)  VALUE
136900     '765 011125 039       048       CESAREAN SECTION W CC/MCC '.
137000         05  FILLER   PIC X(57)  VALUE
137100     '766 007766 029       031       CESAREAN SECTION W/O CC/MC'.
137200         05  FILLER   PIC X(57)  VALUE
137300     '767 009235 027       036       VAGINAL DELIVERY W STERILI'.
137400         05  FILLER   PIC X(57)  VALUE
137500     '768 010976 031       032       VAGINAL DELIVERY W O.R. PR'.
137600         05  FILLER   PIC X(57)  VALUE
137700     '769 021785 043       064       POSTPARTUM & POST ABORTION'.
137800         05  FILLER   PIC X(57)  VALUE
137900     '770 007070 016       021       ABORTION W D&C, ASPIRATION'.
138000         05  FILLER   PIC X(57)  VALUE
138100     '774 007137 025       030       VAGINAL DELIVERY W COMPLIC'.
138200         05  FILLER   PIC X(57)  VALUE
138300     '775 005625 021       023       VAGINAL DELIVERY W/O COMPL'.
138400         05  FILLER   PIC X(57)  VALUE
138500     '776 007075 025       034       POSTPARTUM & POST ABORTION'.
138600         05  FILLER   PIC X(57)  VALUE
138700     '777 009550 016       021       ECTOPIC PREGNANCY         '.
138800         05  FILLER   PIC X(57)  VALUE
138900     '778 005247 019       029       THREATENED ABORTION       '.
139000         05  FILLER   PIC X(57)  VALUE
139100     '779 004843 015       018       ABORTION W/O D&C          '.
139200         05  FILLER   PIC X(57)  VALUE
139300     '780 002515 012       014       FALSE LABOR               '.
139400         05  FILLER   PIC X(57)  VALUE
139500     '781 007568 027       039       OTHER ANTEPARTUM DIAGNOSES'.
139600         05  FILLER   PIC X(57)  VALUE
139700     '782 004463 016       023       OTHER ANTEPARTUM DIAGNOSES'.
139800         05  FILLER   PIC X(57)  VALUE
139900     '789 015258 018       018       NEONATES, DIED OR TRANSFER'.
140000         05  FILLER   PIC X(57)  VALUE
140100     '790 050315 179       179       EXTREME IMMATURITY OR RESP'.
140200         05  FILLER   PIC X(57)  VALUE
140300     '791 034363 133       133       PREMATURITY W MAJOR PROBLE'.
140400         05  FILLER   PIC X(57)  VALUE
140500     '792 020734 086       086       PREMATURITY W/O MAJOR PROB'.
140600         05  FILLER   PIC X(57)  VALUE
140700     '793 035299 047       047       FULL TERM NEONATE W MAJOR '.
140800         05  FILLER   PIC X(57)  VALUE
140900     '794 012494 034       034       NEONATE W OTHER SIGNIFICAN'.
141000         05  FILLER   PIC X(57)  VALUE
141100     '795 001692 031       031       NORMAL NEWBORN            '.
141200         05  FILLER   PIC X(57)  VALUE
141300     '799 050639 099       129       SPLENECTOMY W MCC         '.
141400         05  FILLER   PIC X(57)  VALUE
141500     '800 025234 052       068       SPLENECTOMY W CC          '.
141600         05  FILLER   PIC X(57)  VALUE
141700     '801 015980 028       035       SPLENECTOMY W/O CC/MCC    '.
141800         05  FILLER   PIC X(57)  VALUE
141900     '802 031642 077       104       OTHER O.R. PROC OF THE BLO'.
142000         05  FILLER   PIC X(57)  VALUE
142100     '803 018831 047       063       OTHER O.R. PROC OF THE BLO'.
142200         05  FILLER   PIC X(57)  VALUE
142300     '804 011558 023       030       OTHER O.R. PROC OF THE BLO'.
142400         05  FILLER   PIC X(57)  VALUE
142500     '808 022217 061       081       MAJOR HEMATOL/IMMUN DIAG E'.
142600         05  FILLER   PIC X(57)  VALUE
142700     '809 011901 038       048       MAJOR HEMATOL/IMMUN DIAG E'.
142800         05  FILLER   PIC X(57)  VALUE
142900     '810 008226 027       033       MAJOR HEMATOL/IMMUN DIAG E'.
143000         05  FILLER   PIC X(57)  VALUE
143100     '811 012488 036       048       RED BLOOD CELL DISORDERS W'.
143200         05  FILLER   PIC X(57)  VALUE
143300     '812 007985 026       034       RED BLOOD CELL DISORDERS W'.
143400         05  FILLER   PIC X(57)  VALUE
143500     '813 016433 036       050       COAGULATION DISORDERS     '.
143600         05  FILLER   PIC X(57)  VALUE
143700     '814 016910 049       068       RETICULOENDOTHELIAL & IMMU'.
143800         05  FILLER   PIC X(57)  VALUE
143900     '815 009844 033       042       RETICULOENDOTHELIAL & IMMU'.
144000         05  FILLER   PIC X(57)  VALUE
144100     '816 006655 024       029       RETICULOENDOTHELIAL & IMMU'.
144200         05  FILLER   PIC X(57)  VALUE
144300     '820 058779 130       171       LYMPHOMA & LEUKEMIA W MAJO'.
144400         05  FILLER   PIC X(57)  VALUE
144500     '821 024025 048       069       LYMPHOMA & LEUKEMIA W MAJO'.
144600         05  FILLER   PIC X(57)  VALUE
144700     '822 012336 022       028       LYMPHOMA & LEUKEMIA W MAJO'.
144800         05  FILLER   PIC X(57)  VALUE
144900     '823 044850 113       147       LYMPHOMA & NON-ACUTE LEUKE'.
145000         05  FILLER   PIC X(57)  VALUE
145100     '824 021684 059       077       LYMPHOMA & NON-ACUTE LEUKE'.
145200         05  FILLER   PIC X(57)  VALUE
145300     '825 012935 029       040       LYMPHOMA & NON-ACUTE LEUKE'.
145400         05  FILLER   PIC X(57)  VALUE
145500     '826 049280 108       140       MYELOPROLIF DISORD OR POOR'.
145600         05  FILLER   PIC X(57)  VALUE
145700     '827 022746 053       068       MYELOPROLIF DISORD OR POOR'.
145800         05  FILLER   PIC X(57)  VALUE
145900     '828 013642 027       033       MYELOPROLIF DISORD OR POOR'.
146000         05  FILLER   PIC X(57)  VALUE
146100     '829 031769 067       102       MYELOPROLIF DISORD OR POOR'.
146200         05  FILLER   PIC X(57)  VALUE
146300     '830 012781 024       031       MYELOPROLIF DISORD OR POOR'.
146400         05  FILLER   PIC X(57)  VALUE
146500     '834 053828 103       168       ACUTE LEUKEMIA W/O MAJOR O'.
146600         05  FILLER   PIC X(57)  VALUE
146700     '835 021606 046       075       ACUTE LEUKEMIA W/O MAJOR O'.
146800         05  FILLER   PIC X(57)  VALUE
146900     '836 012240 029       043       ACUTE LEUKEMIA W/O MAJOR O'.
147000         05  FILLER   PIC X(57)  VALUE
147100     '837 060485 156       212       CHEMO W ACUTE LEUKEMIA AS '.
147200         05  FILLER   PIC X(57)  VALUE
147300     '838 028181 067       097       CHEMO W ACUTE LEUKEMIA AS '.
147400         05  FILLER   PIC X(57)  VALUE
147500     '839 013175 048       055       CHEMO W ACUTE LEUKEMIA AS '.
147600         05  FILLER   PIC X(57)  VALUE
147700     '840 030843 075       105  Y    LYMPHOMA & NON-ACUTE LEUKE'.
147800         05  FILLER   PIC X(57)  VALUE
147900     '841 016167 048       063  Y    LYMPHOMA & NON-ACUTE LEUKE'.
148000         05  FILLER   PIC X(57)  VALUE
148100     '842 010830 031       041  Y    LYMPHOMA & NON-ACUTE LEUKE'.
148200         05  FILLER   PIC X(57)  VALUE
148300     '843 017768 053       072       OTHER MYELOPROLIF DIS OR P'.
148400         05  FILLER   PIC X(57)  VALUE
148500     '844 011701 041       053       OTHER MYELOPROLIF DIS OR P'.
148600         05  FILLER   PIC X(57)  VALUE
148700     '845 007830 028       037       OTHER MYELOPROLIF DIS OR P'.
148800         05  FILLER   PIC X(57)  VALUE
148900     '846 024337 057       082       CHEMOTHERAPY W/O ACUTE LEU'.
149000         05  FILLER   PIC X(57)  VALUE
149100     '847 011062 030       036       CHEMOTHERAPY W/O ACUTE LEU'.
149200         05  FILLER   PIC X(57)  VALUE
149300     '848 008635 025       030       CHEMOTHERAPY W/O ACUTE LEU'.
149400         05  FILLER   PIC X(57)  VALUE
149500     '849 014239 046       060       RADIOTHERAPY              '.
149600         05  FILLER   PIC X(57)  VALUE
149700     '853 053491 111       143  Y    INFECTIOUS & PARASITIC DIS'.
149800         05  FILLER   PIC X(57)  VALUE
149900     '854 024891 070       085  Y    INFECTIOUS & PARASITIC DIS'.
150000         05  FILLER   PIC X(57)  VALUE
150100     '855 015849 036       049  Y    INFECTIOUS & PARASITIC DIS'.
150200         05  FILLER   PIC X(57)  VALUE
150300     '856 047874 101       134  Y    POSTOPERATIVE OR POST-TRAU'.
150400         05  FILLER   PIC X(57)  VALUE
150500     '857 020412 057       071  Y    POSTOPERATIVE OR POST-TRAU'.
150600         05  FILLER   PIC X(57)  VALUE
150700     '858 013115 039       048  Y    POSTOPERATIVE OR POST-TRAU'.
150800         05  FILLER   PIC X(57)  VALUE
150900     '862 018903 056       074  Y    POSTOPERATIVE & POST-TRAUM'.
151000         05  FILLER   PIC X(57)  VALUE
151100     '863 009845 038       046  Y    POSTOPERATIVE & POST-TRAUM'.
151200         05  FILLER   PIC X(57)  VALUE
151300     '864 008441 029       036       FEVER                     '.
151400         05  FILLER   PIC X(57)  VALUE
151500     '865 017351 049       068       VIRAL ILLNESS W MCC       '.
151600         05  FILLER   PIC X(57)  VALUE
151700     '866 007855 029       035       VIRAL ILLNESS W/O MCC     '.
151800         05  FILLER   PIC X(57)  VALUE
151900     '867 026139 068       092  Y    OTHER INFECTIOUS & PARASIT'.
152000         05  FILLER   PIC X(57)  VALUE
152100     '868 010775 040       050  Y    OTHER INFECTIOUS & PARASIT'.
152200         05  FILLER   PIC X(57)  VALUE
152300     '869 007406 029       035  Y    OTHER INFECTIOUS & PARASIT'.
152400         05  FILLER   PIC X(57)  VALUE
152500     '870 059187 125       146  Y    SEPTICEMIA OR SEVERE SEPSI'.
152600         05  FILLER   PIC X(57)  VALUE
152700     '871 018527 051       067  Y    SEPTICEMIA OR SEVERE SEPSI'.
152800         05  FILLER   PIC X(57)  VALUE
152900     '872 010687 041       049  Y    SEPTICEMIA OR SEVERE SEPSI'.
153000         05  FILLER   PIC X(57)  VALUE
153100     '876 028172 075       123       O.R. PROCEDURE W PRINCIPAL'.
153200         05  FILLER   PIC X(57)  VALUE
153300     '880 006388 022       029       ACUTE ADJUSTMENT REACTION '.
153400         05  FILLER   PIC X(57)  VALUE
153500     '881 006541 032       044       DEPRESSIVE NEUROSES       '.
153600         05  FILLER   PIC X(57)  VALUE
153700     '882 006953 032       044       NEUROSES EXCEPT DEPRESSIVE'.
153800         05  FILLER   PIC X(57)  VALUE
153900     '883 012682 047       077       DISORDERS OF PERSONALITY &'.
154000         05  FILLER   PIC X(57)  VALUE
154100     '884 010060 040       057  Y    ORGANIC DISTURBANCES & MEN'.
154200         05  FILLER   PIC X(57)  VALUE
154300     '885 010048 054       073       PSYCHOSES                 '.
154400         05  FILLER   PIC X(57)  VALUE
154500     '886 009173 042       071       BEHAVIORAL & DEVELOPMENTAL'.
154600         05  FILLER   PIC X(57)  VALUE
154700     '887 009795 029       045       OTHER MENTAL DISORDER DIAG'.
154800         05  FILLER   PIC X(57)  VALUE
154900     '894 004509 021       029       ALCOHOL/DRUG ABUSE OR DEPE'.
155000         05  FILLER   PIC X(57)  VALUE
155100     '895 011939 091       117       ALCOHOL/DRUG ABUSE OR DEPE'.
155200         05  FILLER   PIC X(57)  VALUE
155300     '896 015146 047       065  Y    ALCOHOL/DRUG ABUSE OR DEPE'.
155400         05  FILLER   PIC X(57)  VALUE
155500     '897 006824 032       040  Y    ALCOHOL/DRUG ABUSE OR DEPE'.
155600         05  FILLER   PIC X(57)  VALUE
155700     '901 040316 093       139       WOUND DEBRIDEMENTS FOR INJ'.
155800         05  FILLER   PIC X(57)  VALUE
155900     '902 017077 049       066       WOUND DEBRIDEMENTS FOR INJ'.
156000         05  FILLER   PIC X(57)  VALUE
156100     '903 010527 031       042       WOUND DEBRIDEMENTS FOR INJ'.
156200         05  FILLER   PIC X(57)  VALUE
156300     '904 031738 072       107       SKIN GRAFTS FOR INJURIES W'.
156400         05  FILLER   PIC X(57)  VALUE
156500     '905 012475 032       043       SKIN GRAFTS FOR INJURIES W'.
156600         05  FILLER   PIC X(57)  VALUE
156700     '906 012228 024       035       HAND PROCEDURES FOR INJURI'.
156800         05  FILLER   PIC X(57)  VALUE
156900     '907 039235 077       107  Y    OTHER O.R. PROCEDURES FOR '.
157000         05  FILLER   PIC X(57)  VALUE
157100     '908 019485 044       058  Y    OTHER O.R. PROCEDURES FOR '.
157200         05  FILLER   PIC X(57)  VALUE
157300     '909 012150 025       032  Y    OTHER O.R. PROCEDURES FOR '.
157400         05  FILLER   PIC X(57)  VALUE
157500     '913 011683 037       050       TRAUMATIC INJURY W MCC    '.
157600         05  FILLER   PIC X(57)  VALUE
157700     '914 007110 025       031       TRAUMATIC INJURY W/O MCC  '.
157800         05  FILLER   PIC X(57)  VALUE
157900     '915 014721 036       049       ALLERGIC REACTIONS W MCC  '.
158000         05  FILLER   PIC X(57)  VALUE
158100     '916 005139 017       021       ALLERGIC REACTIONS W/O MCC'.
158200         05  FILLER   PIC X(57)  VALUE
158300     '917 014093 035       048  Y    POISONING & TOXIC EFFECTS '.
158400         05  FILLER   PIC X(57)  VALUE
158500     '918 006346 021       027  Y    POISONING & TOXIC EFFECTS '.
158600         05  FILLER   PIC X(57)  VALUE
158700     '919 017206 044       061       COMPLICATIONS OF TREATMENT'.
158800         05  FILLER   PIC X(57)  VALUE
158900     '920 009779 031       040       COMPLICATIONS OF TREATMENT'.
159000         05  FILLER   PIC X(57)  VALUE
159100     '921 006522 022       028       COMPLICATIONS OF TREATMENT'.
159200         05  FILLER   PIC X(57)  VALUE
159300     '922 015088 040       056       OTHER INJURY, POISONING & '.
159400         05  FILLER   PIC X(57)  VALUE
159500     '923 006620 022       029       OTHER INJURY, POISONING & '.
159600         05  FILLER   PIC X(57)  VALUE
159700     '927 164534 223       307       EXTENSIVE BURNS OR FULL TH'.
159800         05  FILLER   PIC X(57)  VALUE
159900     '928 057744 119       161       FULL THICKNESS BURN W SKIN'.
160000         05  FILLER   PIC X(57)  VALUE
160100     '929 022090 051       072       FULL THICKNESS BURN W SKIN'.
160200         05  FILLER   PIC X(57)  VALUE
160300     '933 032785 026       082       EXTENSIVE BURNS OR FULL TH'.
160400         05  FILLER   PIC X(57)  VALUE
160500     '934 016045 042       061       FULL THICKNESS BURN W/O SK'.
160600         05  FILLER   PIC X(57)  VALUE
160700     '935 013909 032       048       NON-EXTENSIVE BURNS       '.
160800         05  FILLER   PIC X(57)  VALUE
160900     '939 031182 066       098       O.R. PROC W DIAGNOSES OF O'.
161000         05  FILLER   PIC X(57)  VALUE
161100     '940 017675 037       053       O.R. PROC W DIAGNOSES OF O'.
161200         05  FILLER   PIC X(57)  VALUE
161300     '941 013403 022       028       O.R. PROC W DIAGNOSES OF O'.
161400         05  FILLER   PIC X(57)  VALUE
161500     '945 013804 083       101  Y    REHABILITATION W CC/MCC   '.
161600         05  FILLER   PIC X(57)  VALUE
161700     '946 012037 065       074  Y    REHABILITATION W/O CC/MCC '.
161800         05  FILLER   PIC X(57)  VALUE
161900     '947 011324 036       048  Y    SIGNS & SYMPTOMS W MCC    '.
162000         05  FILLER   PIC X(57)  VALUE
162100     '948 006897 026       033  Y    SIGNS & SYMPTOMS W/O MCC  '.
162200         05  FILLER   PIC X(57)  VALUE
162300     '949 010038 028       041       AFTERCARE W CC/MCC        '.
162400         05  FILLER   PIC X(57)  VALUE
162500     '950 006005 023       035       AFTERCARE W/O CC/MCC      '.
162600         05  FILLER   PIC X(57)  VALUE
162700     '951 008578 024       055       OTHER FACTORS INFLUENCING '.
162800         05  FILLER   PIC X(57)  VALUE
162900     '955 054056 072       106       CRANIOTOMY FOR MULTIPLE SI'.
163000         05  FILLER   PIC X(57)  VALUE
163100     '956 038321 068       083  Y    LIMB REATTACHMENT, HIP & F'.
163200         05  FILLER   PIC X(57)  VALUE
163300     '957 067306 097       139       OTHER O.R. PROCEDURES FOR '.
163400         05  FILLER   PIC X(57)  VALUE
163500     '958 038734 073       089       OTHER O.R. PROCEDURES FOR '.
163600         05  FILLER   PIC X(57)  VALUE
163700     '959 025391 043       054       OTHER O.R. PROCEDURES FOR '.
163800         05  FILLER   PIC X(57)  VALUE
163900     '963 026733 055       081       OTHER MULTIPLE SIGNIFICANT'.
164000         05  FILLER   PIC X(57)  VALUE
164100     '964 013904 041       050       OTHER MULTIPLE SIGNIFICANT'.
164200         05  FILLER   PIC X(57)  VALUE
164300     '965 009824 030       036       OTHER MULTIPLE SIGNIFICANT'.
164400         05  FILLER   PIC X(57)  VALUE
164500     '969 054896 120       167       HIV W EXTENSIVE O.R. PROCE'.
164600         05  FILLER   PIC X(57)  VALUE
164700     '970 022785 049       071       HIV W EXTENSIVE O.R. PROCE'.
164800         05  FILLER   PIC X(57)  VALUE
164900     '974 026335 067       093       HIV W MAJOR RELATED CONDIT'.
165000         05  FILLER   PIC X(57)  VALUE
165100     '975 013383 047       061       HIV W MAJOR RELATED CONDIT'.
165200         05  FILLER   PIC X(57)  VALUE
165300     '976 008627 033       042       HIV W MAJOR RELATED CONDIT'.
165400         05  FILLER   PIC X(57)  VALUE
165500     '977 011194 036       048       HIV W OR W/O OTHER RELATED'.
165600         05  FILLER   PIC X(57)  VALUE
165700     '981 049319 101       131  Y    EXTENSIVE O.R. PROCEDURE U'.
165800         05  FILLER   PIC X(57)  VALUE
165900     '982 028504 059       076  Y    EXTENSIVE O.R. PROCEDURE U'.
166000         05  FILLER   PIC X(57)  VALUE
166100     '983 017462 028       038  Y    EXTENSIVE O.R. PROCEDURE U'.
166200         05  FILLER   PIC X(57)  VALUE
166300     '984 034143 093       125       PROSTATIC O.R. PROCEDURE U'.
166400         05  FILLER   PIC X(57)  VALUE
166500     '985 018859 051       072       PROSTATIC O.R. PROCEDURE U'.
166600         05  FILLER   PIC X(57)  VALUE
166700     '986 010389 021       030       PROSTATIC O.R. PROCEDURE U'.
166800         05  FILLER   PIC X(57)  VALUE
166900     '987 033422 084       112  Y    NON-EXTENSIVE O.R. PROC UN'.
167000         05  FILLER   PIC X(57)  VALUE
167100     '988 017554 048       064  Y    NON-EXTENSIVE O.R. PROC UN'.
167200         05  FILLER   PIC X(57)  VALUE
167300     '989 010430 023       030  Y    NON-EXTENSIVE O.R. PROC UN'.
167400         05  FILLER   PIC X(57)  VALUE
167500     '998 000000 000       000       PRINCIPAL DIAGNOSIS INVALI'.
167600         05  FILLER   PIC X(57)  VALUE
167700     '999 000000 000       000       UNGROUPABLE               '.
167800     02  WK-DRG-DATA2 REDEFINES WK-DRG-DATA.
167900         05  DRG-TAB OCCURS 751
168000                     ASCENDING KEY IS WK-DRG-DRGX
168100                     INDEXED BY DRG-IDX.
168200             10  DRG-DATA-TAB.
168300               15  WK-DRG-DRGX               PIC X(03).
168400               15  FILLER1                   PIC X(01).
168500               15  DRG-WEIGHT                PIC 9(02)V9(04).
168600               15  FILLER2                   PIC X(01).
168700               15  DRG-GMALOS                PIC 9(02)V9(01).
168800               15  FILLER3                   PIC X(05).
168900               15  DRG-LOW                   PIC X(01).
169000               15  FILLER5                   PIC X(01).
169100               15  DRG-ARITH-ALOS            PIC 9(02)V9(01).
169200               15  FILLER6                   PIC X(02).
169300               15  DRG-PAC                   PIC X(01).
169400               15  FILLER7                   PIC X(01).
169500               15  DRG-SPPAC                 PIC X(01).
169600               15  FILLER8                   PIC X(02).
169700               15  DRG-DESC                  PIC X(26).
169800*****YEARCHANGE 2014.0 ** NOT USED 2014 *******************
169900** USING THE STATE FACTORS TO ALTER THE WAGE INDEX WAS STOPPED*
170000** FOR FY 2011
170100***************************************************************
170200
170300 01  PPS-SSRFBN-TABLE.
170400     02  WK-SSRFBN-DATA.
170500         05  FILLER   PIC X(58)  VALUE
170600     '01  099835  01 ALABAMA                                   '.
170700         05  FILLER   PIC X(58)  VALUE
170800     '02  099835  02 ALASKA                                    '.
170900         05  FILLER   PIC X(58)  VALUE
171000     '03  099835  03 ARIZONA                                   '.
171100         05  FILLER   PIC X(58)  VALUE
171200     '04  099835  04 ARKANSAS                                  '.
171300         05  FILLER   PIC X(58)  VALUE
171400     '05  099317  05 CALIFORNIA                                '.
171500          05  FILLER   PIC X(58)  VALUE
171600     '06  099413  06 COLORADO                                  '.
171700         05  FILLER   PIC X(58)  VALUE
171800     '07  098016  07 CONNECTICUT                               '.
171900         05  FILLER   PIC X(58)  VALUE
172000     '08  099835  08 DELAWARE                                  '.
172100         05  FILLER   PIC X(58)  VALUE
172200     '09  099835  09 DISTRICT OF CO                            '.
172300         05  FILLER   PIC X(58)  VALUE
172400     '10  099756  10 FLORIDA                                   '.
172500         05  FILLER   PIC X(58)  VALUE
172600     '11  099835  11 GEORGIA                                   '.
172700         05  FILLER   PIC X(58)  VALUE
172800     '12  099835  12 HAWAII                                    '.
172900         05  FILLER   PIC X(58)  VALUE
173000     '13  099835  13 IDAHO                                     '.
173100         05  FILLER   PIC X(58)  VALUE
173200     '14  099835  14 ILLINOIS                                  '.
173300         05  FILLER   PIC X(58)  VALUE
173400     '15  099813  15 INDIANA                                   '.
173500         05  FILLER   PIC X(58)  VALUE
173600     '16  099783  16 IOWA                                      '.
173700         05  FILLER   PIC X(58)  VALUE
173800     '17  099827  17 KANSAS                                    '.
173900         05  FILLER   PIC X(58)  VALUE
174000     '18  099835  18 KENTUCKY                                  '.
174100         05  FILLER   PIC X(58)  VALUE
174200     '19  099834  19 LOUISIANA                                 '.
174300         05  FILLER   PIC X(58)  VALUE
174400     '20  099835  20 MAINE                                     '.
174500         05  FILLER   PIC X(58)  VALUE
174600     '21  100000  21 MARYLAND                                  '.
174700         05  FILLER   PIC X(58)  VALUE
174800     '22  099834  22 MASSACHUSETTS                             '.
174900         05  FILLER   PIC X(58)  VALUE
175000     '23  099833  23 MICHIGAN                                  '.
175100         05  FILLER   PIC X(58)  VALUE
175200     '24  099835  24 MINNESOTA                                 '.
175300         05  FILLER   PIC X(58)  VALUE
175400     '25  099834  25 MISSISSIPPI                               '.
175500         05  FILLER   PIC X(58)  VALUE
175600     '26  099835  26 MISSOURI                                  '.
175700         05  FILLER   PIC X(58)  VALUE
175800     '27  099835  27 MONTANA                                   '.
175900         05  FILLER   PIC X(58)  VALUE
176000     '28  099835  28 NEBRASKA                                  '.
176100         05  FILLER   PIC X(58)  VALUE
176200     '29  099835  29 NEVADA                                    '.
176300         05  FILLER   PIC X(58)  VALUE
176400     '30  099699  30 NEW HAMPSHIRE                             '.
176500         05  FILLER   PIC X(58)  VALUE
176600     '31  098587  31 NEW JERSEY                                '.
176700         05  FILLER   PIC X(58)  VALUE
176800     '32  099577  32 NEW MEXICO                                '.
176900         05  FILLER   PIC X(58)  VALUE
177000     '33  099835  33 NEW YORK                                  '.
177100         05  FILLER   PIC X(58)  VALUE
177200     '34  099834  34 NORTH CAROLINA                            '.
177300         05  FILLER   PIC X(58)  VALUE
177400     '35  099833  35 NORTH DAKOTA                              '.
177500         05  FILLER   PIC X(58)  VALUE
177600     '36  099784  36 OHIO                                      '.
177700         05  FILLER   PIC X(58)  VALUE
177800     '37  099835  37 OKLAHOMA                                  '.
177900         05  FILLER   PIC X(58)  VALUE
178000     '38  099708  38 OREGON                                    '.
178100         05  FILLER   PIC X(58)  VALUE
178200     '39  099834  39 PENNSYLVANIA                              '.
178300         05  FILLER   PIC X(58)  VALUE
178400     '40  099835  40 PUERTO RICO                               '.
178500         05  FILLER   PIC X(58)  VALUE
178600     '41  099835  41 RHODE ISLAND                              '.
178700         05  FILLER   PIC X(58)  VALUE
178800     '42  099779  42 SOUTH CAROLINA                            '.
178900         05  FILLER   PIC X(58)  VALUE
179000     '43  099834  43 SOUTH DAKOTA                              '.
179100         05  FILLER   PIC X(58)  VALUE
179200     '44  099690  44 TENNESSEE                                 '.
179300         05  FILLER   PIC X(58)  VALUE
179400     '45  099832  45 TEXAS                                     '.
179500         05  FILLER   PIC X(58)  VALUE
179600     '46  099835  46 UTAH                                      '.
179700         05  FILLER   PIC X(58)  VALUE
179800     '47  099835  47 VERMONT                                   '.
179900         05  FILLER   PIC X(58)  VALUE
180000     '48  100000  48 VIRGIN ISLANDS                            '.
180100         05  FILLER   PIC X(58)  VALUE
180200     '49  099835  49 VIRGINIA                                  '.
180300         05  FILLER   PIC X(58)  VALUE
180400     '50  099792  50 WASHINGTON                                '.
180500         05  FILLER   PIC X(58)  VALUE
180600     '51  099712  51 WEST VIRGINIA                             '.
180700         05  FILLER   PIC X(58)  VALUE
180800     '52  099816  52 WISCONSIN                                 '.
180900         05  FILLER   PIC X(58)  VALUE
181000     '53  099835  53 WYOMING                                   '.
181100         05  FILLER   PIC X(58)  VALUE
181200     '55  099317  55 CALIFORNIA                                '.
181300         05  FILLER   PIC X(58)  VALUE
181400     '56  100000  56 CANADA                                    '.
181500         05  FILLER   PIC X(58)  VALUE
181600     '59  100000  59 MEXICO                                    '.
181700         05  FILLER   PIC X(58)  VALUE
181800     '64  100000  64 AMERICAN SAMOA                            '.
181900         05  FILLER   PIC X(58)  VALUE
182000     '65  100000  65 GUAM                                      '.
182100         05  FILLER   PIC X(58)  VALUE
182200     '66  100000  66 MARIANAS ISLANDS                          '.
182300         05  FILLER   PIC X(58)  VALUE
182400     '67  099832  67 TEXAS                                     '.
182500         05  FILLER   PIC X(58)  VALUE
182600     '68  099756  68 FLORIDA                                   '.
182700         05  FILLER   PIC X(58)  VALUE
182800     '69  099756  69 FLORIDA                                   '.
182900         05  FILLER   PIC X(58)  VALUE
183000     '70  099827  70 KANSAS                                    '.
183100         05  FILLER   PIC X(58)  VALUE
183200     '71  099834  71 LOUISIANA                                 '.
183300         05  FILLER   PIC X(58)  VALUE
183400     '72  099784  72 OHIO                                      '.
183500         05  FILLER   PIC X(58)  VALUE
183600     '73  099834  73 PENNSYLVANIA                              '.
183700         05  FILLER   PIC X(58)  VALUE
183800     '74  099832  74 TEXAS                                     '.
183900         05  FILLER   PIC X(58)  VALUE
184000     '75  099317  75 CALIFORNIA                                '.
184100         05  FILLER   PIC X(58)  VALUE
184200     '76  099783  76 IOWA                                      '.
184300         05  FILLER   PIC X(58)  VALUE
184400     '77  099835  77 MINNESOTA                                 '.
184500         05  FILLER   PIC X(58)  VALUE
184600     '78  099835  78 ILLINOIS                                  '.
184700         05  FILLER   PIC X(58)  VALUE
184800     '80  100000  80 MARYLAND                                  '.
184900     02  WK-SSRFBN-DATA2 REDEFINES WK-SSRFBN-DATA.
185000       05  SSRFBN-TAB OCCURS 72 ASCENDING KEY IS WK-SSRFBN-STATE
185100                               INDEXED BY SSRFBN-IDX.
185200           10  WK-SSRFBN-REASON-ALL.
185300              15 WK-SSRFBN-STATE  PIC 99.
185400              15 FILLER           PIC XX.
185500              15 WK-SSRFBN-RATE   PIC 9(1)V9(5).
185600              15 FILLER           PIC XX.
185700              15 WK-SSRFBN-CODE2  PIC 99.
185800              15 FILLER           PIC XX.
185900              15 WK-SSRFBN-STNAM  PIC X(20).
186000              15 WK-SSRFBN-REST   PIC X(22).
186100
186200***********************************************************
186300*****YEARCHANGE 2014.0 ************************************
186400***********************************************************
186500***  LOW VOLUME TABLE NOT APPLICABLE FOR 2014
186600***********************************************************
186700
186800 01  LOWVOL-PROV-TABLE.
186900     05 LOWVOL-PROV-DISCHG-DATA.
187000         10  FILLER      PIC X(13) VALUE '010007   0860'.
187100         10  FILLER      PIC X(13) VALUE '010008   0380'.
187200         10  FILLER      PIC X(13) VALUE '010009   0156'.
187300         10  FILLER      PIC X(13) VALUE '010010   0021'.
187400         10  FILLER      PIC X(13) VALUE '010018   0046'.
187500         10  FILLER      PIC X(13) VALUE '010021   0827'.
187600         10  FILLER      PIC X(13) VALUE '010022   0496'.
187700         10  FILLER      PIC X(13) VALUE '010025   1408'.
187800         10  FILLER      PIC X(13) VALUE '010027   0068'.
187900         10  FILLER      PIC X(13) VALUE '010032   0414'.
188000         10  FILLER      PIC X(13) VALUE '010034   0982'.
188100         10  FILLER      PIC X(13) VALUE '010036   1487'.
188200         10  FILLER      PIC X(13) VALUE '010043   0291'.
188300         10  FILLER      PIC X(13) VALUE '010044   0487'.
188400         10  FILLER      PIC X(13) VALUE '010045   0901'.
188500         10  FILLER      PIC X(13) VALUE '010047   0531'.
188600         10  FILLER      PIC X(13) VALUE '010050   0808'.
188700         10  FILLER      PIC X(13) VALUE '010051   0236'.
188800         10  FILLER      PIC X(13) VALUE '010052   0585'.
188900         10  FILLER      PIC X(13) VALUE '010054   1485'.
189000         10  FILLER      PIC X(13) VALUE '010058   0170'.
189100         10  FILLER      PIC X(13) VALUE '010059   0713'.
189200         10  FILLER      PIC X(13) VALUE '010062   0707'.
189300         10  FILLER      PIC X(13) VALUE '010066   0100'.
189400         10  FILLER      PIC X(13) VALUE '010069   0787'.
189500         10  FILLER      PIC X(13) VALUE '010073   0776'.
189600         10  FILLER      PIC X(13) VALUE '010086   1207'.
189700         10  FILLER      PIC X(13) VALUE '010087   1422'.
189800         10  FILLER      PIC X(13) VALUE '010091   0657'.
189900         10  FILLER      PIC X(13) VALUE '010095   0158'.
190000         10  FILLER      PIC X(13) VALUE '010097   0518'.
190100         10  FILLER      PIC X(13) VALUE '010099   1068'.
190200         10  FILLER      PIC X(13) VALUE '010101   1200'.
190300         10  FILLER      PIC X(13) VALUE '010102   0106'.
190400         10  FILLER      PIC X(13) VALUE '010108   1176'.
190500         10  FILLER      PIC X(13) VALUE '010109   0536'.
190600         10  FILLER      PIC X(13) VALUE '010110   0405'.
190700         10  FILLER      PIC X(13) VALUE '010112   1395'.
190800         10  FILLER      PIC X(13) VALUE '010120   0662'.
190900         10  FILLER      PIC X(13) VALUE '010125   1030'.
191000         10  FILLER      PIC X(13) VALUE '010126   0874'.
191100         10  FILLER      PIC X(13) VALUE '010128   0278'.
191200         10  FILLER      PIC X(13) VALUE '010129   0794'.
191300         10  FILLER      PIC X(13) VALUE '010130   1087'.
191400         10  FILLER      PIC X(13) VALUE '010137   0247'.
191500         10  FILLER      PIC X(13) VALUE '010138   0366'.
191600         10  FILLER      PIC X(13) VALUE '010146   0775'.
191700         10  FILLER      PIC X(13) VALUE '010148   1111'.
191800         10  FILLER      PIC X(13) VALUE '010150   0643'.
191900         10  FILLER      PIC X(13) VALUE '010152   0822'.
192000         10  FILLER      PIC X(13) VALUE '010157   0997'.
192100         10  FILLER      PIC X(13) VALUE '010158   1459'.
192200         10  FILLER      PIC X(13) VALUE '010168   1307'.
192300         10  FILLER      PIC X(13) VALUE '010169   0889'.
192400         10  FILLER      PIC X(13) VALUE '010171   0034'.
192500         10  FILLER      PIC X(13) VALUE '020006   1397'.
192600         10  FILLER      PIC X(13) VALUE '020008   0536'.
192700         10  FILLER      PIC X(13) VALUE '020012   1354'.
192800         10  FILLER      PIC X(13) VALUE '020018   0252'.
192900         10  FILLER      PIC X(13) VALUE '020024   0774'.
193000         10  FILLER      PIC X(13) VALUE '020027   0257'.
193100         10  FILLER      PIC X(13) VALUE '030001   1464'.
193200         10  FILLER      PIC X(13) VALUE '030022   1385'.
193300         10  FILLER      PIC X(13) VALUE '030033   1429'.
193400         10  FILLER      PIC X(13) VALUE '030062   1302'.
193500         10  FILLER      PIC X(13) VALUE '030067   0353'.
193600         10  FILLER      PIC X(13) VALUE '030068   0619'.
193700         10  FILLER      PIC X(13) VALUE '030071   0483'.
193800         10  FILLER      PIC X(13) VALUE '030073   0574'.
193900         10  FILLER      PIC X(13) VALUE '030074   0023'.
194000         10  FILLER      PIC X(13) VALUE '030077   0002'.
194100         10  FILLER      PIC X(13) VALUE '030078   0212'.
194200         10  FILLER      PIC X(13) VALUE '030084   0393'.
194300         10  FILLER      PIC X(13) VALUE '030100   1297'.
194400         10  FILLER      PIC X(13) VALUE '030107   0408'.
194500         10  FILLER      PIC X(13) VALUE '030108   0338'.
194600         10  FILLER      PIC X(13) VALUE '030112   0257'.
194700         10  FILLER      PIC X(13) VALUE '030113   0255'.
194800         10  FILLER      PIC X(13) VALUE '030117   1563'.
194900         10  FILLER      PIC X(13) VALUE '030118   1507'.
195000         10  FILLER      PIC X(13) VALUE '030120   0331'.
195100         10  FILLER      PIC X(13) VALUE '030126   1228'.
195200         10  FILLER      PIC X(13) VALUE '030129   0001'.
195300         10  FILLER      PIC X(13) VALUE '030130   0586'.
195400         10  FILLER      PIC X(13) VALUE '030131   0959'.
195500         10  FILLER      PIC X(13) VALUE '030132   0076'.
195600         10  FILLER      PIC X(13) VALUE '040001   1052'.
195700         10  FILLER      PIC X(13) VALUE '040002   0928'.
195800         10  FILLER      PIC X(13) VALUE '040011   1239'.
195900         10  FILLER      PIC X(13) VALUE '040015   0633'.
196000         10  FILLER      PIC X(13) VALUE '040018   1005'.
196100         10  FILLER      PIC X(13) VALUE '040019   0678'.
196200         10  FILLER      PIC X(13) VALUE '040042   1442'.
196300         10  FILLER      PIC X(13) VALUE '040047   0422'.
196400         10  FILLER      PIC X(13) VALUE '040050   1032'.
196500         10  FILLER      PIC X(13) VALUE '040051   1109'.
196600         10  FILLER      PIC X(13) VALUE '040067   0769'.
196700         10  FILLER      PIC X(13) VALUE '040069   0687'.
196800         10  FILLER      PIC X(13) VALUE '040072   0965'.
196900         10  FILLER      PIC X(13) VALUE '040074   0704'.
197000         10  FILLER      PIC X(13) VALUE '040076   1129'.
197100         10  FILLER      PIC X(13) VALUE '040080   0958'.
197200         10  FILLER      PIC X(13) VALUE '040085   0832'.
197300         10  FILLER      PIC X(13) VALUE '040091   0758'.
197400         10  FILLER      PIC X(13) VALUE '040137   1069'.
197500         10  FILLER      PIC X(13) VALUE '040152   0403'.
197600         10  FILLER      PIC X(13) VALUE '050008   1272'.
197700         10  FILLER      PIC X(13) VALUE '050014   1248'.
197800         10  FILLER      PIC X(13) VALUE '050016   1523'.
197900         10  FILLER      PIC X(13) VALUE '050018   1464'.
198000         10  FILLER      PIC X(13) VALUE '050028   0643'.
198100         10  FILLER      PIC X(13) VALUE '050040   0865'.
198200         10  FILLER      PIC X(13) VALUE '050042   1276'.
198300         10  FILLER      PIC X(13) VALUE '050046   0457'.
198400         10  FILLER      PIC X(13) VALUE '050054   1572'.
198500         10  FILLER      PIC X(13) VALUE '050055   1256'.
198600         10  FILLER      PIC X(13) VALUE '050067   0527'.
198700         10  FILLER      PIC X(13) VALUE '050089   1311'.
198800         10  FILLER      PIC X(13) VALUE '050090   0737'.
198900         10  FILLER      PIC X(13) VALUE '050091   0827'.
199000         10  FILLER      PIC X(13) VALUE '050096   0072'.
199100         10  FILLER      PIC X(13) VALUE '050110   1081'.
199200         10  FILLER      PIC X(13) VALUE '050111   1590'.
199300         10  FILLER      PIC X(13) VALUE '050113   0501'.
199400         10  FILLER      PIC X(13) VALUE '050127   1265'.
199500         10  FILLER      PIC X(13) VALUE '050131   1025'.
199600         10  FILLER      PIC X(13) VALUE '050136   1327'.
199700         10  FILLER      PIC X(13) VALUE '050158   0942'.
199800         10  FILLER      PIC X(13) VALUE '050159   1378'.
199900         10  FILLER      PIC X(13) VALUE '050167   0978'.
200000         10  FILLER      PIC X(13) VALUE '050189   0231'.
200100         10  FILLER      PIC X(13) VALUE '050192   0295'.
200200         10  FILLER      PIC X(13) VALUE '050194   1494'.
200300         10  FILLER      PIC X(13) VALUE '050196   0004'.
200400         10  FILLER      PIC X(13) VALUE '050205   0779'.
200500         10  FILLER      PIC X(13) VALUE '050211   1390'.
200600         10  FILLER      PIC X(13) VALUE '050234   1451'.
200700         10  FILLER      PIC X(13) VALUE '050248   1026'.
200800         10  FILLER      PIC X(13) VALUE '050257   0912'.
200900         10  FILLER      PIC X(13) VALUE '050276   0990'.
201000         10  FILLER      PIC X(13) VALUE '050279   1382'.
201100         10  FILLER      PIC X(13) VALUE '050296   0839'.
201200         10  FILLER      PIC X(13) VALUE '050298   0903'.
201300         10  FILLER      PIC X(13) VALUE '050313   1487'.
201400         10  FILLER      PIC X(13) VALUE '050315   0719'.
201500         10  FILLER      PIC X(13) VALUE '050320   1218'.
201600         10  FILLER      PIC X(13) VALUE '050349   0121'.
201700         10  FILLER      PIC X(13) VALUE '050352   0803'.
201800         10  FILLER      PIC X(13) VALUE '050357   0639'.
201900         10  FILLER      PIC X(13) VALUE '050359   1498'.
202000         10  FILLER      PIC X(13) VALUE '050376   1440'.
202100         10  FILLER      PIC X(13) VALUE '050378   1245'.
202200         10  FILLER      PIC X(13) VALUE '050385   0633'.
202300         10  FILLER      PIC X(13) VALUE '050397   0124'.
202400         10  FILLER      PIC X(13) VALUE '050407   0705'.
202500         10  FILLER      PIC X(13) VALUE '050417   1006'.
202600         10  FILLER      PIC X(13) VALUE '050423   0380'.
202700         10  FILLER      PIC X(13) VALUE '050434   0332'.
202800         10  FILLER      PIC X(13) VALUE '050435   1018'.
202900         10  FILLER      PIC X(13) VALUE '050448   0746'.
203000         10  FILLER      PIC X(13) VALUE '050517   1227'.
203100         10  FILLER      PIC X(13) VALUE '050528   0337'.
203200         10  FILLER      PIC X(13) VALUE '050531   0947'.
203300         10  FILLER      PIC X(13) VALUE '050537   1047'.
203400         10  FILLER      PIC X(13) VALUE '050543   0286'.
203500         10  FILLER      PIC X(13) VALUE '050545   0040'.
203600         10  FILLER      PIC X(13) VALUE '050546   0069'.
203700         10  FILLER      PIC X(13) VALUE '050547   0092'.
203800         10  FILLER      PIC X(13) VALUE '050548   0053'.
203900         10  FILLER      PIC X(13) VALUE '050552   0150'.
204000         10  FILLER      PIC X(13) VALUE '050568   1433'.
204100         10  FILLER      PIC X(13) VALUE '050575   1469'.
204200         10  FILLER      PIC X(13) VALUE '050608   0885'.
204300         10  FILLER      PIC X(13) VALUE '050618   0080'.
204400         10  FILLER      PIC X(13) VALUE '050641   0782'.
204500         10  FILLER      PIC X(13) VALUE '050644   1416'.
204600         10  FILLER      PIC X(13) VALUE '050668   0077'.
204700         10  FILLER      PIC X(13) VALUE '050688   1294'.
204800         10  FILLER      PIC X(13) VALUE '050697   0069'.
204900         10  FILLER      PIC X(13) VALUE '050708   0781'.
205000         10  FILLER      PIC X(13) VALUE '050714   0180'.
205100         10  FILLER      PIC X(13) VALUE '050717   0254'.
205200         10  FILLER      PIC X(13) VALUE '050726   0322'.
205300         10  FILLER      PIC X(13) VALUE '050727   1348'.
205400         10  FILLER      PIC X(13) VALUE '050732   1395'.
205500         10  FILLER      PIC X(13) VALUE '050736   0918'.
205600         10  FILLER      PIC X(13) VALUE '050738   0808'.
205700         10  FILLER      PIC X(13) VALUE '050744   0587'.
205800         10  FILLER      PIC X(13) VALUE '050745   0681'.
205900         10  FILLER      PIC X(13) VALUE '050747   0726'.
206000         10  FILLER      PIC X(13) VALUE '050749   0360'.
206100         10  FILLER      PIC X(13) VALUE '050751   0029'.
206200         10  FILLER      PIC X(13) VALUE '050754   0054'.
206300         10  FILLER      PIC X(13) VALUE '050758   1082'.
206400         10  FILLER      PIC X(13) VALUE '050765   0425'.
206500         10  FILLER      PIC X(13) VALUE '050766   0253'.
206600         10  FILLER      PIC X(13) VALUE '050768   0749'.
206700         10  FILLER      PIC X(13) VALUE '050771   1222'.
206800         10  FILLER      PIC X(13) VALUE '050773   0005'.
206900         10  FILLER      PIC X(13) VALUE '060004   0931'.
207000         10  FILLER      PIC X(13) VALUE '060006   1343'.
207100         10  FILLER      PIC X(13) VALUE '060008   0696'.
207200         10  FILLER      PIC X(13) VALUE '060016   0996'.
207300         10  FILLER      PIC X(13) VALUE '060036   0905'.
207400         10  FILLER      PIC X(13) VALUE '060043   0052'.
207500         10  FILLER      PIC X(13) VALUE '060044   0507'.
207600         10  FILLER      PIC X(13) VALUE '060049   0477'.
207700         10  FILLER      PIC X(13) VALUE '060054   0879'.
207800         10  FILLER      PIC X(13) VALUE '060071   1366'.
207900         10  FILLER      PIC X(13) VALUE '060075   0859'.
208000         10  FILLER      PIC X(13) VALUE '060076   0657'.
208100         10  FILLER      PIC X(13) VALUE '060096   0336'.
208200         10  FILLER      PIC X(13) VALUE '060103   0778'.
208300         10  FILLER      PIC X(13) VALUE '060107   0005'.
208400         10  FILLER      PIC X(13) VALUE '060117   0263'.
208500         10  FILLER      PIC X(13) VALUE '060118   0208'.
208600         10  FILLER      PIC X(13) VALUE '060124   0978'.
208700         10  FILLER      PIC X(13) VALUE '070004   1292'.
208800         10  FILLER      PIC X(13) VALUE '070008   1466'.
208900         10  FILLER      PIC X(13) VALUE '070012   1344'.
209000         10  FILLER      PIC X(13) VALUE '070015   1043'.
209100         10  FILLER      PIC X(13) VALUE '070019   1482'.
209200         10  FILLER      PIC X(13) VALUE '070038   0001'.
209300         10  FILLER      PIC X(13) VALUE '070039   0467'.
209400         10  FILLER      PIC X(13) VALUE '070040   0158'.
209500         10  FILLER      PIC X(13) VALUE '090008   1379'.
209600         10  FILLER      PIC X(13) VALUE '100048   0394'.
209700         10  FILLER      PIC X(13) VALUE '100054   1138'.
209800         10  FILLER      PIC X(13) VALUE '100081   0557'.
209900         10  FILLER      PIC X(13) VALUE '100106   0407'.
210000         10  FILLER      PIC X(13) VALUE '100130   0540'.
210100         10  FILLER      PIC X(13) VALUE '100134   0010'.
210200         10  FILLER      PIC X(13) VALUE '100139   0154'.
210300         10  FILLER      PIC X(13) VALUE '100140   1191'.
210400         10  FILLER      PIC X(13) VALUE '100142   1571'.
210500         10  FILLER      PIC X(13) VALUE '100175   1097'.
210600         10  FILLER      PIC X(13) VALUE '100240   0034'.
210700         10  FILLER      PIC X(13) VALUE '100277   0166'.
210800         10  FILLER      PIC X(13) VALUE '100313   0296'.
210900         10  FILLER      PIC X(13) VALUE '100317   0037'.
211000         10  FILLER      PIC X(13) VALUE '110004   0945'.
211100         10  FILLER      PIC X(13) VALUE '110015   0800'.
211200         10  FILLER      PIC X(13) VALUE '110026   0592'.
211300         10  FILLER      PIC X(13) VALUE '110027   0474'.
211400         10  FILLER      PIC X(13) VALUE '110032   1455'.
211500         10  FILLER      PIC X(13) VALUE '110040   0727'.
211600         10  FILLER      PIC X(13) VALUE '110041   1042'.
211700         10  FILLER      PIC X(13) VALUE '110042   1003'.
211800         10  FILLER      PIC X(13) VALUE '110044   1227'.
211900         10  FILLER      PIC X(13) VALUE '110045   0872'.
212000         10  FILLER      PIC X(13) VALUE '110050   0304'.
212100         10  FILLER      PIC X(13) VALUE '110051   0824'.
212200         10  FILLER      PIC X(13) VALUE '110059   0271'.
212300         10  FILLER      PIC X(13) VALUE '110071   0625'.
212400         10  FILLER      PIC X(13) VALUE '110073   0858'.
212500         10  FILLER      PIC X(13) VALUE '110086   0575'.
212600         10  FILLER      PIC X(13) VALUE '110092   0822'.
212700         10  FILLER      PIC X(13) VALUE '110100   0358'.
212800         10  FILLER      PIC X(13) VALUE '110101   0337'.
212900         10  FILLER      PIC X(13) VALUE '110104   1462'.
213000         10  FILLER      PIC X(13) VALUE '110109   0759'.
213100         10  FILLER      PIC X(13) VALUE '110111   0237'.
213200         10  FILLER      PIC X(13) VALUE '110112   0217'.
213300         10  FILLER      PIC X(13) VALUE '110113   0254'.
213400         10  FILLER      PIC X(13) VALUE '110121   0491'.
213500         10  FILLER      PIC X(13) VALUE '110124   1385'.
213600         10  FILLER      PIC X(13) VALUE '110130   0210'.
213700         10  FILLER      PIC X(13) VALUE '110132   0729'.
213800         10  FILLER      PIC X(13) VALUE '110135   0615'.
213900         10  FILLER      PIC X(13) VALUE '110142   0535'.
214000         10  FILLER      PIC X(13) VALUE '110146   0565'.
214100         10  FILLER      PIC X(13) VALUE '110153   0879'.
214200         10  FILLER      PIC X(13) VALUE '110163   1452'.
214300         10  FILLER      PIC X(13) VALUE '110183   0777'.
214400         10  FILLER      PIC X(13) VALUE '110186   1444'.
214500         10  FILLER      PIC X(13) VALUE '110187   0670'.
214600         10  FILLER      PIC X(13) VALUE '110189   0938'.
214700         10  FILLER      PIC X(13) VALUE '110190   0201'.
214800         10  FILLER      PIC X(13) VALUE '110194   0704'.
214900         10  FILLER      PIC X(13) VALUE '110200   0825'.
215000         10  FILLER      PIC X(13) VALUE '110201   1263'.
215100         10  FILLER      PIC X(13) VALUE '110203   0310'.
215200         10  FILLER      PIC X(13) VALUE '110205   0460'.
215300         10  FILLER      PIC X(13) VALUE '110225   1539'.
215400         10  FILLER      PIC X(13) VALUE '120004   1511'.
215500         10  FILLER      PIC X(13) VALUE '120010   0212'.
215600         10  FILLER      PIC X(13) VALUE '120014   1256'.
215700         10  FILLER      PIC X(13) VALUE '120019   0844'.
215800         10  FILLER      PIC X(13) VALUE '120027   0412'.
215900         10  FILLER      PIC X(13) VALUE '120028   0583'.
216000         10  FILLER      PIC X(13) VALUE '130025   0541'.
216100         10  FILLER      PIC X(13) VALUE '130063   0084'.
216200         10  FILLER      PIC X(13) VALUE '130065   0404'.
216300         10  FILLER      PIC X(13) VALUE '130066   0203'.
216400         10  FILLER      PIC X(13) VALUE '130067   0007'.
216500         10  FILLER      PIC X(13) VALUE '140001   1357'.
216600         10  FILLER      PIC X(13) VALUE '140019   0456'.
216700         10  FILLER      PIC X(13) VALUE '140026   1277'.
216800         10  FILLER      PIC X(13) VALUE '140059   0816'.
216900         10  FILLER      PIC X(13) VALUE '140068   1248'.
217000         10  FILLER      PIC X(13) VALUE '140077   0526'.
217100         10  FILLER      PIC X(13) VALUE '140089   1075'.
217200         10  FILLER      PIC X(13) VALUE '140095   1291'.
217300         10  FILLER      PIC X(13) VALUE '140100   0307'.
217400         10  FILLER      PIC X(13) VALUE '140110   1484'.
217500         10  FILLER      PIC X(13) VALUE '140137   0379'.
217600         10  FILLER      PIC X(13) VALUE '140143   1360'.
217700         10  FILLER      PIC X(13) VALUE '140145   0652'.
217800         10  FILLER      PIC X(13) VALUE '140147   0988'.
217900         10  FILLER      PIC X(13) VALUE '140151   1503'.
218000         10  FILLER      PIC X(13) VALUE '140161   0760'.
218100         10  FILLER      PIC X(13) VALUE '140167   0603'.
218200         10  FILLER      PIC X(13) VALUE '140210   0747'.
218300         10  FILLER      PIC X(13) VALUE '140294   0883'.
218400         10  FILLER      PIC X(13) VALUE '140300   0238'.
218500         10  FILLER      PIC X(13) VALUE '150001   1110'.
218600         10  FILLER      PIC X(13) VALUE '150022   0764'.
218700         10  FILLER      PIC X(13) VALUE '150030   1404'.
218800         10  FILLER      PIC X(13) VALUE '150033   1382'.
218900         10  FILLER      PIC X(13) VALUE '150037   1447'.
219000         10  FILLER      PIC X(13) VALUE '150038   0685'.
219100         10  FILLER      PIC X(13) VALUE '150045   0818'.
219200         10  FILLER      PIC X(13) VALUE '150061   1002'.
219300         10  FILLER      PIC X(13) VALUE '150064   0915'.
219400         10  FILLER      PIC X(13) VALUE '150072   0861'.
219500         10  FILLER      PIC X(13) VALUE '150075   1195'.
219600         10  FILLER      PIC X(13) VALUE '150076   1131'.
219700         10  FILLER      PIC X(13) VALUE '150091   0939'.
219800         10  FILLER      PIC X(13) VALUE '150097   1505'.
219900         10  FILLER      PIC X(13) VALUE '150101   0821'.
220000         10  FILLER      PIC X(13) VALUE '150102   0453'.
220100         10  FILLER      PIC X(13) VALUE '150104   1140'.
220200         10  FILLER      PIC X(13) VALUE '150129   0704'.
220300         10  FILLER      PIC X(13) VALUE '150146   1006'.
220400         10  FILLER      PIC X(13) VALUE '150149   0043'.
220500         10  FILLER      PIC X(13) VALUE '150150   1152'.
220600         10  FILLER      PIC X(13) VALUE '150160   0966'.
220700         10  FILLER      PIC X(13) VALUE '150163   0344'.
220800         10  FILLER      PIC X(13) VALUE '150164   0684'.
220900         10  FILLER      PIC X(13) VALUE '150165   0393'.
221000         10  FILLER      PIC X(13) VALUE '150166   0370'.
221100         10  FILLER      PIC X(13) VALUE '150167   0971'.
221200         10  FILLER      PIC X(13) VALUE '150168   1148'.
221300         10  FILLER      PIC X(13) VALUE '150172   0117'.
221400         10  FILLER      PIC X(13) VALUE '150175   1094'.
221500         10  FILLER      PIC X(13) VALUE '150176   0766'.
221600         10  FILLER      PIC X(13) VALUE '150177   0649'.
221700         10  FILLER      PIC X(13) VALUE '150179   0228'.
221800         10  FILLER      PIC X(13) VALUE '160001   1284'.
221900         10  FILLER      PIC X(13) VALUE '160005   0842'.
222000         10  FILLER      PIC X(13) VALUE '160008   0896'.
222100         10  FILLER      PIC X(13) VALUE '160013   0758'.
222200         10  FILLER      PIC X(13) VALUE '160032   0879'.
222300         10  FILLER      PIC X(13) VALUE '160040   0573'.
222400         10  FILLER      PIC X(13) VALUE '160101   0428'.
222500         10  FILLER      PIC X(13) VALUE '160112   1210'.
222600         10  FILLER      PIC X(13) VALUE '160122   0817'.
222700         10  FILLER      PIC X(13) VALUE '160124   0473'.
222800         10  FILLER      PIC X(13) VALUE '160147   0658'.
222900         10  FILLER      PIC X(13) VALUE '170001   1137'.
223000         10  FILLER      PIC X(13) VALUE '170009   0730'.
223100         10  FILLER      PIC X(13) VALUE '170010   0439'.
223200         10  FILLER      PIC X(13) VALUE '170014   0629'.
223300         10  FILLER      PIC X(13) VALUE '170017   0784'.
223400         10  FILLER      PIC X(13) VALUE '170023   1076'.
223500         10  FILLER      PIC X(13) VALUE '170027   0661'.
223600         10  FILLER      PIC X(13) VALUE '170039   0208'.
223700         10  FILLER      PIC X(13) VALUE '170058   0844'.
223800         10  FILLER      PIC X(13) VALUE '170068   0479'.
223900         10  FILLER      PIC X(13) VALUE '170074   0620'.
224000         10  FILLER      PIC X(13) VALUE '170075   0153'.
224100         10  FILLER      PIC X(13) VALUE '170094   0520'.
224200         10  FILLER      PIC X(13) VALUE '170103   1301'.
224300         10  FILLER      PIC X(13) VALUE '170105   0535'.
224400         10  FILLER      PIC X(13) VALUE '170109   0266'.
224500         10  FILLER      PIC X(13) VALUE '170110   0106'.
224600         10  FILLER      PIC X(13) VALUE '170120   1276'.
224700         10  FILLER      PIC X(13) VALUE '170133   0656'.
224800         10  FILLER      PIC X(13) VALUE '170145   1318'.
224900         10  FILLER      PIC X(13) VALUE '170150   0507'.
225000         10  FILLER      PIC X(13) VALUE '170166   0292'.
225100         10  FILLER      PIC X(13) VALUE '170175   0791'.
225200         10  FILLER      PIC X(13) VALUE '170183   0604'.
225300         10  FILLER      PIC X(13) VALUE '170186   1278'.
225400         10  FILLER      PIC X(13) VALUE '170187   0296'.
225500         10  FILLER      PIC X(13) VALUE '170188   0308'.
225600         10  FILLER      PIC X(13) VALUE '170190   0114'.
225700         10  FILLER      PIC X(13) VALUE '170191   0821'.
225800         10  FILLER      PIC X(13) VALUE '170192   0736'.
225900         10  FILLER      PIC X(13) VALUE '170194   0124'.
226000         10  FILLER      PIC X(13) VALUE '170195   0135'.
226100         10  FILLER      PIC X(13) VALUE '170196   0747'.
226200         10  FILLER      PIC X(13) VALUE '170198   0119'.
226300         10  FILLER      PIC X(13) VALUE '170199   0054'.
226400         10  FILLER      PIC X(13) VALUE '170200   1027'.
226500         10  FILLER      PIC X(13) VALUE '170202   0415'.
226600         10  FILLER      PIC X(13) VALUE '180004   1044'.
226700         10  FILLER      PIC X(13) VALUE '180016   1199'.
226800         10  FILLER      PIC X(13) VALUE '180019   1320'.
226900         10  FILLER      PIC X(13) VALUE '180020   1298'.
227000         10  FILLER      PIC X(13) VALUE '180021   1454'.
227100         10  FILLER      PIC X(13) VALUE '180024   0811'.
227200         10  FILLER      PIC X(13) VALUE '180025   1270'.
227300         10  FILLER      PIC X(13) VALUE '180043   1363'.
227400         10  FILLER      PIC X(13) VALUE '180046   0471'.
227500         10  FILLER      PIC X(13) VALUE '180049   1351'.
227600         10  FILLER      PIC X(13) VALUE '180053   0663'.
227700         10  FILLER      PIC X(13) VALUE '180064   1001'.
227800         10  FILLER      PIC X(13) VALUE '180066   0895'.
227900         10  FILLER      PIC X(13) VALUE '180069   1382'.
228000         10  FILLER      PIC X(13) VALUE '180070   1352'.
228100         10  FILLER      PIC X(13) VALUE '180078   1268'.
228200         10  FILLER      PIC X(13) VALUE '180079   0918'.
228300         10  FILLER      PIC X(13) VALUE '180087   1594'.
228400         10  FILLER      PIC X(13) VALUE '180092   1250'.
228500         10  FILLER      PIC X(13) VALUE '180095   0818'.
228600         10  FILLER      PIC X(13) VALUE '180101   0926'.
228700         10  FILLER      PIC X(13) VALUE '180105   1225'.
228800         10  FILLER      PIC X(13) VALUE '180106   0798'.
228900         10  FILLER      PIC X(13) VALUE '180115   0551'.
229000         10  FILLER      PIC X(13) VALUE '180117   0475'.
229100         10  FILLER      PIC X(13) VALUE '180128   1301'.
229200         10  FILLER      PIC X(13) VALUE '180138   1257'.
229300         10  FILLER      PIC X(13) VALUE '180139   1431'.
229400         10  FILLER      PIC X(13) VALUE '180149   0566'.
229500         10  FILLER      PIC X(13) VALUE '190001   0862'.
229600         10  FILLER      PIC X(13) VALUE '190003   1049'.
229700         10  FILLER      PIC X(13) VALUE '190005   1079'.
229800         10  FILLER      PIC X(13) VALUE '190006   0470'.
229900         10  FILLER      PIC X(13) VALUE '190007   0997'.
230000         10  FILLER      PIC X(13) VALUE '190009   0205'.
230100         10  FILLER      PIC X(13) VALUE '190011   0583'.
230200         10  FILLER      PIC X(13) VALUE '190014   1374'.
230300         10  FILLER      PIC X(13) VALUE '190025   0798'.
230400         10  FILLER      PIC X(13) VALUE '190034   0727'.
230500         10  FILLER      PIC X(13) VALUE '190044   1276'.
230600         10  FILLER      PIC X(13) VALUE '190050   0849'.
230700         10  FILLER      PIC X(13) VALUE '190079   0596'.
230800         10  FILLER      PIC X(13) VALUE '190081   0747'.
230900         10  FILLER      PIC X(13) VALUE '190088   0593'.
231000         10  FILLER      PIC X(13) VALUE '190090   0648'.
231100         10  FILLER      PIC X(13) VALUE '190099   1006'.
231200         10  FILLER      PIC X(13) VALUE '190106   0507'.
231300         10  FILLER      PIC X(13) VALUE '190114   0940'.
231400         10  FILLER      PIC X(13) VALUE '190116   0837'.
231500         10  FILLER      PIC X(13) VALUE '190118   0510'.
231600         10  FILLER      PIC X(13) VALUE '190122   0288'.
231700         10  FILLER      PIC X(13) VALUE '190128   0219'.
231800         10  FILLER      PIC X(13) VALUE '190133   0077'.
231900         10  FILLER      PIC X(13) VALUE '190140   0721'.
232000         10  FILLER      PIC X(13) VALUE '190145   0549'.
232100         10  FILLER      PIC X(13) VALUE '190151   0349'.
232200         10  FILLER      PIC X(13) VALUE '190161   0131'.
232300         10  FILLER      PIC X(13) VALUE '190175   0966'.
232400         10  FILLER      PIC X(13) VALUE '190183   0654'.
232500         10  FILLER      PIC X(13) VALUE '190184   0281'.
232600         10  FILLER      PIC X(13) VALUE '190190   0300'.
232700         10  FILLER      PIC X(13) VALUE '190199   0013'.
232800         10  FILLER      PIC X(13) VALUE '190201   0440'.
232900         10  FILLER      PIC X(13) VALUE '190208   0313'.
233000         10  FILLER      PIC X(13) VALUE '190218   0490'.
233100         10  FILLER      PIC X(13) VALUE '190241   0095'.
233200         10  FILLER      PIC X(13) VALUE '190242   1347'.
233300         10  FILLER      PIC X(13) VALUE '190245   0082'.
233400         10  FILLER      PIC X(13) VALUE '190246   0319'.
233500         10  FILLER      PIC X(13) VALUE '190250   1398'.
233600         10  FILLER      PIC X(13) VALUE '190251   0051'.
233700         10  FILLER      PIC X(13) VALUE '190255   0007'.
233800         10  FILLER      PIC X(13) VALUE '190256   0025'.
233900         10  FILLER      PIC X(13) VALUE '190257   0172'.
234000         10  FILLER      PIC X(13) VALUE '190259   0197'.
234100         10  FILLER      PIC X(13) VALUE '190261   0020'.
234200         10  FILLER      PIC X(13) VALUE '190263   0981'.
234300         10  FILLER      PIC X(13) VALUE '190266   0140'.
234400         10  FILLER      PIC X(13) VALUE '190267   0066'.
234500         10  FILLER      PIC X(13) VALUE '190268   0020'.
234600         10  FILLER      PIC X(13) VALUE '190270   0317'.
234700         10  FILLER      PIC X(13) VALUE '190273   0047'.
234800         10  FILLER      PIC X(13) VALUE '190278   0405'.
234900         10  FILLER      PIC X(13) VALUE '190297   0247'.
235000         10  FILLER      PIC X(13) VALUE '190298   0482'.
235100         10  FILLER      PIC X(13) VALUE '190300   0003'.
235200         10  FILLER      PIC X(13) VALUE '190303   0221'.
235300         10  FILLER      PIC X(13) VALUE '190304   0002'.
235400         10  FILLER      PIC X(13) VALUE '190307   0018'.
235500         10  FILLER      PIC X(13) VALUE '200002   1039'.
235600         10  FILLER      PIC X(13) VALUE '200018   1192'.
235700         10  FILLER      PIC X(13) VALUE '200025   0601'.
235800         10  FILLER      PIC X(13) VALUE '200031   1127'.
235900         10  FILLER      PIC X(13) VALUE '200037   1340'.
236000         10  FILLER      PIC X(13) VALUE '200040   1208'.
236100         10  FILLER      PIC X(13) VALUE '200041   0678'.
236200         10  FILLER      PIC X(13) VALUE '200050   1402'.
236300         10  FILLER      PIC X(13) VALUE '200052   0661'.
236400         10  FILLER      PIC X(13) VALUE '210017   1008'.
236500         10  FILLER      PIC X(13) VALUE '210045   0265'.
236600         10  FILLER      PIC X(13) VALUE '210060   1059'.
236700         10  FILLER      PIC X(13) VALUE '220030   1524'.
236800         10  FILLER      PIC X(13) VALUE '220050   0745'.
236900         10  FILLER      PIC X(13) VALUE '220051   1283'.
237000         10  FILLER      PIC X(13) VALUE '220058   0469'.
237100         10  FILLER      PIC X(13) VALUE '220065   1473'.
237200         10  FILLER      PIC X(13) VALUE '220075   0474'.
237300         10  FILLER      PIC X(13) VALUE '220083   1466'.
237400         10  FILLER      PIC X(13) VALUE '220098   0957'.
237500         10  FILLER      PIC X(13) VALUE '220177   0126'.
237600         10  FILLER      PIC X(13) VALUE '230003   0976'.
237700         10  FILLER      PIC X(13) VALUE '230013   0817'.
237800         10  FILLER      PIC X(13) VALUE '230015   0620'.
237900         10  FILLER      PIC X(13) VALUE '230035   1435'.
238000         10  FILLER      PIC X(13) VALUE '230037   1567'.
238100         10  FILLER      PIC X(13) VALUE '230040   1389'.
238200         10  FILLER      PIC X(13) VALUE '230071   0557'.
238300         10  FILLER      PIC X(13) VALUE '230078   0400'.
238400         10  FILLER      PIC X(13) VALUE '230085   0377'.
238500         10  FILLER      PIC X(13) VALUE '230093   1004'.
238600         10  FILLER      PIC X(13) VALUE '230095   1422'.
238700         10  FILLER      PIC X(13) VALUE '230096   0702'.
238800         10  FILLER      PIC X(13) VALUE '230100   0995'.
238900         10  FILLER      PIC X(13) VALUE '230101   0591'.
239000         10  FILLER      PIC X(13) VALUE '230106   1120'.
239100         10  FILLER      PIC X(13) VALUE '230108   0620'.
239200         10  FILLER      PIC X(13) VALUE '230110   1009'.
239300         10  FILLER      PIC X(13) VALUE '230118   0775'.
239400         10  FILLER      PIC X(13) VALUE '230121   1491'.
239500         10  FILLER      PIC X(13) VALUE '230133   0832'.
239600         10  FILLER      PIC X(13) VALUE '230144   0186'.
239700         10  FILLER      PIC X(13) VALUE '230174   0840'.
239800         10  FILLER      PIC X(13) VALUE '230180   0993'.
239900         10  FILLER      PIC X(13) VALUE '230208   0697'.
240000         10  FILLER      PIC X(13) VALUE '230217   1555'.
240100         10  FILLER      PIC X(13) VALUE '230239   1564'.
240200         10  FILLER      PIC X(13) VALUE '230241   0987'.
240300         10  FILLER      PIC X(13) VALUE '230259   1534'.
240400         10  FILLER      PIC X(13) VALUE '230264   0016'.
240500         10  FILLER      PIC X(13) VALUE '230275   0094'.
240600         10  FILLER      PIC X(13) VALUE '230279   0061'.
240700         10  FILLER      PIC X(13) VALUE '230297   1494'.
240800         10  FILLER      PIC X(13) VALUE '230301   0233'.
240900         10  FILLER      PIC X(13) VALUE '240006   0429'.
241000         10  FILLER      PIC X(13) VALUE '240014   0610'.
241100         10  FILLER      PIC X(13) VALUE '240018   0805'.
241200         10  FILLER      PIC X(13) VALUE '240019   1186'.
241300         10  FILLER      PIC X(13) VALUE '240020   1381'.
241400         10  FILLER      PIC X(13) VALUE '240022   0539'.
241500         10  FILLER      PIC X(13) VALUE '240040   1477'.
241600         10  FILLER      PIC X(13) VALUE '240043   1230'.
241700         10  FILLER      PIC X(13) VALUE '240044   1336'.
241800         10  FILLER      PIC X(13) VALUE '240052   1339'.
241900         10  FILLER      PIC X(13) VALUE '240059   0638'.
242000         10  FILLER      PIC X(13) VALUE '240064   1158'.
242100         10  FILLER      PIC X(13) VALUE '240066   1326'.
242200         10  FILLER      PIC X(13) VALUE '240069   0950'.
242300         10  FILLER      PIC X(13) VALUE '240071   0751'.
242400         10  FILLER      PIC X(13) VALUE '240076   1032'.
242500         10  FILLER      PIC X(13) VALUE '240084   0922'.
242600         10  FILLER      PIC X(13) VALUE '240088   1447'.
242700         10  FILLER      PIC X(13) VALUE '240101   0999'.
242800         10  FILLER      PIC X(13) VALUE '240117   1419'.
242900         10  FILLER      PIC X(13) VALUE '240141   0736'.
243000         10  FILLER      PIC X(13) VALUE '240166   0950'.
243100         10  FILLER      PIC X(13) VALUE '240187   0907'.
243200         10  FILLER      PIC X(13) VALUE '240196   0081'.
243300         10  FILLER      PIC X(13) VALUE '240206   0110'.
243400         10  FILLER      PIC X(13) VALUE '240214   1386'.
243500         10  FILLER      PIC X(13) VALUE '250002   0487'.
243600         10  FILLER      PIC X(13) VALUE '250006   1376'.
243700         10  FILLER      PIC X(13) VALUE '250010   0503'.
243800         10  FILLER      PIC X(13) VALUE '250012   0274'.
243900         10  FILLER      PIC X(13) VALUE '250015   1269'.
244000         10  FILLER      PIC X(13) VALUE '250017   0433'.
244100         10  FILLER      PIC X(13) VALUE '250018   0008'.
244200         10  FILLER      PIC X(13) VALUE '250020   0832'.
244300         10  FILLER      PIC X(13) VALUE '250025   1421'.
244400         10  FILLER      PIC X(13) VALUE '250027   0271'.
244500         10  FILLER      PIC X(13) VALUE '250036   0686'.
244600         10  FILLER      PIC X(13) VALUE '250038   0822'.
244700         10  FILLER      PIC X(13) VALUE '250043   0532'.
244800         10  FILLER      PIC X(13) VALUE '250044   0703'.
244900         10  FILLER      PIC X(13) VALUE '250049   0615'.
245000         10  FILLER      PIC X(13) VALUE '250050   1053'.
245100         10  FILLER      PIC X(13) VALUE '250051   0095'.
245200         10  FILLER      PIC X(13) VALUE '250057   1323'.
245300         10  FILLER      PIC X(13) VALUE '250059   0794'.
245400         10  FILLER      PIC X(13) VALUE '250060   0103'.
245500         10  FILLER      PIC X(13) VALUE '250061   0291'.
245600         10  FILLER      PIC X(13) VALUE '250067   0760'.
245700         10  FILLER      PIC X(13) VALUE '250077   0860'.
245800         10  FILLER      PIC X(13) VALUE '250079   0206'.
245900         10  FILLER      PIC X(13) VALUE '250081   0066'.
246000         10  FILLER      PIC X(13) VALUE '250084   1309'.
246100         10  FILLER      PIC X(13) VALUE '250085   0552'.
246200         10  FILLER      PIC X(13) VALUE '250093   1529'.
246300         10  FILLER      PIC X(13) VALUE '250095   0369'.
246400         10  FILLER      PIC X(13) VALUE '250117   0931'.
246500         10  FILLER      PIC X(13) VALUE '250123   1559'.
246600         10  FILLER      PIC X(13) VALUE '250124   0661'.
246700         10  FILLER      PIC X(13) VALUE '250126   0519'.
246800         10  FILLER      PIC X(13) VALUE '250127   0013'.
246900         10  FILLER      PIC X(13) VALUE '250128   1276'.
247000         10  FILLER      PIC X(13) VALUE '250134   0103'.
247100         10  FILLER      PIC X(13) VALUE '250136   0061'.
247200         10  FILLER      PIC X(13) VALUE '250151   0171'.
247300         10  FILLER      PIC X(13) VALUE '250152   0001'.
247400         10  FILLER      PIC X(13) VALUE '250162   0870'.
247500         10  FILLER      PIC X(13) VALUE '250166   0007'.
247600         10  FILLER      PIC X(13) VALUE '260004   0158'.
247700         10  FILLER      PIC X(13) VALUE '260015   1404'.
247800         10  FILLER      PIC X(13) VALUE '260022   1561'.
247900         10  FILLER      PIC X(13) VALUE '260024   0807'.
248000         10  FILLER      PIC X(13) VALUE '260034   0537'.
248100         10  FILLER      PIC X(13) VALUE '260050   0310'.
248200         10  FILLER      PIC X(13) VALUE '260057   1034'.
248300         10  FILLER      PIC X(13) VALUE '260059   1343'.
248400         10  FILLER      PIC X(13) VALUE '260061   0451'.
248500         10  FILLER      PIC X(13) VALUE '260064   1487'.
248600         10  FILLER      PIC X(13) VALUE '260070   1113'.
248700         10  FILLER      PIC X(13) VALUE '260074   1257'.
248800         10  FILLER      PIC X(13) VALUE '260080   0213'.
248900         10  FILLER      PIC X(13) VALUE '260097   1291'.
249000         10  FILLER      PIC X(13) VALUE '260102   0854'.
249100         10  FILLER      PIC X(13) VALUE '260115   0661'.
249200         10  FILLER      PIC X(13) VALUE '260116   1466'.
249300         10  FILLER      PIC X(13) VALUE '260142   1014'.
249400         10  FILLER      PIC X(13) VALUE '260147   0185'.
249500         10  FILLER      PIC X(13) VALUE '260160   0683'.
249600         10  FILLER      PIC X(13) VALUE '260162   1316'.
249700         10  FILLER      PIC X(13) VALUE '260175   1354'.
249800         10  FILLER      PIC X(13) VALUE '260195   1459'.
249900         10  FILLER      PIC X(13) VALUE '260207   0432'.
250000         10  FILLER      PIC X(13) VALUE '260209   0192'.
250100         10  FILLER      PIC X(13) VALUE '260211   0084'.
250200         10  FILLER      PIC X(13) VALUE '260214   1181'.
250300         10  FILLER      PIC X(13) VALUE '260219   1090'.
250400         10  FILLER      PIC X(13) VALUE '260227   0005'.
250500         10  FILLER      PIC X(13) VALUE '270032   0398'.
250600         10  FILLER      PIC X(13) VALUE '270074   0143'.
250700         10  FILLER      PIC X(13) VALUE '270086   0277'.
250800         10  FILLER      PIC X(13) VALUE '270087   0299'.
250900         10  FILLER      PIC X(13) VALUE '280105   0895'.
251000         10  FILLER      PIC X(13) VALUE '280111   1066'.
251100         10  FILLER      PIC X(13) VALUE '280119   0012'.
251200         10  FILLER      PIC X(13) VALUE '280127   0325'.
251300         10  FILLER      PIC X(13) VALUE '280128   1533'.
251400         10  FILLER      PIC X(13) VALUE '280129   0615'.
251500         10  FILLER      PIC X(13) VALUE '280131   0247'.
251600         10  FILLER      PIC X(13) VALUE '280132   1387'.
251700         10  FILLER      PIC X(13) VALUE '280133   0251'.
251800         10  FILLER      PIC X(13) VALUE '290002   0082'.
251900         10  FILLER      PIC X(13) VALUE '290006   1037'.
252000         10  FILLER      PIC X(13) VALUE '290008   0768'.
252100         10  FILLER      PIC X(13) VALUE '290020   0069'.
252200         10  FILLER      PIC X(13) VALUE '290027   0001'.
252300         10  FILLER      PIC X(13) VALUE '290042   0043'.
252400         10  FILLER      PIC X(13) VALUE '290049   1552'.
252500         10  FILLER      PIC X(13) VALUE '290051   0384'.
252600         10  FILLER      PIC X(13) VALUE '310058   0671'.
252700         10  FILLER      PIC X(13) VALUE '310118   0913'.
252800         10  FILLER      PIC X(13) VALUE '310120   0488'.
252900         10  FILLER      PIC X(13) VALUE '320003   0914'.
253000         10  FILLER      PIC X(13) VALUE '320004   1460'.
253100         10  FILLER      PIC X(13) VALUE '320011   0797'.
253200         10  FILLER      PIC X(13) VALUE '320013   0828'.
253300         10  FILLER      PIC X(13) VALUE '320014   0343'.
253400         10  FILLER      PIC X(13) VALUE '320016   0977'.
253500         10  FILLER      PIC X(13) VALUE '320017   1273'.
253600         10  FILLER      PIC X(13) VALUE '320022   1494'.
253700         10  FILLER      PIC X(13) VALUE '320030   0412'.
253800         10  FILLER      PIC X(13) VALUE '320033   0450'.
253900         10  FILLER      PIC X(13) VALUE '320038   1142'.
254000         10  FILLER      PIC X(13) VALUE '320057   0014'.
254100         10  FILLER      PIC X(13) VALUE '320058   0034'.
254200         10  FILLER      PIC X(13) VALUE '320059   0546'.
254300         10  FILLER      PIC X(13) VALUE '320060   0147'.
254400         10  FILLER      PIC X(13) VALUE '320061   0864'.
254500         10  FILLER      PIC X(13) VALUE '320062   0123'.
254600         10  FILLER      PIC X(13) VALUE '320063   1493'.
254700         10  FILLER      PIC X(13) VALUE '320065   0980'.
254800         10  FILLER      PIC X(13) VALUE '320067   0117'.
254900         10  FILLER      PIC X(13) VALUE '320070   0096'.
255000         10  FILLER      PIC X(13) VALUE '320074   1331'.
255100         10  FILLER      PIC X(13) VALUE '320084   0302'.
255200         10  FILLER      PIC X(13) VALUE '320086   0632'.
255300         10  FILLER      PIC X(13) VALUE '330002   0758'.
255400         10  FILLER      PIC X(13) VALUE '330008   0523'.
255500         10  FILLER      PIC X(13) VALUE '330029   0053'.
255600         10  FILLER      PIC X(13) VALUE '330033   1071'.
255700         10  FILLER      PIC X(13) VALUE '330037   1233'.
255800         10  FILLER      PIC X(13) VALUE '330049   1384'.
255900         10  FILLER      PIC X(13) VALUE '330053   0914'.
256000         10  FILLER      PIC X(13) VALUE '330079   1191'.
256100         10  FILLER      PIC X(13) VALUE '330084   1102'.
256200         10  FILLER      PIC X(13) VALUE '330086   1267'.
256300         10  FILLER      PIC X(13) VALUE '330088   0990'.
256400         10  FILLER      PIC X(13) VALUE '330096   0891'.
256500         10  FILLER      PIC X(13) VALUE '330100   0083'.
256600         10  FILLER      PIC X(13) VALUE '330111   0535'.
256700         10  FILLER      PIC X(13) VALUE '330115   1304'.
256800         10  FILLER      PIC X(13) VALUE '330132   0845'.
256900         10  FILLER      PIC X(13) VALUE '330144   0398'.
257000         10  FILLER      PIC X(13) VALUE '330151   0899'.
257100         10  FILLER      PIC X(13) VALUE '330166   0050'.
257200         10  FILLER      PIC X(13) VALUE '330177   0500'.
257300         10  FILLER      PIC X(13) VALUE '330205   1164'.
257400         10  FILLER      PIC X(13) VALUE '330211   1109'.
257500         10  FILLER      PIC X(13) VALUE '330213   0716'.
257600         10  FILLER      PIC X(13) VALUE '330223   1226'.
257700         10  FILLER      PIC X(13) VALUE '330224   1093'.
257800         10  FILLER      PIC X(13) VALUE '330229   1094'.
257900         10  FILLER      PIC X(13) VALUE '330238   1048'.
258000         10  FILLER      PIC X(13) VALUE '330249   1002'.
258100         10  FILLER      PIC X(13) VALUE '330263   0530'.
258200         10  FILLER      PIC X(13) VALUE '330265   1297'.
258300         10  FILLER      PIC X(13) VALUE '330268   0322'.
258400         10  FILLER      PIC X(13) VALUE '330385   1154'.
258500         10  FILLER      PIC X(13) VALUE '330403   0012'.
258600         10  FILLER      PIC X(13) VALUE '330404   0749'.
258700         10  FILLER      PIC X(13) VALUE '330405   0507'.
258800         10  FILLER      PIC X(13) VALUE '330406   0884'.
258900         10  FILLER      PIC X(13) VALUE '330409   0010'.
259000         10  FILLER      PIC X(13) VALUE '340011   1062'.
259100         10  FILLER      PIC X(13) VALUE '340036   0841'.
259200         10  FILLER      PIC X(13) VALUE '340037   1061'.
259300         10  FILLER      PIC X(13) VALUE '340049   0630'.
259400         10  FILLER      PIC X(13) VALUE '340055   1196'.
259500         10  FILLER      PIC X(13) VALUE '340084   0355'.
259600         10  FILLER      PIC X(13) VALUE '340085   1513'.
259700         10  FILLER      PIC X(13) VALUE '340087   0965'.
259800         10  FILLER      PIC X(13) VALUE '340106   1578'.
259900         10  FILLER      PIC X(13) VALUE '340120   0921'.
260000         10  FILLER      PIC X(13) VALUE '340127   1031'.
260100         10  FILLER      PIC X(13) VALUE '340133   1287'.
260200         10  FILLER      PIC X(13) VALUE '340148   0314'.
260300         10  FILLER      PIC X(13) VALUE '340156   0080'.
260400         10  FILLER      PIC X(13) VALUE '340159   1158'.
260500         10  FILLER      PIC X(13) VALUE '340160   1166'.
260600         10  FILLER      PIC X(13) VALUE '340168   0174'.
260700         10  FILLER      PIC X(13) VALUE '340186   1499'.
260800         10  FILLER      PIC X(13) VALUE '350063   0141'.
260900         10  FILLER      PIC X(13) VALUE '360002   1202'.
261000         10  FILLER      PIC X(13) VALUE '360013   0993'.
261100         10  FILLER      PIC X(13) VALUE '360014   1160'.
261200         10  FILLER      PIC X(13) VALUE '360029   1530'.
261300         10  FILLER      PIC X(13) VALUE '360032   0966'.
261400         10  FILLER      PIC X(13) VALUE '360044   1105'.
261500         10  FILLER      PIC X(13) VALUE '360046   1163'.
261600         10  FILLER      PIC X(13) VALUE '360058   0776'.
261700         10  FILLER      PIC X(13) VALUE '360071   0496'.
261800         10  FILLER      PIC X(13) VALUE '360089   1058'.
261900         10  FILLER      PIC X(13) VALUE '360092   0889'.
262000         10  FILLER      PIC X(13) VALUE '360107   0723'.
262100         10  FILLER      PIC X(13) VALUE '360109   1314'.
262200         10  FILLER      PIC X(13) VALUE '360115   0564'.
262300         10  FILLER      PIC X(13) VALUE '360116   0565'.
262400         10  FILLER      PIC X(13) VALUE '360121   1171'.
262500         10  FILLER      PIC X(13) VALUE '360148   0319'.
262600         10  FILLER      PIC X(13) VALUE '360153   0377'.
262700         10  FILLER      PIC X(13) VALUE '360156   0893'.
262800         10  FILLER      PIC X(13) VALUE '360170   1348'.
262900         10  FILLER      PIC X(13) VALUE '360189   0534'.
263000         10  FILLER      PIC X(13) VALUE '360195   1483'.
263100         10  FILLER      PIC X(13) VALUE '360197   0814'.
263200         10  FILLER      PIC X(13) VALUE '360210   1532'.
263300         10  FILLER      PIC X(13) VALUE '360245   0124'.
263400         10  FILLER      PIC X(13) VALUE '360247   0454'.
263500         10  FILLER      PIC X(13) VALUE '360258   0004'.
263600         10  FILLER      PIC X(13) VALUE '360261   0030'.
263700         10  FILLER      PIC X(13) VALUE '360263   0339'.
263800         10  FILLER      PIC X(13) VALUE '360269   0011'.
263900         10  FILLER      PIC X(13) VALUE '360270   0954'.
264000         10  FILLER      PIC X(13) VALUE '360271   0012'.
264100         10  FILLER      PIC X(13) VALUE '360274   0141'.
264200         10  FILLER      PIC X(13) VALUE '360347   0267'.
264300         10  FILLER      PIC X(13) VALUE '360348   1499'.
264400         10  FILLER      PIC X(13) VALUE '360350   0163'.
264500         10  FILLER      PIC X(13) VALUE '360351   1545'.
264600         10  FILLER      PIC X(13) VALUE '360352   0205'.
264700         10  FILLER      PIC X(13) VALUE '360355   0232'.
264800         10  FILLER      PIC X(13) VALUE '360356   0014'.
264900         10  FILLER      PIC X(13) VALUE '360358   0009'.
265000         10  FILLER      PIC X(13) VALUE '360360   0548'.
265100         10  FILLER      PIC X(13) VALUE '370002   0661'.
265200         10  FILLER      PIC X(13) VALUE '370004   1391'.
265300         10  FILLER      PIC X(13) VALUE '370006   1543'.
265400         10  FILLER      PIC X(13) VALUE '370007   0172'.
265500         10  FILLER      PIC X(13) VALUE '370011   0310'.
265600         10  FILLER      PIC X(13) VALUE '370015   0409'.
265700         10  FILLER      PIC X(13) VALUE '370019   0601'.
265800         10  FILLER      PIC X(13) VALUE '370020   1281'.
265900         10  FILLER      PIC X(13) VALUE '370029   0680'.
266000         10  FILLER      PIC X(13) VALUE '370030   0492'.
266100         10  FILLER      PIC X(13) VALUE '370036   0261'.
266200         10  FILLER      PIC X(13) VALUE '370039   1046'.
266300         10  FILLER      PIC X(13) VALUE '370040   1046'.
266400         10  FILLER      PIC X(13) VALUE '370041   0179'.
266500         10  FILLER      PIC X(13) VALUE '370048   0728'.
266600         10  FILLER      PIC X(13) VALUE '370051   0312'.
266700         10  FILLER      PIC X(13) VALUE '370054   0924'.
266800         10  FILLER      PIC X(13) VALUE '370057   0421'.
266900         10  FILLER      PIC X(13) VALUE '370065   0867'.
267000         10  FILLER      PIC X(13) VALUE '370072   0371'.
267100         10  FILLER      PIC X(13) VALUE '370080   0140'.
267200         10  FILLER      PIC X(13) VALUE '370083   0370'.
267300         10  FILLER      PIC X(13) VALUE '370097   1205'.
267400         10  FILLER      PIC X(13) VALUE '370099   0967'.
267500         10  FILLER      PIC X(13) VALUE '370100   0968'.
267600         10  FILLER      PIC X(13) VALUE '370103   0279'.
267700         10  FILLER      PIC X(13) VALUE '370112   0430'.
267800         10  FILLER      PIC X(13) VALUE '370138   0261'.
267900         10  FILLER      PIC X(13) VALUE '370139   0283'.
268000         10  FILLER      PIC X(13) VALUE '370153   0561'.
268100         10  FILLER      PIC X(13) VALUE '370156   0424'.
268200         10  FILLER      PIC X(13) VALUE '370158   0766'.
268300         10  FILLER      PIC X(13) VALUE '370166   0859'.
268400         10  FILLER      PIC X(13) VALUE '370169   0080'.
268500         10  FILLER      PIC X(13) VALUE '370170   0049'.
268600         10  FILLER      PIC X(13) VALUE '370171   0381'.
268700         10  FILLER      PIC X(13) VALUE '370172   0208'.
268800         10  FILLER      PIC X(13) VALUE '370173   0121'.
268900         10  FILLER      PIC X(13) VALUE '370178   0891'.
269000         10  FILLER      PIC X(13) VALUE '370180   0416'.
269100         10  FILLER      PIC X(13) VALUE '370183   0369'.
269200         10  FILLER      PIC X(13) VALUE '370190   0184'.
269300         10  FILLER      PIC X(13) VALUE '370192   0074'.
269400         10  FILLER      PIC X(13) VALUE '370199   0010'.
269500         10  FILLER      PIC X(13) VALUE '370201   0061'.
269600         10  FILLER      PIC X(13) VALUE '370203   0662'.
269700         10  FILLER      PIC X(13) VALUE '370206   0331'.
269800         10  FILLER      PIC X(13) VALUE '370210   1157'.
269900         10  FILLER      PIC X(13) VALUE '370211   1068'.
270000         10  FILLER      PIC X(13) VALUE '370212   0196'.
270100         10  FILLER      PIC X(13) VALUE '370214   0060'.
270200         10  FILLER      PIC X(13) VALUE '370216   0612'.
270300         10  FILLER      PIC X(13) VALUE '370218   1430'.
270400         10  FILLER      PIC X(13) VALUE '370220   0059'.
270500         10  FILLER      PIC X(13) VALUE '370225   0081'.
270600         10  FILLER      PIC X(13) VALUE '370227   0505'.
270700         10  FILLER      PIC X(13) VALUE '370228   0418'.
270800         10  FILLER      PIC X(13) VALUE '370229   0362'.
270900         10  FILLER      PIC X(13) VALUE '370232   0742'.
271000         10  FILLER      PIC X(13) VALUE '370235   1269'.
271100         10  FILLER      PIC X(13) VALUE '370236   0354'.
271200         10  FILLER      PIC X(13) VALUE '380001   1109'.
271300         10  FILLER      PIC X(13) VALUE '380005   0509'.
271400         10  FILLER      PIC X(13) VALUE '380022   1558'.
271500         10  FILLER      PIC X(13) VALUE '380029   0710'.
271600         10  FILLER      PIC X(13) VALUE '380033   0670'.
271700         10  FILLER      PIC X(13) VALUE '380037   1040'.
271800         10  FILLER      PIC X(13) VALUE '380038   1239'.
271900         10  FILLER      PIC X(13) VALUE '380040   1005'.
272000         10  FILLER      PIC X(13) VALUE '380052   1253'.
272100         10  FILLER      PIC X(13) VALUE '380056   0414'.
272200         10  FILLER      PIC X(13) VALUE '380082   1507'.
272300         10  FILLER      PIC X(13) VALUE '390003   0531'.
272400         10  FILLER      PIC X(13) VALUE '390008   1092'.
272500         10  FILLER      PIC X(13) VALUE '390019   1086'.
272600         10  FILLER      PIC X(13) VALUE '390025   0038'.
272700         10  FILLER      PIC X(13) VALUE '390035   1395'.
272800         10  FILLER      PIC X(13) VALUE '390043   1162'.
272900         10  FILLER      PIC X(13) VALUE '390052   1503'.
273000         10  FILLER      PIC X(13) VALUE '390056   1008'.
273100         10  FILLER      PIC X(13) VALUE '390062   0934'.
273200         10  FILLER      PIC X(13) VALUE '390068   1246'.
273300         10  FILLER      PIC X(13) VALUE '390071   0708'.
273400         10  FILLER      PIC X(13) VALUE '390072   1559'.
273500         10  FILLER      PIC X(13) VALUE '390084   0803'.
273600         10  FILLER      PIC X(13) VALUE '390090   1433'.
273700         10  FILLER      PIC X(13) VALUE '390093   1326'.
273800         10  FILLER      PIC X(13) VALUE '390095   0249'.
273900         10  FILLER      PIC X(13) VALUE '390104   0554'.
274000         10  FILLER      PIC X(13) VALUE '390112   0941'.
274100         10  FILLER      PIC X(13) VALUE '390117   1094'.
274200         10  FILLER      PIC X(13) VALUE '390118   1209'.
274300         10  FILLER      PIC X(13) VALUE '390122   0916'.
274400         10  FILLER      PIC X(13) VALUE '390130   0548'.
274500         10  FILLER      PIC X(13) VALUE '390132   1571'.
274600         10  FILLER      PIC X(13) VALUE '390138   1386'.
274700         10  FILLER      PIC X(13) VALUE '390146   1284'.
274800         10  FILLER      PIC X(13) VALUE '390150   1262'.
274900         10  FILLER      PIC X(13) VALUE '390183   1173'.
275000         10  FILLER      PIC X(13) VALUE '390184   0614'.
275100         10  FILLER      PIC X(13) VALUE '390189   0321'.
275200         10  FILLER      PIC X(13) VALUE '390192   0787'.
275300         10  FILLER      PIC X(13) VALUE '390198   1186'.
275400         10  FILLER      PIC X(13) VALUE '390199   0996'.
275500         10  FILLER      PIC X(13) VALUE '390236   0630'.
275600         10  FILLER      PIC X(13) VALUE '390266   0947'.
275700         10  FILLER      PIC X(13) VALUE '390272   0230'.
275800         10  FILLER      PIC X(13) VALUE '390278   0643'.
275900         10  FILLER      PIC X(13) VALUE '390302   0018'.
276000         10  FILLER      PIC X(13) VALUE '390307   0049'.
276100         10  FILLER      PIC X(13) VALUE '390312   0363'.
276200         10  FILLER      PIC X(13) VALUE '390313   0244'.
276300         10  FILLER      PIC X(13) VALUE '390314   0523'.
276400         10  FILLER      PIC X(13) VALUE '390316   0293'.
276500         10  FILLER      PIC X(13) VALUE '390318   0168'.
276600         10  FILLER      PIC X(13) VALUE '390321   0285'.
276700         10  FILLER      PIC X(13) VALUE '390322   0261'.
276800         10  FILLER      PIC X(13) VALUE '390323   0238'.
276900         10  FILLER      PIC X(13) VALUE '390324   0025'.
277000         10  FILLER      PIC X(13) VALUE '390325   0587'.
277100         10  FILLER      PIC X(13) VALUE '390327   0095'.
277200         10  FILLER      PIC X(13) VALUE '390328   0220'.
277300         10  FILLER      PIC X(13) VALUE '410010   0692'.
277400         10  FILLER      PIC X(13) VALUE '420005   1192'.
277500         10  FILLER      PIC X(13) VALUE '420011   0519'.
277600         10  FILLER      PIC X(13) VALUE '420016   0382'.
277700         10  FILLER      PIC X(13) VALUE '420019   0836'.
277800         10  FILLER      PIC X(13) VALUE '420033   1557'.
277900         10  FILLER      PIC X(13) VALUE '420037   0885'.
278000         10  FILLER      PIC X(13) VALUE '420039   1465'.
278100         10  FILLER      PIC X(13) VALUE '420043   1337'.
278200         10  FILLER      PIC X(13) VALUE '420053   0853'.
278300         10  FILLER      PIC X(13) VALUE '420054   0555'.
278400         10  FILLER      PIC X(13) VALUE '420056   0006'.
278500         10  FILLER      PIC X(13) VALUE '420057   0166'.
278600         10  FILLER      PIC X(13) VALUE '420062   1087'.
278700         10  FILLER      PIC X(13) VALUE '420064   0533'.
278800         10  FILLER      PIC X(13) VALUE '420066   0460'.
278900         10  FILLER      PIC X(13) VALUE '420069   0974'.
279000         10  FILLER      PIC X(13) VALUE '420072   0436'.
279100         10  FILLER      PIC X(13) VALUE '420089   1510'.
279200         10  FILLER      PIC X(13) VALUE '420101   1124'.
279300         10  FILLER      PIC X(13) VALUE '420102   0526'.
279400         10  FILLER      PIC X(13) VALUE '420103   0855'.
279500         10  FILLER      PIC X(13) VALUE '420104   0512'.
279600         10  FILLER      PIC X(13) VALUE '420105   1572'.
279700         10  FILLER      PIC X(13) VALUE '430008   0581'.
279800         10  FILLER      PIC X(13) VALUE '430013   1197'.
279900         10  FILLER      PIC X(13) VALUE '430015   0655'.
280000         10  FILLER      PIC X(13) VALUE '430048   0654'.
280100         10  FILLER      PIC X(13) VALUE '430081   0113'.
280200         10  FILLER      PIC X(13) VALUE '430083   0016'.
280300         10  FILLER      PIC X(13) VALUE '430084   0150'.
280400         10  FILLER      PIC X(13) VALUE '430089   0499'.
280500         10  FILLER      PIC X(13) VALUE '430090   0563'.
280600         10  FILLER      PIC X(13) VALUE '430091   0619'.
280700         10  FILLER      PIC X(13) VALUE '430092   0172'.
280800         10  FILLER      PIC X(13) VALUE '430093   0046'.
280900         10  FILLER      PIC X(13) VALUE '430094   0033'.
281000         10  FILLER      PIC X(13) VALUE '430096   0135'.
281100         10  FILLER      PIC X(13) VALUE '430097   0104'.
281200         10  FILLER      PIC X(13) VALUE '440001   0658'.
281300         10  FILLER      PIC X(13) VALUE '440007   0578'.
281400         10  FILLER      PIC X(13) VALUE '440008   0639'.
281500         10  FILLER      PIC X(13) VALUE '440010   0402'.
281600         10  FILLER      PIC X(13) VALUE '440016   0382'.
281700         10  FILLER      PIC X(13) VALUE '440020   0739'.
281800         10  FILLER      PIC X(13) VALUE '440031   1099'.
281900         10  FILLER      PIC X(13) VALUE '440032   0859'.
282000         10  FILLER      PIC X(13) VALUE '440033   1218'.
282100         10  FILLER      PIC X(13) VALUE '440040   0409'.
282200         10  FILLER      PIC X(13) VALUE '440047   0220'.
282300         10  FILLER      PIC X(13) VALUE '440050   1030'.
282400         10  FILLER      PIC X(13) VALUE '440051   0796'.
282500         10  FILLER      PIC X(13) VALUE '440054   0651'.
282600         10  FILLER      PIC X(13) VALUE '440056   1430'.
282700         10  FILLER      PIC X(13) VALUE '440057   0873'.
282800         10  FILLER      PIC X(13) VALUE '440060   0185'.
282900         10  FILLER      PIC X(13) VALUE '440061   1099'.
283000         10  FILLER      PIC X(13) VALUE '440064   0887'.
283100         10  FILLER      PIC X(13) VALUE '440068   1167'.
283200         10  FILLER      PIC X(13) VALUE '440070   0562'.
283300         10  FILLER      PIC X(13) VALUE '440083   1386'.
283400         10  FILLER      PIC X(13) VALUE '440084   1420'.
283500         10  FILLER      PIC X(13) VALUE '440102   0770'.
283600         10  FILLER      PIC X(13) VALUE '440109   0776'.
283700         10  FILLER      PIC X(13) VALUE '440110   1142'.
283800         10  FILLER      PIC X(13) VALUE '440111   0446'.
283900         10  FILLER      PIC X(13) VALUE '440115   0283'.
284000         10  FILLER      PIC X(13) VALUE '440130   1131'.
284100         10  FILLER      PIC X(13) VALUE '440131   0531'.
284200         10  FILLER      PIC X(13) VALUE '440137   1348'.
284300         10  FILLER      PIC X(13) VALUE '440141   0369'.
284400         10  FILLER      PIC X(13) VALUE '440148   0765'.
284500         10  FILLER      PIC X(13) VALUE '440152   1343'.
284600         10  FILLER      PIC X(13) VALUE '440153   1226'.
284700         10  FILLER      PIC X(13) VALUE '440159   0674'.
284800         10  FILLER      PIC X(13) VALUE '440168   0164'.
284900         10  FILLER      PIC X(13) VALUE '440174   0373'.
285000         10  FILLER      PIC X(13) VALUE '440175   1336'.
285100         10  FILLER      PIC X(13) VALUE '440180   0857'.
285200         10  FILLER      PIC X(13) VALUE '440181   0178'.
285300         10  FILLER      PIC X(13) VALUE '440182   0671'.
285400         10  FILLER      PIC X(13) VALUE '440186   0564'.
285500         10  FILLER      PIC X(13) VALUE '440192   0669'.
285600         10  FILLER      PIC X(13) VALUE '440200   0304'.
285700         10  FILLER      PIC X(13) VALUE '440218   0397'.
285800         10  FILLER      PIC X(13) VALUE '450005   0747'.
285900         10  FILLER      PIC X(13) VALUE '450052   0309'.
286000         10  FILLER      PIC X(13) VALUE '450055   0507'.
286100         10  FILLER      PIC X(13) VALUE '450073   0230'.
286200         10  FILLER      PIC X(13) VALUE '450078   0247'.
286300         10  FILLER      PIC X(13) VALUE '450080   1109'.
286400         10  FILLER      PIC X(13) VALUE '450082   0868'.
286500         10  FILLER      PIC X(13) VALUE '450085   0410'.
286600         10  FILLER      PIC X(13) VALUE '450090   0650'.
286700         10  FILLER      PIC X(13) VALUE '450099   0767'.
286800         10  FILLER      PIC X(13) VALUE '450108   0641'.
286900         10  FILLER      PIC X(13) VALUE '450123   0096'.
287000         10  FILLER      PIC X(13) VALUE '450143   0344'.
287100         10  FILLER      PIC X(13) VALUE '450144   0159'.
287200         10  FILLER      PIC X(13) VALUE '450154   1205'.
287300         10  FILLER      PIC X(13) VALUE '450155   0198'.
287400         10  FILLER      PIC X(13) VALUE '450162   0533'.
287500         10  FILLER      PIC X(13) VALUE '450165   0834'.
287600         10  FILLER      PIC X(13) VALUE '450177   0800'.
287700         10  FILLER      PIC X(13) VALUE '450178   0510'.
287800         10  FILLER      PIC X(13) VALUE '450187   0719'.
287900         10  FILLER      PIC X(13) VALUE '450188   0806'.
288000         10  FILLER      PIC X(13) VALUE '450192   0729'.
288100         10  FILLER      PIC X(13) VALUE '450194   0766'.
288200         10  FILLER      PIC X(13) VALUE '450210   0457'.
288300         10  FILLER      PIC X(13) VALUE '450214   0568'.
288400         10  FILLER      PIC X(13) VALUE '450219   0403'.
288500         10  FILLER      PIC X(13) VALUE '450221   0309'.
288600         10  FILLER      PIC X(13) VALUE '450234   0265'.
288700         10  FILLER      PIC X(13) VALUE '450235   0415'.
288800         10  FILLER      PIC X(13) VALUE '450236   1513'.
288900         10  FILLER      PIC X(13) VALUE '450241   0192'.
289000         10  FILLER      PIC X(13) VALUE '450243   0107'.
289100         10  FILLER      PIC X(13) VALUE '450253   0235'.
289200         10  FILLER      PIC X(13) VALUE '450270   0612'.
289300         10  FILLER      PIC X(13) VALUE '450283   0249'.
289400         10  FILLER      PIC X(13) VALUE '450292   1151'.
289500         10  FILLER      PIC X(13) VALUE '450293   0153'.
289600         10  FILLER      PIC X(13) VALUE '450296   0746'.
289700         10  FILLER      PIC X(13) VALUE '450306   0155'.
289800         10  FILLER      PIC X(13) VALUE '450347   1326'.
289900         10  FILLER      PIC X(13) VALUE '450348   0381'.
290000         10  FILLER      PIC X(13) VALUE '450351   0959'.
290100         10  FILLER      PIC X(13) VALUE '450369   0301'.
290200         10  FILLER      PIC X(13) VALUE '450370   0532'.
290300         10  FILLER      PIC X(13) VALUE '450372   1462'.
290400         10  FILLER      PIC X(13) VALUE '450373   0270'.
290500         10  FILLER      PIC X(13) VALUE '450379   0714'.
290600         10  FILLER      PIC X(13) VALUE '450395   1413'.
290700         10  FILLER      PIC X(13) VALUE '450399   0275'.
290800         10  FILLER      PIC X(13) VALUE '450400   0502'.
290900         10  FILLER      PIC X(13) VALUE '450411   0569'.
291000         10  FILLER      PIC X(13) VALUE '450419   0972'.
291100         10  FILLER      PIC X(13) VALUE '450422   0341'.
291200         10  FILLER      PIC X(13) VALUE '450438   0481'.
291300         10  FILLER      PIC X(13) VALUE '450446   0450'.
291400         10  FILLER      PIC X(13) VALUE '450451   0488'.
291500         10  FILLER      PIC X(13) VALUE '450460   0430'.
291600         10  FILLER      PIC X(13) VALUE '450465   1073'.
291700         10  FILLER      PIC X(13) VALUE '450475   0722'.
291800         10  FILLER      PIC X(13) VALUE '450488   0080'.
291900         10  FILLER      PIC X(13) VALUE '450489   0156'.
292000         10  FILLER      PIC X(13) VALUE '450497   0396'.
292100         10  FILLER      PIC X(13) VALUE '450498   0255'.
292200         10  FILLER      PIC X(13) VALUE '450539   0754'.
292300         10  FILLER      PIC X(13) VALUE '450565   0731'.
292400         10  FILLER      PIC X(13) VALUE '450573   0843'.
292500         10  FILLER      PIC X(13) VALUE '450578   0068'.
292600         10  FILLER      PIC X(13) VALUE '450580   0820'.
292700         10  FILLER      PIC X(13) VALUE '450584   0299'.
292800         10  FILLER      PIC X(13) VALUE '450586   0259'.
292900         10  FILLER      PIC X(13) VALUE '450591   0569'.
293000         10  FILLER      PIC X(13) VALUE '450596   1299'.
293100         10  FILLER      PIC X(13) VALUE '450597   0825'.
293200         10  FILLER      PIC X(13) VALUE '450604   1576'.
293300         10  FILLER      PIC X(13) VALUE '450605   0598'.
293400         10  FILLER      PIC X(13) VALUE '450615   0544'.
293500         10  FILLER      PIC X(13) VALUE '450620   0304'.
293600         10  FILLER      PIC X(13) VALUE '450630   0137'.
293700         10  FILLER      PIC X(13) VALUE '450641   0389'.
293800         10  FILLER      PIC X(13) VALUE '450653   1134'.
293900         10  FILLER      PIC X(13) VALUE '450654   0865'.
294000         10  FILLER      PIC X(13) VALUE '450658   0354'.
294100         10  FILLER      PIC X(13) VALUE '450661   1507'.
294200         10  FILLER      PIC X(13) VALUE '450674   0125'.
294300         10  FILLER      PIC X(13) VALUE '450683   0503'.
294400         10  FILLER      PIC X(13) VALUE '450690   0997'.
294500         10  FILLER      PIC X(13) VALUE '450694   0265'.
294600         10  FILLER      PIC X(13) VALUE '450698   0129'.
294700         10  FILLER      PIC X(13) VALUE '450746   0070'.
294800         10  FILLER      PIC X(13) VALUE '450749   0353'.
294900         10  FILLER      PIC X(13) VALUE '450754   0998'.
295000         10  FILLER      PIC X(13) VALUE '450755   0324'.
295100         10  FILLER      PIC X(13) VALUE '450770   0397'.
295200         10  FILLER      PIC X(13) VALUE '450774   0178'.
295300         10  FILLER      PIC X(13) VALUE '450780   0363'.
295400         10  FILLER      PIC X(13) VALUE '450795   0416'.
295500         10  FILLER      PIC X(13) VALUE '450796   0036'.
295600         10  FILLER      PIC X(13) VALUE '450797   0006'.
295700         10  FILLER      PIC X(13) VALUE '450803   1211'.
295800         10  FILLER      PIC X(13) VALUE '450804   1137'.
295900         10  FILLER      PIC X(13) VALUE '450808   0150'.
296000         10  FILLER      PIC X(13) VALUE '450813   0292'.
296100         10  FILLER      PIC X(13) VALUE '450822   1329'.
296200         10  FILLER      PIC X(13) VALUE '450825   0194'.
296300         10  FILLER      PIC X(13) VALUE '450827   0542'.
296400         10  FILLER      PIC X(13) VALUE '450831   0030'.
296500         10  FILLER      PIC X(13) VALUE '450833   0724'.
296600         10  FILLER      PIC X(13) VALUE '450834   0091'.
296700         10  FILLER      PIC X(13) VALUE '450839   0486'.
296800         10  FILLER      PIC X(13) VALUE '450840   1329'.
296900         10  FILLER      PIC X(13) VALUE '450841   0150'.
297000         10  FILLER      PIC X(13) VALUE '450845   0360'.
297100         10  FILLER      PIC X(13) VALUE '450848   1456'.
297200         10  FILLER      PIC X(13) VALUE '450851   1272'.
297300         10  FILLER      PIC X(13) VALUE '450853   0495'.
297400         10  FILLER      PIC X(13) VALUE '450856   0357'.
297500         10  FILLER      PIC X(13) VALUE '450860   0105'.
297600         10  FILLER      PIC X(13) VALUE '450864   0836'.
297700         10  FILLER      PIC X(13) VALUE '450865   0167'.
297800         10  FILLER      PIC X(13) VALUE '450871   0304'.
297900         10  FILLER      PIC X(13) VALUE '450872   0510'.
298000         10  FILLER      PIC X(13) VALUE '450874   0053'.
298100         10  FILLER      PIC X(13) VALUE '450875   0512'.
298200         10  FILLER      PIC X(13) VALUE '450877   0639'.
298300         10  FILLER      PIC X(13) VALUE '450880   0331'.
298400         10  FILLER      PIC X(13) VALUE '450883   0034'.
298500         10  FILLER      PIC X(13) VALUE '450884   0397'.
298600         10  FILLER      PIC X(13) VALUE '450886   0094'.
298700         10  FILLER      PIC X(13) VALUE '450888   0384'.
298800         10  FILLER      PIC X(13) VALUE '450889   0050'.
298900         10  FILLER      PIC X(13) VALUE '450891   0102'.
299000         10  FILLER      PIC X(13) VALUE '450893   0096'.
299100         10  FILLER      PIC X(13) VALUE '450894   0201'.
299200         10  FILLER      PIC X(13) VALUE '460003   1432'.
299300         10  FILLER      PIC X(13) VALUE '460007   1053'.
299400         10  FILLER      PIC X(13) VALUE '460011   0794'.
299500         10  FILLER      PIC X(13) VALUE '460013   1149'.
299600         10  FILLER      PIC X(13) VALUE '460014   0635'.
299700         10  FILLER      PIC X(13) VALUE '460017   0283'.
299800         10  FILLER      PIC X(13) VALUE '460019   0429'.
299900         10  FILLER      PIC X(13) VALUE '460023   1466'.
300000         10  FILLER      PIC X(13) VALUE '460026   0419'.
300100         10  FILLER      PIC X(13) VALUE '460030   0404'.
300200         10  FILLER      PIC X(13) VALUE '460033   0130'.
300300         10  FILLER      PIC X(13) VALUE '460035   0119'.
300400         10  FILLER      PIC X(13) VALUE '460039   0186'.
300500         10  FILLER      PIC X(13) VALUE '460041   1477'.
300600         10  FILLER      PIC X(13) VALUE '460043   0015'.
300700         10  FILLER      PIC X(13) VALUE '460044   1207'.
300800         10  FILLER      PIC X(13) VALUE '460049   0769'.
300900         10  FILLER      PIC X(13) VALUE '460052   0964'.
301000         10  FILLER      PIC X(13) VALUE '460054   0204'.
301100         10  FILLER      PIC X(13) VALUE '460057   0316'.
301200         10  FILLER      PIC X(13) VALUE '460058   0636'.
301300         10  FILLER      PIC X(13) VALUE '470001   1440'.
301400         10  FILLER      PIC X(13) VALUE '470011   0817'.
301500         10  FILLER      PIC X(13) VALUE '470024   1173'.
301600         10  FILLER      PIC X(13) VALUE '480001   0942'.
301700         10  FILLER      PIC X(13) VALUE '480002   1079'.
301800         10  FILLER      PIC X(13) VALUE '490002   1266'.
301900         10  FILLER      PIC X(13) VALUE '490012   1158'.
302000         10  FILLER      PIC X(13) VALUE '490027   0766'.
302100         10  FILLER      PIC X(13) VALUE '490033   1175'.
302200         10  FILLER      PIC X(13) VALUE '490038   1029'.
302300         10  FILLER      PIC X(13) VALUE '490084   1182'.
302400         10  FILLER      PIC X(13) VALUE '490088   0972'.
302500         10  FILLER      PIC X(13) VALUE '490089   1022'.
302600         10  FILLER      PIC X(13) VALUE '490092   1096'.
302700         10  FILLER      PIC X(13) VALUE '490094   0982'.
302800         10  FILLER      PIC X(13) VALUE '490097   1103'.
302900         10  FILLER      PIC X(13) VALUE '490105   0016'.
303000         10  FILLER      PIC X(13) VALUE '490106   0001'.
303100         10  FILLER      PIC X(13) VALUE '490109   0099'.
303200         10  FILLER      PIC X(13) VALUE '490111   1201'.
303300         10  FILLER      PIC X(13) VALUE '490114   1128'.
303400         10  FILLER      PIC X(13) VALUE '490117   0494'.
303500         10  FILLER      PIC X(13) VALUE '490123   0895'.
303600         10  FILLER      PIC X(13) VALUE '490127   0869'.
303700         10  FILLER      PIC X(13) VALUE '490134   0021'.
303800         10  FILLER      PIC X(13) VALUE '490135   0165'.
303900         10  FILLER      PIC X(13) VALUE '490140   1197'.
304000         10  FILLER      PIC X(13) VALUE '490141   1498'.
304100         10  FILLER      PIC X(13) VALUE '500033   0827'.
304200         10  FILLER      PIC X(13) VALUE '500037   0604'.
304300         10  FILLER      PIC X(13) VALUE '500049   0646'.
304400         10  FILLER      PIC X(13) VALUE '500052   0002'.
304500         10  FILLER      PIC X(13) VALUE '500060   0736'.
304600         10  FILLER      PIC X(13) VALUE '500084   0583'.
304700         10  FILLER      PIC X(13) VALUE '500148   0312'.
304800         10  FILLER      PIC X(13) VALUE '500152   1403'.
304900         10  FILLER      PIC X(13) VALUE '510012   1325'.
305000         10  FILLER      PIC X(13) VALUE '510013   1232'.
305100         10  FILLER      PIC X(13) VALUE '510018   0841'.
305200         10  FILLER      PIC X(13) VALUE '510038   1391'.
305300         10  FILLER      PIC X(13) VALUE '510053   0618'.
305400         10  FILLER      PIC X(13) VALUE '510072   0577'.
305500         10  FILLER      PIC X(13) VALUE '510077   1043'.
305600         10  FILLER      PIC X(13) VALUE '510082   0896'.
305700         10  FILLER      PIC X(13) VALUE '510086   0338'.
305800         10  FILLER      PIC X(13) VALUE '520002   1597'.
305900         10  FILLER      PIC X(13) VALUE '520011   1193'.
306000         10  FILLER      PIC X(13) VALUE '520017   1076'.
306100         10  FILLER      PIC X(13) VALUE '520019   1070'.
306200         10  FILLER      PIC X(13) VALUE '520028   1438'.
306300         10  FILLER      PIC X(13) VALUE '520033   1463'.
306400         10  FILLER      PIC X(13) VALUE '520034   1100'.
306500         10  FILLER      PIC X(13) VALUE '520038   1078'.
306600         10  FILLER      PIC X(13) VALUE '520041   1074'.
306700         10  FILLER      PIC X(13) VALUE '520057   0857'.
306800         10  FILLER      PIC X(13) VALUE '520063   1257'.
306900         10  FILLER      PIC X(13) VALUE '520071   1274'.
307000         10  FILLER      PIC X(13) VALUE '520076   0897'.
307100         10  FILLER      PIC X(13) VALUE '520091   1223'.
307200         10  FILLER      PIC X(13) VALUE '520095   0869'.
307300         10  FILLER      PIC X(13) VALUE '520102   1484'.
307400         10  FILLER      PIC X(13) VALUE '520109   0654'.
307500         10  FILLER      PIC X(13) VALUE '520116   1004'.
307600         10  FILLER      PIC X(13) VALUE '520194   0475'.
307700         10  FILLER      PIC X(13) VALUE '520195   0001'.
307800         10  FILLER      PIC X(13) VALUE '520196   0151'.
307900         10  FILLER      PIC X(13) VALUE '520198   1349'.
308000         10  FILLER      PIC X(13) VALUE '520204   1077'.
308100         10  FILLER      PIC X(13) VALUE '520205   0643'.
308200         10  FILLER      PIC X(13) VALUE '520206   1147'.
308300         10  FILLER      PIC X(13) VALUE '520208   1034'.
308400         10  FILLER      PIC X(13) VALUE '530002   0695'.
308500         10  FILLER      PIC X(13) VALUE '530006   0869'.
308600         10  FILLER      PIC X(13) VALUE '530008   0648'.
308700         10  FILLER      PIC X(13) VALUE '530010   0620'.
308800         10  FILLER      PIC X(13) VALUE '530011   0584'.
308900         10  FILLER      PIC X(13) VALUE '530015   0630'.
309000         10  FILLER      PIC X(13) VALUE '530025   0674'.
309100         10  FILLER      PIC X(13) VALUE '530032   0275'.
309200         10  FILLER      PIC X(13) VALUE '530033   0331'.
309300         10  FILLER      PIC X(13) VALUE '640001   0102'.
309400         10  FILLER      PIC X(13) VALUE '660001   0384'.
309500         10  FILLER      PIC X(13) VALUE '670002   0620'.
309600         10  FILLER      PIC X(13) VALUE '670004   0831'.
309700         10  FILLER      PIC X(13) VALUE '670005   0041'.
309800         10  FILLER      PIC X(13) VALUE '670006   0467'.
309900         10  FILLER      PIC X(13) VALUE '670008   0243'.
310000         10  FILLER      PIC X(13) VALUE '670012   0721'.
310100         10  FILLER      PIC X(13) VALUE '670018   0073'.
310200         10  FILLER      PIC X(13) VALUE '670019   1084'.
310300         10  FILLER      PIC X(13) VALUE '670021   0010'.
310400         10  FILLER      PIC X(13) VALUE '670029   0110'.
310500         10  FILLER      PIC X(13) VALUE '670043   1158'.
310600         10  FILLER      PIC X(13) VALUE '670044   1139'.
310700         10  FILLER      PIC X(13) VALUE '670046   0147'.
310800         10  FILLER      PIC X(13) VALUE '670049   0260'.
310900         10  FILLER      PIC X(13) VALUE '670050   0174'.
311000         10  FILLER      PIC X(13) VALUE '670052   0420'.
311100         10  FILLER      PIC X(13) VALUE '670053   1530'.
311200         10  FILLER      PIC X(13) VALUE '670054   0170'.
311300         10  FILLER      PIC X(13) VALUE '670058   0009'.
311400         10  FILLER      PIC X(13) VALUE '670059   0375'.
311500         10  FILLER      PIC X(13) VALUE '670060   1593'.
311600         10  FILLER      PIC X(13) VALUE '670061   0280'.
311700         10  FILLER      PIC X(13) VALUE '670062   0009'.
311800         10  FILLER      PIC X(13) VALUE '670063   0033'.
311900         10  FILLER      PIC X(13) VALUE '670064   0044'.
312000         10  FILLER      PIC X(13) VALUE '670066   0092'.
312100         10  FILLER      PIC X(13) VALUE '670067   0355'.
312200         10  FILLER      PIC X(13) VALUE '670068   1056'.
312300         10  FILLER      PIC X(13) VALUE '670069   0173'.
312400         10  FILLER      PIC X(13) VALUE '670071   0753'.
312500         10  FILLER      PIC X(13) VALUE '670072   0423'.
312600         10  FILLER      PIC X(13) VALUE '670073   0516'.
312700         10  FILLER      PIC X(13) VALUE '670075   1282'.
312800         10  FILLER      PIC X(13) VALUE '670076   0097'.
312900         10  FILLER      PIC X(13) VALUE '670077   1559'.
313000         10  FILLER      PIC X(13) VALUE '670078   0025'.
313100         10  FILLER      PIC X(13) VALUE '670079   0236'.
313200         10  FILLER      PIC X(13) VALUE '670080   0194'.
313300         10  FILLER      PIC X(13) VALUE '670082   0122'.
313400         10  FILLER      PIC X(13) VALUE '670083   0013'.
313500         10  FILLER      PIC X(13) VALUE '670899   0002'.
313600     05  WK-LOWVOL-DATA2 REDEFINES LOWVOL-PROV-DISCHG-DATA.
313700        10  LOWVOL-TAB OCCURS 1266
313800                        ASCENDING KEY IS WK-LOWVOL-PROV
313900                        INDEXED BY LOWVOL-IDX.
314000           15  WK-LOWVOL-COUNT-ALL.
314100              20  WK-LOWVOL-PROV           PIC X(6).
314200              20  FILLER                   PIC XXX.
314300              20  WK-LOWVOL-PROV-DISCHG    PIC 9999.
314400
314500*****YEARCHANGE 2014.0 ************************************
314600
314700***********************************************************
314800*****YEARCHANGE 2014.3 ************************************
314900***********************************************************
315000***  PROVIDER ADJUSTMENT TABLE FOR UNCOMPENSATED CARE UCC
315100***  REVISED 4/11/2014
315200***********************************************************
315300
315400 01  UNCOMP-CARE-TABLE.
315500     05 PROV-ADJ-AMOUNT-DATA.
315600         10  FILLER      PIC X(15) VALUE '010001 00069677'.
315700         10  FILLER      PIC X(15) VALUE '010005 00049360'.
315800         10  FILLER      PIC X(15) VALUE '010006 00053510'.
315900         10  FILLER      PIC X(15) VALUE '010007 00028953'.
316000         10  FILLER      PIC X(15) VALUE '010008 00066613'.
316100         10  FILLER      PIC X(15) VALUE '010011 00082120'.
316200         10  FILLER      PIC X(15) VALUE '010012 00052881'.
316300         10  FILLER      PIC X(15) VALUE '010016 00074159'.
316400         10  FILLER      PIC X(15) VALUE '010019 00064258'.
316500         10  FILLER      PIC X(15) VALUE '010021 00070757'.
316600         10  FILLER      PIC X(15) VALUE '010022 00026278'.
316700         10  FILLER      PIC X(15) VALUE '010023 00138215'.
316800         10  FILLER      PIC X(15) VALUE '010024 00076673'.
316900         10  FILLER      PIC X(15) VALUE '010025 00071335'.
317000         10  FILLER      PIC X(15) VALUE '010029 00069797'.
317100         10  FILLER      PIC X(15) VALUE '010032 00031274'.
317200         10  FILLER      PIC X(15) VALUE '010033 00189985'.
317300         10  FILLER      PIC X(15) VALUE '010034 00042736'.
317400         10  FILLER      PIC X(15) VALUE '010035 00050279'.
317500         10  FILLER      PIC X(15) VALUE '010036 00059488'.
317600         10  FILLER      PIC X(15) VALUE '010038 00034801'.
317700         10  FILLER      PIC X(15) VALUE '010039 00085414'.
317800         10  FILLER      PIC X(15) VALUE '010040 00103960'.
317900         10  FILLER      PIC X(15) VALUE '010044 00024881'.
318000         10  FILLER      PIC X(15) VALUE '010045 00036033'.
318100         10  FILLER      PIC X(15) VALUE '010046 00035975'.
318200         10  FILLER      PIC X(15) VALUE '010047 00040758'.
318300         10  FILLER      PIC X(15) VALUE '010049 00063632'.
318400         10  FILLER      PIC X(15) VALUE '010050 00041865'.
318500         10  FILLER      PIC X(15) VALUE '010051 00055783'.
318600         10  FILLER      PIC X(15) VALUE '010052 00030870'.
318700         10  FILLER      PIC X(15) VALUE '010054 00052554'.
318800         10  FILLER      PIC X(15) VALUE '010055 00042178'.
318900         10  FILLER      PIC X(15) VALUE '010058 00027264'.
319000         10  FILLER      PIC X(15) VALUE '010059 00040174'.
319100         10  FILLER      PIC X(15) VALUE '010061 00074002'.
319200         10  FILLER      PIC X(15) VALUE '010062 00037554'.
319300         10  FILLER      PIC X(15) VALUE '010065 00050711'.
319400         10  FILLER      PIC X(15) VALUE '010066 00023593'.
319500         10  FILLER      PIC X(15) VALUE '010069 00038366'.
319600         10  FILLER      PIC X(15) VALUE '010073 00024176'.
319700         10  FILLER      PIC X(15) VALUE '010078 00063911'.
319800         10  FILLER      PIC X(15) VALUE '010079 00059470'.
319900         10  FILLER      PIC X(15) VALUE '010083 00048633'.
320000         10  FILLER      PIC X(15) VALUE '010085 00066414'.
320100         10  FILLER      PIC X(15) VALUE '010086 00029390'.
320200         10  FILLER      PIC X(15) VALUE '010087 00353374'.
320300         10  FILLER      PIC X(15) VALUE '010089 00074325'.
320400         10  FILLER      PIC X(15) VALUE '010090 00065488'.
320500         10  FILLER      PIC X(15) VALUE '010091 00093231'.
320600         10  FILLER      PIC X(15) VALUE '010092 00078924'.
320700         10  FILLER      PIC X(15) VALUE '010095 00056239'.
320800         10  FILLER      PIC X(15) VALUE '010097 00050626'.
320900         10  FILLER      PIC X(15) VALUE '010099 00081401'.
321000         10  FILLER      PIC X(15) VALUE '010101 00093612'.
321100         10  FILLER      PIC X(15) VALUE '010102 00035277'.
321200         10  FILLER      PIC X(15) VALUE '010103 00077790'.
321300         10  FILLER      PIC X(15) VALUE '010104 00088390'.
321400         10  FILLER      PIC X(15) VALUE '010108 00029552'.
321500         10  FILLER      PIC X(15) VALUE '010109 00046148'.
321600         10  FILLER      PIC X(15) VALUE '010110 00101564'.
321700         10  FILLER      PIC X(15) VALUE '010112 00105330'.
321800         10  FILLER      PIC X(15) VALUE '010113 00073120'.
321900         10  FILLER      PIC X(15) VALUE '010114 00092435'.
322000         10  FILLER      PIC X(15) VALUE '010118 00105029'.
322100         10  FILLER      PIC X(15) VALUE '010120 00045315'.
322200         10  FILLER      PIC X(15) VALUE '010125 00032624'.
322300         10  FILLER      PIC X(15) VALUE '010126 00048509'.
322400         10  FILLER      PIC X(15) VALUE '010128 00083084'.
322500         10  FILLER      PIC X(15) VALUE '010129 00092927'.
322600         10  FILLER      PIC X(15) VALUE '010130 00035141'.
322700         10  FILLER      PIC X(15) VALUE '010138 00065233'.
322800         10  FILLER      PIC X(15) VALUE '010139 00064134'.
322900         10  FILLER      PIC X(15) VALUE '010144 00049848'.
323000         10  FILLER      PIC X(15) VALUE '010146 00096276'.
323100         10  FILLER      PIC X(15) VALUE '010148 00040334'.
323200         10  FILLER      PIC X(15) VALUE '010149 00189076'.
323300         10  FILLER      PIC X(15) VALUE '010150 00029541'.
323400         10  FILLER      PIC X(15) VALUE '010157 00031583'.
323500         10  FILLER      PIC X(15) VALUE '010158 00058903'.
323600         10  FILLER      PIC X(15) VALUE '010164 00085221'.
323700         10  FILLER      PIC X(15) VALUE '010169 00028857'.
323800         10  FILLER      PIC X(15) VALUE '020001 00189604'.
323900         10  FILLER      PIC X(15) VALUE '020006 00066014'.
324000         10  FILLER      PIC X(15) VALUE '020012 00132961'.
324100         10  FILLER      PIC X(15) VALUE '020017 00080200'.
324200         10  FILLER      PIC X(15) VALUE '020018 00422182'.
324300         10  FILLER      PIC X(15) VALUE '020026 00243516'.
324400         10  FILLER      PIC X(15) VALUE '030001 00601768'.
324500         10  FILLER      PIC X(15) VALUE '030002 00232087'.
324600         10  FILLER      PIC X(15) VALUE '030006 00172969'.
324700         10  FILLER      PIC X(15) VALUE '030007 00056186'.
324800         10  FILLER      PIC X(15) VALUE '030010 00095044'.
324900         10  FILLER      PIC X(15) VALUE '030011 00082790'.
325000         10  FILLER      PIC X(15) VALUE '030013 00076619'.
325100         10  FILLER      PIC X(15) VALUE '030014 00119463'.
325200         10  FILLER      PIC X(15) VALUE '030016 00099959'.
325300         10  FILLER      PIC X(15) VALUE '030022 01408412'.
325400         10  FILLER      PIC X(15) VALUE '030023 00143880'.
325500         10  FILLER      PIC X(15) VALUE '030024 00301624'.
325600         10  FILLER      PIC X(15) VALUE '030030 00261582'.
325700         10  FILLER      PIC X(15) VALUE '030033 00028764'.
325800         10  FILLER      PIC X(15) VALUE '030036 00121027'.
325900         10  FILLER      PIC X(15) VALUE '030037 00206829'.
326000         10  FILLER      PIC X(15) VALUE '030038 00096476'.
326100         10  FILLER      PIC X(15) VALUE '030043 00060425'.
326200         10  FILLER      PIC X(15) VALUE '030055 00073829'.
326300         10  FILLER      PIC X(15) VALUE '030062 00111345'.
326400         10  FILLER      PIC X(15) VALUE '030064 00274545'.
326500         10  FILLER      PIC X(15) VALUE '030065 00276630'.
326600         10  FILLER      PIC X(15) VALUE '030067 00022474'.
326700         10  FILLER      PIC X(15) VALUE '030068 00106482'.
326800         10  FILLER      PIC X(15) VALUE '030069 00033440'.
326900         10  FILLER      PIC X(15) VALUE '030071 00411225'.
327000         10  FILLER      PIC X(15) VALUE '030073 00225022'.
327100         10  FILLER      PIC X(15) VALUE '030074 00017192'.
327200         10  FILLER      PIC X(15) VALUE '030077 00206937'.
327300         10  FILLER      PIC X(15) VALUE '030078 00759502'.
327400         10  FILLER      PIC X(15) VALUE '030083 00188121'.
327500         10  FILLER      PIC X(15) VALUE '030084 00253734'.
327600         10  FILLER      PIC X(15) VALUE '030085 00075081'.
327700         10  FILLER      PIC X(15) VALUE '030088 00044075'.
327800         10  FILLER      PIC X(15) VALUE '030089 00206251'.
327900         10  FILLER      PIC X(15) VALUE '030092 00099443'.
328000         10  FILLER      PIC X(15) VALUE '030093 00043556'.
328100         10  FILLER      PIC X(15) VALUE '030094 00207101'.
328200         10  FILLER      PIC X(15) VALUE '030101 00040684'.
328300         10  FILLER      PIC X(15) VALUE '030110 00164786'.
328400         10  FILLER      PIC X(15) VALUE '030111 00315949'.
328500         10  FILLER      PIC X(15) VALUE '030113 00465546'.
328600         10  FILLER      PIC X(15) VALUE '030115 00241289'.
328700         10  FILLER      PIC X(15) VALUE '030117 00058998'.
328800         10  FILLER      PIC X(15) VALUE '030118 00100768'.
328900         10  FILLER      PIC X(15) VALUE '030119 00092427'.
329000         10  FILLER      PIC X(15) VALUE '030120 00056699'.
329100         10  FILLER      PIC X(15) VALUE '030121 00096794'.
329200         10  FILLER      PIC X(15) VALUE '030122 00148834'.
329300         10  FILLER      PIC X(15) VALUE '030126 00060485'.
329400         10  FILLER      PIC X(15) VALUE '030130 00202444'.
329500         10  FILLER      PIC X(15) VALUE '040001 00056803'.
329600         10  FILLER      PIC X(15) VALUE '040002 00089595'.
329700         10  FILLER      PIC X(15) VALUE '040004 00044972'.
329800         10  FILLER      PIC X(15) VALUE '040007 00081542'.
329900         10  FILLER      PIC X(15) VALUE '040010 00041295'.
330000         10  FILLER      PIC X(15) VALUE '040011 00021560'.
330100         10  FILLER      PIC X(15) VALUE '040014 00052447'.
330200         10  FILLER      PIC X(15) VALUE '040015 00071822'.
330300         10  FILLER      PIC X(15) VALUE '040016 00232923'.
330400         10  FILLER      PIC X(15) VALUE '040017 00050517'.
330500         10  FILLER      PIC X(15) VALUE '040018 00044817'.
330600         10  FILLER      PIC X(15) VALUE '040019 00161712'.
330700         10  FILLER      PIC X(15) VALUE '040020 00067389'.
330800         10  FILLER      PIC X(15) VALUE '040022 00092737'.
330900         10  FILLER      PIC X(15) VALUE '040026 00037171'.
331000         10  FILLER      PIC X(15) VALUE '040027 00026934'.
331100         10  FILLER      PIC X(15) VALUE '040029 00049840'.
331200         10  FILLER      PIC X(15) VALUE '040036 00035105'.
331300         10  FILLER      PIC X(15) VALUE '040039 00061820'.
331400         10  FILLER      PIC X(15) VALUE '040041 00057110'.
331500         10  FILLER      PIC X(15) VALUE '040042 00105086'.
331600         10  FILLER      PIC X(15) VALUE '040047 00025157'.
331700         10  FILLER      PIC X(15) VALUE '040050 00055161'.
331800         10  FILLER      PIC X(15) VALUE '040051 00040588'.
331900         10  FILLER      PIC X(15) VALUE '040055 00082156'.
332000         10  FILLER      PIC X(15) VALUE '040062 00076625'.
332100         10  FILLER      PIC X(15) VALUE '040067 00052029'.
332200         10  FILLER      PIC X(15) VALUE '040069 00180172'.
332300         10  FILLER      PIC X(15) VALUE '040071 00079716'.
332400         10  FILLER      PIC X(15) VALUE '040072 00050703'.
332500         10  FILLER      PIC X(15) VALUE '040074 00023926'.
332600         10  FILLER      PIC X(15) VALUE '040078 00059077'.
332700         10  FILLER      PIC X(15) VALUE '040080 00049221'.
332800         10  FILLER      PIC X(15) VALUE '040084 00039800'.
332900         10  FILLER      PIC X(15) VALUE '040085 00074960'.
333000         10  FILLER      PIC X(15) VALUE '040088 00042263'.
333100         10  FILLER      PIC X(15) VALUE '040114 00079337'.
333200         10  FILLER      PIC X(15) VALUE '040118 00033689'.
333300         10  FILLER      PIC X(15) VALUE '040119 00086992'.
333400         10  FILLER      PIC X(15) VALUE '050002 00221537'.
333500         10  FILLER      PIC X(15) VALUE '050006 00080251'.
333600         10  FILLER      PIC X(15) VALUE '050008 00066000'.
333700         10  FILLER      PIC X(15) VALUE '050009 00056272'.
333800         10  FILLER      PIC X(15) VALUE '050013 00084379'.
333900         10  FILLER      PIC X(15) VALUE '050014 00040648'.
334000         10  FILLER      PIC X(15) VALUE '050017 00132797'.
334100         10  FILLER      PIC X(15) VALUE '050018 00403952'.
334200         10  FILLER      PIC X(15) VALUE '050022 00243618'.
334300         10  FILLER      PIC X(15) VALUE '050024 00162102'.
334400         10  FILLER      PIC X(15) VALUE '050025 00209499'.
334500         10  FILLER      PIC X(15) VALUE '050026 00116288'.
334600         10  FILLER      PIC X(15) VALUE '050028 00107308'.
334700         10  FILLER      PIC X(15) VALUE '050030 00072715'.
334800         10  FILLER      PIC X(15) VALUE '050036 00247924'.
334900         10  FILLER      PIC X(15) VALUE '050038 00610504'.
335000         10  FILLER      PIC X(15) VALUE '050039 00050579'.
335100         10  FILLER      PIC X(15) VALUE '050040 01528082'.
335200         10  FILLER      PIC X(15) VALUE '050042 00068430'.
335300         10  FILLER      PIC X(15) VALUE '050043 00106488'.
335400         10  FILLER      PIC X(15) VALUE '050045 00114699'.
335500         10  FILLER      PIC X(15) VALUE '050047 00091884'.
335600         10  FILLER      PIC X(15) VALUE '050054 00119790'.
335700         10  FILLER      PIC X(15) VALUE '050055 00212471'.
335800         10  FILLER      PIC X(15) VALUE '050056 00251994'.
335900         10  FILLER      PIC X(15) VALUE '050057 00134221'.
336000         10  FILLER      PIC X(15) VALUE '050058 00218524'.
336100         10  FILLER      PIC X(15) VALUE '050060 00316571'.
336200         10  FILLER      PIC X(15) VALUE '050063 00389393'.
336300         10  FILLER      PIC X(15) VALUE '050067 00111746'.
336400         10  FILLER      PIC X(15) VALUE '050069 00111642'.
336500         10  FILLER      PIC X(15) VALUE '050077 00171104'.
336600         10  FILLER      PIC X(15) VALUE '050078 00091286'.
336700         10  FILLER      PIC X(15) VALUE '050079 00089254'.
336800         10  FILLER      PIC X(15) VALUE '050082 00135796'.
336900         10  FILLER      PIC X(15) VALUE '050084 00130983'.
337000         10  FILLER      PIC X(15) VALUE '050089 00628847'.
337100         10  FILLER      PIC X(15) VALUE '050090 00040058'.
337200         10  FILLER      PIC X(15) VALUE '050091 00184614'.
337300         10  FILLER      PIC X(15) VALUE '050093 00083189'.
337400         10  FILLER      PIC X(15) VALUE '050096 00026873'.
337500         10  FILLER      PIC X(15) VALUE '050099 00070658'.
337600         10  FILLER      PIC X(15) VALUE '050100 00211787'.
337700         10  FILLER      PIC X(15) VALUE '050101 00149859'.
337800         10  FILLER      PIC X(15) VALUE '050102 00316977'.
337900         10  FILLER      PIC X(15) VALUE '050103 00420596'.
338000         10  FILLER      PIC X(15) VALUE '050104 00659125'.
338100         10  FILLER      PIC X(15) VALUE '050107 00152728'.
338200         10  FILLER      PIC X(15) VALUE '050108 00224545'.
338300         10  FILLER      PIC X(15) VALUE '050110 00063454'.
338400         10  FILLER      PIC X(15) VALUE '050111 00140848'.
338500         10  FILLER      PIC X(15) VALUE '050112 00088185'.
338600         10  FILLER      PIC X(15) VALUE '050113 00363207'.
338700         10  FILLER      PIC X(15) VALUE '050115 00115495'.
338800         10  FILLER      PIC X(15) VALUE '050116 00159587'.
338900         10  FILLER      PIC X(15) VALUE '050118 00059228'.
339000         10  FILLER      PIC X(15) VALUE '050121 00108229'.
339100         10  FILLER      PIC X(15) VALUE '050122 00211247'.
339200         10  FILLER      PIC X(15) VALUE '050125 00152104'.
339300         10  FILLER      PIC X(15) VALUE '050126 00415787'.
339400         10  FILLER      PIC X(15) VALUE '050127 00096992'.
339500         10  FILLER      PIC X(15) VALUE '050128 00130083'.
339600         10  FILLER      PIC X(15) VALUE '050129 00219663'.
339700         10  FILLER      PIC X(15) VALUE '050132 00195731'.
339800         10  FILLER      PIC X(15) VALUE '050133 00094562'.
339900         10  FILLER      PIC X(15) VALUE '050135 00264648'.
340000         10  FILLER      PIC X(15) VALUE '050136 00039523'.
340100         10  FILLER      PIC X(15) VALUE '050149 00891160'.
340200         10  FILLER      PIC X(15) VALUE '050150 00034359'.
340300         10  FILLER      PIC X(15) VALUE '050152 00144134'.
340400         10  FILLER      PIC X(15) VALUE '050153 00127686'.
340500         10  FILLER      PIC X(15) VALUE '050158 00037580'.
340600         10  FILLER      PIC X(15) VALUE '050159 00503387'.
340700         10  FILLER      PIC X(15) VALUE '050167 00845159'.
340800         10  FILLER      PIC X(15) VALUE '050168 00052975'.
340900         10  FILLER      PIC X(15) VALUE '050169 00153159'.
341000         10  FILLER      PIC X(15) VALUE '050174 00060840'.
341100         10  FILLER      PIC X(15) VALUE '050179 00119927'.
341200         10  FILLER      PIC X(15) VALUE '050189 00336343'.
341300         10  FILLER      PIC X(15) VALUE '050191 00395890'.
341400         10  FILLER      PIC X(15) VALUE '050192 00361441'.
341500         10  FILLER      PIC X(15) VALUE '050194 00193261'.
341600         10  FILLER      PIC X(15) VALUE '050195 00103728'.
341700         10  FILLER      PIC X(15) VALUE '050196 00449101'.
341800         10  FILLER      PIC X(15) VALUE '050204 00093417'.
341900         10  FILLER      PIC X(15) VALUE '050205 00127337'.
342000         10  FILLER      PIC X(15) VALUE '050211 00050870'.
342100         10  FILLER      PIC X(15) VALUE '050222 00173270'.
342200         10  FILLER      PIC X(15) VALUE '050225 00061462'.
342300         10  FILLER      PIC X(15) VALUE '050226 00128170'.
342400         10  FILLER      PIC X(15) VALUE '050228 00502932'.
342500         10  FILLER      PIC X(15) VALUE '050230 00261295'.
342600         10  FILLER      PIC X(15) VALUE '050231 00557699'.
342700         10  FILLER      PIC X(15) VALUE '050232 00032741'.
342800         10  FILLER      PIC X(15) VALUE '050235 00102320'.
342900         10  FILLER      PIC X(15) VALUE '050236 00051944'.
343000         10  FILLER      PIC X(15) VALUE '050238 00094455'.
343100         10  FILLER      PIC X(15) VALUE '050239 00189819'.
343200         10  FILLER      PIC X(15) VALUE '050242 00067063'.
343300         10  FILLER      PIC X(15) VALUE '050243 00204632'.
343400         10  FILLER      PIC X(15) VALUE '050245 00751561'.
343500         10  FILLER      PIC X(15) VALUE '050248 00714660'.
343600         10  FILLER      PIC X(15) VALUE '050254 00049036'.
343700         10  FILLER      PIC X(15) VALUE '050257 00212588'.
343800         10  FILLER      PIC X(15) VALUE '050261 00152742'.
343900         10  FILLER      PIC X(15) VALUE '050262 00212066'.
344000         10  FILLER      PIC X(15) VALUE '050272 00163791'.
344100         10  FILLER      PIC X(15) VALUE '050276 00569177'.
344200         10  FILLER      PIC X(15) VALUE '050277 00327067'.
344300         10  FILLER      PIC X(15) VALUE '050278 00157141'.
344400         10  FILLER      PIC X(15) VALUE '050279 00122578'.
344500         10  FILLER      PIC X(15) VALUE '050280 00082755'.
344600         10  FILLER      PIC X(15) VALUE '050281 00146087'.
344700         10  FILLER      PIC X(15) VALUE '050283 00060483'.
344800         10  FILLER      PIC X(15) VALUE '050289 00104038'.
344900         10  FILLER      PIC X(15) VALUE '050291 00184035'.
345000         10  FILLER      PIC X(15) VALUE '050292 00800248'.
345100         10  FILLER      PIC X(15) VALUE '050295 00121467'.
345200         10  FILLER      PIC X(15) VALUE '050296 00067881'.
345300         10  FILLER      PIC X(15) VALUE '050298 00070505'.
345400         10  FILLER      PIC X(15) VALUE '050300 00138236'.
345500         10  FILLER      PIC X(15) VALUE '050301 00094810'.
345600         10  FILLER      PIC X(15) VALUE '050305 00319411'.
345700         10  FILLER      PIC X(15) VALUE '050309 00059171'.
345800         10  FILLER      PIC X(15) VALUE '050313 00064963'.
345900         10  FILLER      PIC X(15) VALUE '050315 01352872'.
346000         10  FILLER      PIC X(15) VALUE '050320 00591906'.
346100         10  FILLER      PIC X(15) VALUE '050327 00451585'.
346200         10  FILLER      PIC X(15) VALUE '050329 00156286'.
346300         10  FILLER      PIC X(15) VALUE '050334 00078651'.
346400         10  FILLER      PIC X(15) VALUE '050335 00043472'.
346500         10  FILLER      PIC X(15) VALUE '050336 00070015'.
346600         10  FILLER      PIC X(15) VALUE '050342 00146129'.
346700         10  FILLER      PIC X(15) VALUE '050348 00307340'.
346800         10  FILLER      PIC X(15) VALUE '050349 00116007'.
346900         10  FILLER      PIC X(15) VALUE '050350 00190575'.
347000         10  FILLER      PIC X(15) VALUE '050351 00068149'.
347100         10  FILLER      PIC X(15) VALUE '050352 00075198'.
347200         10  FILLER      PIC X(15) VALUE '050353 00089217'.
347300         10  FILLER      PIC X(15) VALUE '050359 00187635'.
347400         10  FILLER      PIC X(15) VALUE '050360 00052399'.
347500         10  FILLER      PIC X(15) VALUE '050367 00140630'.
347600         10  FILLER      PIC X(15) VALUE '050373 01954352'.
347700         10  FILLER      PIC X(15) VALUE '050376 01176256'.
347800         10  FILLER      PIC X(15) VALUE '050378 00347570'.
347900         10  FILLER      PIC X(15) VALUE '050380 00073421'.
348000         10  FILLER      PIC X(15) VALUE '050382 00281394'.
348100         10  FILLER      PIC X(15) VALUE '050385 00024493'.
348200         10  FILLER      PIC X(15) VALUE '050390 00090650'.
348300         10  FILLER      PIC X(15) VALUE '050393 00123957'.
348400         10  FILLER      PIC X(15) VALUE '050394 00079983'.
348500         10  FILLER      PIC X(15) VALUE '050396 00085035'.
348600         10  FILLER      PIC X(15) VALUE '050407 00158790'.
348700         10  FILLER      PIC X(15) VALUE '050417 00046254'.
348800         10  FILLER      PIC X(15) VALUE '050423 00093596'.
348900         10  FILLER      PIC X(15) VALUE '050426 00069070'.
349000         10  FILLER      PIC X(15) VALUE '050434 00097277'.
349100         10  FILLER      PIC X(15) VALUE '050435 00039234'.
349200         10  FILLER      PIC X(15) VALUE '050438 00098384'.
349300         10  FILLER      PIC X(15) VALUE '050441 00079640'.
349400         10  FILLER      PIC X(15) VALUE '050444 00143569'.
349500         10  FILLER      PIC X(15) VALUE '050454 00206380'.
349600         10  FILLER      PIC X(15) VALUE '050455 00138079'.
349700         10  FILLER      PIC X(15) VALUE '050457 00054375'.
349800         10  FILLER      PIC X(15) VALUE '050464 00299216'.
349900         10  FILLER      PIC X(15) VALUE '050468 00248159'.
350000         10  FILLER      PIC X(15) VALUE '050471 00210874'.
350100         10  FILLER      PIC X(15) VALUE '050481 00061050'.
350200         10  FILLER      PIC X(15) VALUE '050485 00136059'.
350300         10  FILLER      PIC X(15) VALUE '050488 00097892'.
350400         10  FILLER      PIC X(15) VALUE '050492 00154418'.
350500         10  FILLER      PIC X(15) VALUE '050496 00054058'.
350600         10  FILLER      PIC X(15) VALUE '050498 00034309'.
350700         10  FILLER      PIC X(15) VALUE '050502 00106180'.
350800         10  FILLER      PIC X(15) VALUE '050506 00138833'.
350900         10  FILLER      PIC X(15) VALUE '050516 00151624'.
351000         10  FILLER      PIC X(15) VALUE '050517 00386449'.
351100         10  FILLER      PIC X(15) VALUE '050523 00097952'.
351200         10  FILLER      PIC X(15) VALUE '050526 00070044'.
351300         10  FILLER      PIC X(15) VALUE '050528 00192485'.
351400         10  FILLER      PIC X(15) VALUE '050531 00493291'.
351500         10  FILLER      PIC X(15) VALUE '050534 00250689'.
351600         10  FILLER      PIC X(15) VALUE '050537 00122863'.
351700         10  FILLER      PIC X(15) VALUE '050543 02247785'.
351800         10  FILLER      PIC X(15) VALUE '050545 00000000'.
351900         10  FILLER      PIC X(15) VALUE '050546 00004945'.
352000         10  FILLER      PIC X(15) VALUE '050547 00003305'.
352100         10  FILLER      PIC X(15) VALUE '050548 00000000'.
352200         10  FILLER      PIC X(15) VALUE '050551 00057366'.
352300         10  FILLER      PIC X(15) VALUE '050557 00102414'.
352400         10  FILLER      PIC X(15) VALUE '050567 00053535'.
352500         10  FILLER      PIC X(15) VALUE '050568 00221507'.
352600         10  FILLER      PIC X(15) VALUE '050570 00275034'.
352700         10  FILLER      PIC X(15) VALUE '050575 00096981'.
352800         10  FILLER      PIC X(15) VALUE '050580 00092106'.
352900         10  FILLER      PIC X(15) VALUE '050581 00127694'.
353000         10  FILLER      PIC X(15) VALUE '050586 00092742'.
353100         10  FILLER      PIC X(15) VALUE '050588 00043480'.
353200         10  FILLER      PIC X(15) VALUE '050589 00032835'.
353300         10  FILLER      PIC X(15) VALUE '050590 00195985'.
353400         10  FILLER      PIC X(15) VALUE '050597 00102571'.
353500         10  FILLER      PIC X(15) VALUE '050599 00254871'.
353600         10  FILLER      PIC X(15) VALUE '050608 00251855'.
353700         10  FILLER      PIC X(15) VALUE '050618 00027759'.
353800         10  FILLER      PIC X(15) VALUE '050624 00076190'.
353900         10  FILLER      PIC X(15) VALUE '050625 00077677'.
354000         10  FILLER      PIC X(15) VALUE '050633 00051045'.
354100         10  FILLER      PIC X(15) VALUE '050636 00055470'.
354200         10  FILLER      PIC X(15) VALUE '050641 00500383'.
354300         10  FILLER      PIC X(15) VALUE '050644 00362155'.
354400         10  FILLER      PIC X(15) VALUE '050663 00269388'.
354500         10  FILLER      PIC X(15) VALUE '050668 00185022'.
354600         10  FILLER      PIC X(15) VALUE '050678 00132429'.
354700         10  FILLER      PIC X(15) VALUE '050684 00043877'.
354800         10  FILLER      PIC X(15) VALUE '050688 00082783'.
354900         10  FILLER      PIC X(15) VALUE '050696 00121613'.
355000         10  FILLER      PIC X(15) VALUE '050701 00121646'.
355100         10  FILLER      PIC X(15) VALUE '050704 00191037'.
355200         10  FILLER      PIC X(15) VALUE '050709 00061044'.
355300         10  FILLER      PIC X(15) VALUE '050714 00244223'.
355400         10  FILLER      PIC X(15) VALUE '050717 02506499'.
355500         10  FILLER      PIC X(15) VALUE '050724 00036244'.
355600         10  FILLER      PIC X(15) VALUE '050727 00051975'.
355700         10  FILLER      PIC X(15) VALUE '050735 00255388'.
355800         10  FILLER      PIC X(15) VALUE '050736 00387472'.
355900         10  FILLER      PIC X(15) VALUE '050737 00271308'.
356000         10  FILLER      PIC X(15) VALUE '050738 00396622'.
356100         10  FILLER      PIC X(15) VALUE '050739 00122452'.
356200         10  FILLER      PIC X(15) VALUE '050742 00062891'.
356300         10  FILLER      PIC X(15) VALUE '050744 00928218'.
356400         10  FILLER      PIC X(15) VALUE '050745 00068244'.
356500         10  FILLER      PIC X(15) VALUE '050746 00451735'.
356600         10  FILLER      PIC X(15) VALUE '050747 00568692'.
356700         10  FILLER      PIC X(15) VALUE '050751 00012981'.
356800         10  FILLER      PIC X(15) VALUE '050755 00063965'.
356900         10  FILLER      PIC X(15) VALUE '050757 00063148'.
357000         10  FILLER      PIC X(15) VALUE '050758 00297960'.
357100         10  FILLER      PIC X(15) VALUE '050761 00068758'.
357200         10  FILLER      PIC X(15) VALUE '050763 00452225'.
357300         10  FILLER      PIC X(15) VALUE '050764 00045217'.
357400         10  FILLER      PIC X(15) VALUE '050765 00127169'.
357500         10  FILLER      PIC X(15) VALUE '050770 00020026'.
357600         10  FILLER      PIC X(15) VALUE '050771 00092705'.
357700         10  FILLER      PIC X(15) VALUE '060001 00061724'.
357800         10  FILLER      PIC X(15) VALUE '060003 00056305'.
357900         10  FILLER      PIC X(15) VALUE '060004 00123613'.
358000         10  FILLER      PIC X(15) VALUE '060006 00037228'.
358100         10  FILLER      PIC X(15) VALUE '060008 00064976'.
358200         10  FILLER      PIC X(15) VALUE '060009 00073077'.
358300         10  FILLER      PIC X(15) VALUE '060010 00047896'.
358400         10  FILLER      PIC X(15) VALUE '060011 00687900'.
358500         10  FILLER      PIC X(15) VALUE '060012 00081922'.
358600         10  FILLER      PIC X(15) VALUE '060013 00049841'.
358700         10  FILLER      PIC X(15) VALUE '060014 00316279'.
358800         10  FILLER      PIC X(15) VALUE '060015 00065911'.
358900         10  FILLER      PIC X(15) VALUE '060016 00036571'.
359000         10  FILLER      PIC X(15) VALUE '060020 00082150'.
359100         10  FILLER      PIC X(15) VALUE '060022 00128516'.
359200         10  FILLER      PIC X(15) VALUE '060023 00064470'.
359300         10  FILLER      PIC X(15) VALUE '060024 00147679'.
359400         10  FILLER      PIC X(15) VALUE '060030 00046683'.
359500         10  FILLER      PIC X(15) VALUE '060031 00049630'.
359600         10  FILLER      PIC X(15) VALUE '060032 00113501'.
359700         10  FILLER      PIC X(15) VALUE '060034 00064075'.
359800         10  FILLER      PIC X(15) VALUE '060036 00054459'.
359900         10  FILLER      PIC X(15) VALUE '060044 00042070'.
360000         10  FILLER      PIC X(15) VALUE '060065 00156529'.
360100         10  FILLER      PIC X(15) VALUE '060075 00134102'.
360200         10  FILLER      PIC X(15) VALUE '060096 00090487'.
360300         10  FILLER      PIC X(15) VALUE '060100 00080643'.
360400         10  FILLER      PIC X(15) VALUE '060103 00246851'.
360500         10  FILLER      PIC X(15) VALUE '060104 00080853'.
360600         10  FILLER      PIC X(15) VALUE '060107 00000000'.
360700         10  FILLER      PIC X(15) VALUE '060118 00104245'.
360800         10  FILLER      PIC X(15) VALUE '070002 00086047'.
360900         10  FILLER      PIC X(15) VALUE '070003 00040348'.
361000         10  FILLER      PIC X(15) VALUE '070004 00025405'.
361100         10  FILLER      PIC X(15) VALUE '070005 00074545'.
361200         10  FILLER      PIC X(15) VALUE '070006 00086789'.
361300         10  FILLER      PIC X(15) VALUE '070007 00067498'.
361400         10  FILLER      PIC X(15) VALUE '070008 00036479'.
361500         10  FILLER      PIC X(15) VALUE '070010 00176801'.
361600         10  FILLER      PIC X(15) VALUE '070011 00031855'.
361700         10  FILLER      PIC X(15) VALUE '070016 00073666'.
361800         10  FILLER      PIC X(15) VALUE '070017 00053709'.
361900         10  FILLER      PIC X(15) VALUE '070020 00034406'.
362000         10  FILLER      PIC X(15) VALUE '070021 00095173'.
362100         10  FILLER      PIC X(15) VALUE '070022 00171637'.
362200         10  FILLER      PIC X(15) VALUE '070024 00051775'.
362300         10  FILLER      PIC X(15) VALUE '070025 00094631'.
362400         10  FILLER      PIC X(15) VALUE '070028 00075269'.
362500         10  FILLER      PIC X(15) VALUE '070029 00048438'.
362600         10  FILLER      PIC X(15) VALUE '070031 00046778'.
362700         10  FILLER      PIC X(15) VALUE '070033 00040372'.
362800         10  FILLER      PIC X(15) VALUE '070034 00064326'.
362900         10  FILLER      PIC X(15) VALUE '070035 00070409'.
363000         10  FILLER      PIC X(15) VALUE '070036 00093459'.
363100         10  FILLER      PIC X(15) VALUE '070038 16746970'.
363200         10  FILLER      PIC X(15) VALUE '080001 00071722'.
363300         10  FILLER      PIC X(15) VALUE '080003 00082797'.
363400         10  FILLER      PIC X(15) VALUE '080004 00062422'.
363500         10  FILLER      PIC X(15) VALUE '080006 00061397'.
363600         10  FILLER      PIC X(15) VALUE '080009 00069802'.
363700         10  FILLER      PIC X(15) VALUE '090001 00149930'.
363800         10  FILLER      PIC X(15) VALUE '090003 00295070'.
363900         10  FILLER      PIC X(15) VALUE '090004 00133007'.
364000         10  FILLER      PIC X(15) VALUE '090006 00158016'.
364100         10  FILLER      PIC X(15) VALUE '090008 00243222'.
364200         10  FILLER      PIC X(15) VALUE '090011 00128048'.
364300         10  FILLER      PIC X(15) VALUE '100001 00285271'.
364400         10  FILLER      PIC X(15) VALUE '100002 00124260'.
364500         10  FILLER      PIC X(15) VALUE '100006 00249805'.
364600         10  FILLER      PIC X(15) VALUE '100007 00091699'.
364700         10  FILLER      PIC X(15) VALUE '100008 00186583'.
364800         10  FILLER      PIC X(15) VALUE '100009 00166774'.
364900         10  FILLER      PIC X(15) VALUE '100012 00115514'.
365000         10  FILLER      PIC X(15) VALUE '100017 00116514'.
365100         10  FILLER      PIC X(15) VALUE '100018 00044563'.
365200         10  FILLER      PIC X(15) VALUE '100022 00694039'.
365300         10  FILLER      PIC X(15) VALUE '100025 00151498'.
365400         10  FILLER      PIC X(15) VALUE '100026 00052122'.
365500         10  FILLER      PIC X(15) VALUE '100028 00048664'.
365600         10  FILLER      PIC X(15) VALUE '100029 00210210'.
365700         10  FILLER      PIC X(15) VALUE '100030 00111925'.
365800         10  FILLER      PIC X(15) VALUE '100032 00195056'.
365900         10  FILLER      PIC X(15) VALUE '100034 00149504'.
366000         10  FILLER      PIC X(15) VALUE '100035 00105011'.
366100         10  FILLER      PIC X(15) VALUE '100038 00269230'.
366200         10  FILLER      PIC X(15) VALUE '100039 00469444'.
366300         10  FILLER      PIC X(15) VALUE '100040 00045375'.
366400         10  FILLER      PIC X(15) VALUE '100045 00071019'.
366500         10  FILLER      PIC X(15) VALUE '100046 00045109'.
366600         10  FILLER      PIC X(15) VALUE '100048 00052716'.
366700         10  FILLER      PIC X(15) VALUE '100049 00043923'.
366800         10  FILLER      PIC X(15) VALUE '100050 00126025'.
366900         10  FILLER      PIC X(15) VALUE '100051 00054422'.
367000         10  FILLER      PIC X(15) VALUE '100052 00076088'.
367100         10  FILLER      PIC X(15) VALUE '100053 00272860'.
367200         10  FILLER      PIC X(15) VALUE '100055 00054728'.
367300         10  FILLER      PIC X(15) VALUE '100057 00038478'.
367400         10  FILLER      PIC X(15) VALUE '100062 00051419'.
367500         10  FILLER      PIC X(15) VALUE '100063 00103358'.
367600         10  FILLER      PIC X(15) VALUE '100067 00081606'.
367700         10  FILLER      PIC X(15) VALUE '100068 00050809'.
367800         10  FILLER      PIC X(15) VALUE '100069 00061635'.
367900         10  FILLER      PIC X(15) VALUE '100071 00102220'.
368000         10  FILLER      PIC X(15) VALUE '100072 00043802'.
368100         10  FILLER      PIC X(15) VALUE '100075 00229129'.
368200         10  FILLER      PIC X(15) VALUE '100076 00160048'.
368300         10  FILLER      PIC X(15) VALUE '100077 00064181'.
368400         10  FILLER      PIC X(15) VALUE '100080 00070733'.
368500         10  FILLER      PIC X(15) VALUE '100081 00041646'.
368600         10  FILLER      PIC X(15) VALUE '100084 00044288'.
368700         10  FILLER      PIC X(15) VALUE '100086 00124791'.
368800         10  FILLER      PIC X(15) VALUE '100087 00060491'.
368900         10  FILLER      PIC X(15) VALUE '100088 00131116'.
369000         10  FILLER      PIC X(15) VALUE '100090 00037312'.
369100         10  FILLER      PIC X(15) VALUE '100092 00058915'.
369200         10  FILLER      PIC X(15) VALUE '100093 00090616'.
369300         10  FILLER      PIC X(15) VALUE '100099 00041860'.
369400         10  FILLER      PIC X(15) VALUE '100102 00106324'.
369500         10  FILLER      PIC X(15) VALUE '100105 00039237'.
369600         10  FILLER      PIC X(15) VALUE '100106 00050942'.
369700         10  FILLER      PIC X(15) VALUE '100107 00052863'.
369800         10  FILLER      PIC X(15) VALUE '100109 00042662'.
369900         10  FILLER      PIC X(15) VALUE '100110 00121353'.
370000         10  FILLER      PIC X(15) VALUE '100113 00197166'.
370100         10  FILLER      PIC X(15) VALUE '100121 00064084'.
370200         10  FILLER      PIC X(15) VALUE '100122 00039679'.
370300         10  FILLER      PIC X(15) VALUE '100124 00063165'.
370400         10  FILLER      PIC X(15) VALUE '100125 00276189'.
370500         10  FILLER      PIC X(15) VALUE '100127 00064544'.
370600         10  FILLER      PIC X(15) VALUE '100128 00241101'.
370700         10  FILLER      PIC X(15) VALUE '100130 00177874'.
370800         10  FILLER      PIC X(15) VALUE '100131 00077784'.
370900         10  FILLER      PIC X(15) VALUE '100132 00091907'.
371000         10  FILLER      PIC X(15) VALUE '100135 00154605'.
371100         10  FILLER      PIC X(15) VALUE '100137 00078940'.
371200         10  FILLER      PIC X(15) VALUE '100139 00079705'.
371300         10  FILLER      PIC X(15) VALUE '100140 00047607'.
371400         10  FILLER      PIC X(15) VALUE '100142 00057250'.
371500         10  FILLER      PIC X(15) VALUE '100150 00085415'.
371600         10  FILLER      PIC X(15) VALUE '100154 00203127'.
371700         10  FILLER      PIC X(15) VALUE '100157 00087283'.
371800         10  FILLER      PIC X(15) VALUE '100161 00062159'.
371900         10  FILLER      PIC X(15) VALUE '100167 00233465'.
372000         10  FILLER      PIC X(15) VALUE '100173 00091701'.
372100         10  FILLER      PIC X(15) VALUE '100175 00085595'.
372200         10  FILLER      PIC X(15) VALUE '100179 00084991'.
372300         10  FILLER      PIC X(15) VALUE '100180 00095381'.
372400         10  FILLER      PIC X(15) VALUE '100181 00124382'.
372500         10  FILLER      PIC X(15) VALUE '100183 00144016'.
372600         10  FILLER      PIC X(15) VALUE '100187 00273284'.
372700         10  FILLER      PIC X(15) VALUE '100189 00083563'.
372800         10  FILLER      PIC X(15) VALUE '100191 00046546'.
372900         10  FILLER      PIC X(15) VALUE '100200 00085611'.
373000         10  FILLER      PIC X(15) VALUE '100204 00042992'.
373100         10  FILLER      PIC X(15) VALUE '100209 00237315'.
373200         10  FILLER      PIC X(15) VALUE '100211 00058658'.
373300         10  FILLER      PIC X(15) VALUE '100212 00027996'.
373400         10  FILLER      PIC X(15) VALUE '100220 00054889'.
373500         10  FILLER      PIC X(15) VALUE '100223 00055110'.
373600         10  FILLER      PIC X(15) VALUE '100226 00071360'.
373700         10  FILLER      PIC X(15) VALUE '100230 00125076'.
373800         10  FILLER      PIC X(15) VALUE '100231 00036278'.
373900         10  FILLER      PIC X(15) VALUE '100232 00052881'.
374000         10  FILLER      PIC X(15) VALUE '100234 00141345'.
374100         10  FILLER      PIC X(15) VALUE '100238 00056135'.
374200         10  FILLER      PIC X(15) VALUE '100239 00041563'.
374300         10  FILLER      PIC X(15) VALUE '100242 00102838'.
374400         10  FILLER      PIC X(15) VALUE '100243 00118559'.
374500         10  FILLER      PIC X(15) VALUE '100244 00047947'.
374600         10  FILLER      PIC X(15) VALUE '100246 00114081'.
374700         10  FILLER      PIC X(15) VALUE '100249 00025180'.
374800         10  FILLER      PIC X(15) VALUE '100252 00011630'.
374900         10  FILLER      PIC X(15) VALUE '100254 00100378'.
375000         10  FILLER      PIC X(15) VALUE '100255 00082736'.
375100         10  FILLER      PIC X(15) VALUE '100260 00039838'.
375200         10  FILLER      PIC X(15) VALUE '100265 00058283'.
375300         10  FILLER      PIC X(15) VALUE '100268 00141658'.
375400         10  FILLER      PIC X(15) VALUE '100269 00220252'.
375500         10  FILLER      PIC X(15) VALUE '100275 00143599'.
375600         10  FILLER      PIC X(15) VALUE '100276 00223183'.
375700         10  FILLER      PIC X(15) VALUE '100281 00170514'.
375800         10  FILLER      PIC X(15) VALUE '100284 00170444'.
375900         10  FILLER      PIC X(15) VALUE '100285 00324352'.
376000         10  FILLER      PIC X(15) VALUE '100286 00034833'.
376100         10  FILLER      PIC X(15) VALUE '100287 00068064'.
376200         10  FILLER      PIC X(15) VALUE '100288 00982605'.
376300         10  FILLER      PIC X(15) VALUE '100291 00063125'.
376400         10  FILLER      PIC X(15) VALUE '100292 00042010'.
376500         10  FILLER      PIC X(15) VALUE '100296 00110496'.
376600         10  FILLER      PIC X(15) VALUE '100302 00041644'.
376700         10  FILLER      PIC X(15) VALUE '100307 00061040'.
376800         10  FILLER      PIC X(15) VALUE '100313 00038137'.
376900         10  FILLER      PIC X(15) VALUE '100314 00067522'.
377000         10  FILLER      PIC X(15) VALUE '110001 00086427'.
377100         10  FILLER      PIC X(15) VALUE '110002 00090858'.
377200         10  FILLER      PIC X(15) VALUE '110003 00061581'.
377300         10  FILLER      PIC X(15) VALUE '110004 00105895'.
377400         10  FILLER      PIC X(15) VALUE '110005 00064536'.
377500         10  FILLER      PIC X(15) VALUE '110006 00080116'.
377600         10  FILLER      PIC X(15) VALUE '110007 00179752'.
377700         10  FILLER      PIC X(15) VALUE '110008 00076727'.
377800         10  FILLER      PIC X(15) VALUE '110010 00076706'.
377900         10  FILLER      PIC X(15) VALUE '110011 00060750'.
378000         10  FILLER      PIC X(15) VALUE '110015 00093579'.
378100         10  FILLER      PIC X(15) VALUE '110016 00074634'.
378200         10  FILLER      PIC X(15) VALUE '110018 00058909'.
378300         10  FILLER      PIC X(15) VALUE '110023 00069555'.
378400         10  FILLER      PIC X(15) VALUE '110024 00133017'.
378500         10  FILLER      PIC X(15) VALUE '110025 00083492'.
378600         10  FILLER      PIC X(15) VALUE '110026 00025630'.
378700         10  FILLER      PIC X(15) VALUE '110027 00087552'.
378800         10  FILLER      PIC X(15) VALUE '110028 00087859'.
378900         10  FILLER      PIC X(15) VALUE '110029 00079158'.
379000         10  FILLER      PIC X(15) VALUE '110030 00070222'.
379100         10  FILLER      PIC X(15) VALUE '110031 00077065'.
379200         10  FILLER      PIC X(15) VALUE '110032 00073597'.
379300         10  FILLER      PIC X(15) VALUE '110034 00257365'.
379400         10  FILLER      PIC X(15) VALUE '110035 00077121'.
379500         10  FILLER      PIC X(15) VALUE '110036 00151418'.
379600         10  FILLER      PIC X(15) VALUE '110038 00096251'.
379700         10  FILLER      PIC X(15) VALUE '110039 00060214'.
379800         10  FILLER      PIC X(15) VALUE '110041 00057712'.
379900         10  FILLER      PIC X(15) VALUE '110042 00028837'.
380000         10  FILLER      PIC X(15) VALUE '110043 00037214'.
380100         10  FILLER      PIC X(15) VALUE '110044 00059727'.
380200         10  FILLER      PIC X(15) VALUE '110045 00049989'.
380300         10  FILLER      PIC X(15) VALUE '110046 00052369'.
380400         10  FILLER      PIC X(15) VALUE '110050 00027606'.
380500         10  FILLER      PIC X(15) VALUE '110051 00058319'.
380600         10  FILLER      PIC X(15) VALUE '110054 00126608'.
380700         10  FILLER      PIC X(15) VALUE '110064 00349954'.
380800         10  FILLER      PIC X(15) VALUE '110069 00084791'.
380900         10  FILLER      PIC X(15) VALUE '110071 00100099'.
381000         10  FILLER      PIC X(15) VALUE '110073 00052922'.
381100         10  FILLER      PIC X(15) VALUE '110074 00082044'.
381200         10  FILLER      PIC X(15) VALUE '110075 00094064'.
381300         10  FILLER      PIC X(15) VALUE '110076 00191384'.
381400         10  FILLER      PIC X(15) VALUE '110078 00175745'.
381500         10  FILLER      PIC X(15) VALUE '110079 00413722'.
381600         10  FILLER      PIC X(15) VALUE '110086 00091273'.
381700         10  FILLER      PIC X(15) VALUE '110087 00135996'.
381800         10  FILLER      PIC X(15) VALUE '110089 00070147'.
381900         10  FILLER      PIC X(15) VALUE '110091 00140243'.
382000         10  FILLER      PIC X(15) VALUE '110092 00064704'.
382100         10  FILLER      PIC X(15) VALUE '110095 00088865'.
382200         10  FILLER      PIC X(15) VALUE '110100 00026571'.
382300         10  FILLER      PIC X(15) VALUE '110101 00076355'.
382400         10  FILLER      PIC X(15) VALUE '110104 00096224'.
382500         10  FILLER      PIC X(15) VALUE '110105 00100127'.
382600         10  FILLER      PIC X(15) VALUE '110107 00141610'.
382700         10  FILLER      PIC X(15) VALUE '110109 00050408'.
382800         10  FILLER      PIC X(15) VALUE '110111 00034405'.
382900         10  FILLER      PIC X(15) VALUE '110112 00047701'.
383000         10  FILLER      PIC X(15) VALUE '110113 00106229'.
383100         10  FILLER      PIC X(15) VALUE '110115 00407583'.
383200         10  FILLER      PIC X(15) VALUE '110121 00085338'.
383300         10  FILLER      PIC X(15) VALUE '110122 00073891'.
383400         10  FILLER      PIC X(15) VALUE '110124 00072275'.
383500         10  FILLER      PIC X(15) VALUE '110125 00114587'.
383600         10  FILLER      PIC X(15) VALUE '110128 00097062'.
383700         10  FILLER      PIC X(15) VALUE '110129 00050993'.
383800         10  FILLER      PIC X(15) VALUE '110130 00269220'.
383900         10  FILLER      PIC X(15) VALUE '110132 00087471'.
384000         10  FILLER      PIC X(15) VALUE '110135 00076086'.
384100         10  FILLER      PIC X(15) VALUE '110142 00026353'.
384200         10  FILLER      PIC X(15) VALUE '110143 00127114'.
384300         10  FILLER      PIC X(15) VALUE '110146 00117984'.
384400         10  FILLER      PIC X(15) VALUE '110150 00093180'.
384500         10  FILLER      PIC X(15) VALUE '110161 00455200'.
384600         10  FILLER      PIC X(15) VALUE '110164 00082112'.
384700         10  FILLER      PIC X(15) VALUE '110165 00194373'.
384800         10  FILLER      PIC X(15) VALUE '110177 00131524'.
384900         10  FILLER      PIC X(15) VALUE '110183 00043795'.
385000         10  FILLER      PIC X(15) VALUE '110184 00061399'.
385100         10  FILLER      PIC X(15) VALUE '110186 00154096'.
385200         10  FILLER      PIC X(15) VALUE '110187 00037404'.
385300         10  FILLER      PIC X(15) VALUE '110189 00046564'.
385400         10  FILLER      PIC X(15) VALUE '110190 00052360'.
385500         10  FILLER      PIC X(15) VALUE '110191 00087436'.
385600         10  FILLER      PIC X(15) VALUE '110192 00074329'.
385700         10  FILLER      PIC X(15) VALUE '110194 00124106'.
385800         10  FILLER      PIC X(15) VALUE '110198 00096064'.
385900         10  FILLER      PIC X(15) VALUE '110201 00033195'.
386000         10  FILLER      PIC X(15) VALUE '110205 00030904'.
386100         10  FILLER      PIC X(15) VALUE '110209 00026870'.
386200         10  FILLER      PIC X(15) VALUE '110215 00063080'.
386300         10  FILLER      PIC X(15) VALUE '110225 00046605'.
386400         10  FILLER      PIC X(15) VALUE '110226 00095992'.
386500         10  FILLER      PIC X(15) VALUE '110229 00062300'.
386600         10  FILLER      PIC X(15) VALUE '110230 00066646'.
386700         10  FILLER      PIC X(15) VALUE '120001 00201396'.
386800         10  FILLER      PIC X(15) VALUE '120002 00184166'.
386900         10  FILLER      PIC X(15) VALUE '120004 00082650'.
387000         10  FILLER      PIC X(15) VALUE '120005 00164264'.
387100         10  FILLER      PIC X(15) VALUE '120006 00157005'.
387200         10  FILLER      PIC X(15) VALUE '120014 00128256'.
387300         10  FILLER      PIC X(15) VALUE '120019 00183558'.
387400         10  FILLER      PIC X(15) VALUE '120022 00087161'.
387500         10  FILLER      PIC X(15) VALUE '120026 00097984'.
387600         10  FILLER      PIC X(15) VALUE '120028 00173198'.
387700         10  FILLER      PIC X(15) VALUE '130002 00113259'.
387800         10  FILLER      PIC X(15) VALUE '130003 00052898'.
387900         10  FILLER      PIC X(15) VALUE '130006 00273967'.
388000         10  FILLER      PIC X(15) VALUE '130007 00082075'.
388100         10  FILLER      PIC X(15) VALUE '130013 00099786'.
388200         10  FILLER      PIC X(15) VALUE '130014 00105984'.
388300         10  FILLER      PIC X(15) VALUE '130018 00110048'.
388400         10  FILLER      PIC X(15) VALUE '130025 00188298'.
388500         10  FILLER      PIC X(15) VALUE '130028 00064852'.
388600         10  FILLER      PIC X(15) VALUE '130049 00069785'.
388700         10  FILLER      PIC X(15) VALUE '130065 00192541'.
388800         10  FILLER      PIC X(15) VALUE '130067 00000000'.
388900         10  FILLER      PIC X(15) VALUE '140001 00050556'.
389000         10  FILLER      PIC X(15) VALUE '140002 00039062'.
389100         10  FILLER      PIC X(15) VALUE '140007 00042621'.
389200         10  FILLER      PIC X(15) VALUE '140008 00047946'.
389300         10  FILLER      PIC X(15) VALUE '140011 00027524'.
389400         10  FILLER      PIC X(15) VALUE '140012 00034919'.
389500         10  FILLER      PIC X(15) VALUE '140015 00055510'.
389600         10  FILLER      PIC X(15) VALUE '140018 00466593'.
389700         10  FILLER      PIC X(15) VALUE '140019 00019929'.
389800         10  FILLER      PIC X(15) VALUE '140026 00023050'.
389900         10  FILLER      PIC X(15) VALUE '140029 00093608'.
390000         10  FILLER      PIC X(15) VALUE '140030 00058281'.
390100         10  FILLER      PIC X(15) VALUE '140032 00026630'.
390200         10  FILLER      PIC X(15) VALUE '140034 00038540'.
390300         10  FILLER      PIC X(15) VALUE '140040 00042470'.
390400         10  FILLER      PIC X(15) VALUE '140043 00028682'.
390500         10  FILLER      PIC X(15) VALUE '140046 00034949'.
390600         10  FILLER      PIC X(15) VALUE '140048 00120713'.
390700         10  FILLER      PIC X(15) VALUE '140049 00145155'.
390800         10  FILLER      PIC X(15) VALUE '140051 00044819'.
390900         10  FILLER      PIC X(15) VALUE '140052 00036446'.
391000         10  FILLER      PIC X(15) VALUE '140053 00084686'.
391100         10  FILLER      PIC X(15) VALUE '140054 00118839'.
391200         10  FILLER      PIC X(15) VALUE '140059 00019144'.
391300         10  FILLER      PIC X(15) VALUE '140063 00039443'.
391400         10  FILLER      PIC X(15) VALUE '140067 00113495'.
391500         10  FILLER      PIC X(15) VALUE '140068 00272761'.
391600         10  FILLER      PIC X(15) VALUE '140077 00268030'.
391700         10  FILLER      PIC X(15) VALUE '140080 00082801'.
391800         10  FILLER      PIC X(15) VALUE '140082 00072295'.
391900         10  FILLER      PIC X(15) VALUE '140083 00244636'.
392000         10  FILLER      PIC X(15) VALUE '140084 00073336'.
392100         10  FILLER      PIC X(15) VALUE '140088 00214070'.
392200         10  FILLER      PIC X(15) VALUE '140089 00026251'.
392300         10  FILLER      PIC X(15) VALUE '140091 00098477'.
392400         10  FILLER      PIC X(15) VALUE '140093 00046575'.
392500         10  FILLER      PIC X(15) VALUE '140095 00287034'.
392600         10  FILLER      PIC X(15) VALUE '140103 00288091'.
392700         10  FILLER      PIC X(15) VALUE '140110 00047934'.
392800         10  FILLER      PIC X(15) VALUE '140113 00052842'.
392900         10  FILLER      PIC X(15) VALUE '140114 00099608'.
393000         10  FILLER      PIC X(15) VALUE '140115 00188596'.
393100         10  FILLER      PIC X(15) VALUE '140118 00089811'.
393200         10  FILLER      PIC X(15) VALUE '140119 00139429'.
393300         10  FILLER      PIC X(15) VALUE '140120 00041780'.
393400         10  FILLER      PIC X(15) VALUE '140122 00045495'.
393500         10  FILLER      PIC X(15) VALUE '140124 00566708'.
393600         10  FILLER      PIC X(15) VALUE '140125 00168376'.
393700         10  FILLER      PIC X(15) VALUE '140127 00051811'.
393800         10  FILLER      PIC X(15) VALUE '140133 00110339'.
393900         10  FILLER      PIC X(15) VALUE '140135 00037950'.
394000         10  FILLER      PIC X(15) VALUE '140137 00065235'.
394100         10  FILLER      PIC X(15) VALUE '140145 00039181'.
394200         10  FILLER      PIC X(15) VALUE '140147 00045943'.
394300         10  FILLER      PIC X(15) VALUE '140148 00036098'.
394400         10  FILLER      PIC X(15) VALUE '140150 00303664'.
394500         10  FILLER      PIC X(15) VALUE '140155 00058493'.
394600         10  FILLER      PIC X(15) VALUE '140158 00129577'.
394700         10  FILLER      PIC X(15) VALUE '140160 00042340'.
394800         10  FILLER      PIC X(15) VALUE '140161 00044766'.
394900         10  FILLER      PIC X(15) VALUE '140162 00032098'.
395000         10  FILLER      PIC X(15) VALUE '140164 00070329'.
395100         10  FILLER      PIC X(15) VALUE '140166 00085786'.
395200         10  FILLER      PIC X(15) VALUE '140167 00028377'.
395300         10  FILLER      PIC X(15) VALUE '140172 00059029'.
395400         10  FILLER      PIC X(15) VALUE '140174 00091048'.
395500         10  FILLER      PIC X(15) VALUE '140176 00040495'.
395600         10  FILLER      PIC X(15) VALUE '140177 00223875'.
395700         10  FILLER      PIC X(15) VALUE '140179 00045006'.
395800         10  FILLER      PIC X(15) VALUE '140180 00283246'.
395900         10  FILLER      PIC X(15) VALUE '140181 00129647'.
396000         10  FILLER      PIC X(15) VALUE '140182 00149771'.
396100         10  FILLER      PIC X(15) VALUE '140184 00059762'.
396200         10  FILLER      PIC X(15) VALUE '140185 00055047'.
396300         10  FILLER      PIC X(15) VALUE '140186 00084526'.
396400         10  FILLER      PIC X(15) VALUE '140187 00062575'.
396500         10  FILLER      PIC X(15) VALUE '140189 00031834'.
396600         10  FILLER      PIC X(15) VALUE '140191 00087946'.
396700         10  FILLER      PIC X(15) VALUE '140197 00162530'.
396800         10  FILLER      PIC X(15) VALUE '140202 00055386'.
396900         10  FILLER      PIC X(15) VALUE '140206 00333417'.
397000         10  FILLER      PIC X(15) VALUE '140208 00100831'.
397100         10  FILLER      PIC X(15) VALUE '140209 00080936'.
397200         10  FILLER      PIC X(15) VALUE '140210 00134472'.
397300         10  FILLER      PIC X(15) VALUE '140213 00040114'.
397400         10  FILLER      PIC X(15) VALUE '140217 00036324'.
397500         10  FILLER      PIC X(15) VALUE '140223 00077629'.
397600         10  FILLER      PIC X(15) VALUE '140224 00074472'.
397700         10  FILLER      PIC X(15) VALUE '140228 00092198'.
397800         10  FILLER      PIC X(15) VALUE '140234 00028028'.
397900         10  FILLER      PIC X(15) VALUE '140239 00123739'.
398000         10  FILLER      PIC X(15) VALUE '140240 00130942'.
398100         10  FILLER      PIC X(15) VALUE '140242 00047756'.
398200         10  FILLER      PIC X(15) VALUE '140250 00046732'.
398300         10  FILLER      PIC X(15) VALUE '140251 00059186'.
398400         10  FILLER      PIC X(15) VALUE '140258 00041405'.
398500         10  FILLER      PIC X(15) VALUE '140275 00051081'.
398600         10  FILLER      PIC X(15) VALUE '140276 00093402'.
398700         10  FILLER      PIC X(15) VALUE '140280 00056520'.
398800         10  FILLER      PIC X(15) VALUE '140281 00091318'.
398900         10  FILLER      PIC X(15) VALUE '140286 00033273'.
399000         10  FILLER      PIC X(15) VALUE '140289 00058665'.
399100         10  FILLER      PIC X(15) VALUE '140290 00077235'.
399200         10  FILLER      PIC X(15) VALUE '140292 00169534'.
399300         10  FILLER      PIC X(15) VALUE '140294 00024285'.
399400         10  FILLER      PIC X(15) VALUE '140300 00162990'.
399500         10  FILLER      PIC X(15) VALUE '140304 00091227'.
399600         10  FILLER      PIC X(15) VALUE '150001 00055063'.
399700         10  FILLER      PIC X(15) VALUE '150002 00110544'.
399800         10  FILLER      PIC X(15) VALUE '150004 00057212'.
399900         10  FILLER      PIC X(15) VALUE '150005 00042788'.
400000         10  FILLER      PIC X(15) VALUE '150006 00043935'.
400100         10  FILLER      PIC X(15) VALUE '150007 00045575'.
400200         10  FILLER      PIC X(15) VALUE '150008 00085126'.
400300         10  FILLER      PIC X(15) VALUE '150009 00062613'.
400400         10  FILLER      PIC X(15) VALUE '150010 00064715'.
400500         10  FILLER      PIC X(15) VALUE '150011 00056550'.
400600         10  FILLER      PIC X(15) VALUE '150012 00045268'.
400700         10  FILLER      PIC X(15) VALUE '150015 00045575'.
400800         10  FILLER      PIC X(15) VALUE '150017 00070475'.
400900         10  FILLER      PIC X(15) VALUE '150018 00058822'.
401000         10  FILLER      PIC X(15) VALUE '150021 00118725'.
401100         10  FILLER      PIC X(15) VALUE '150023 00054243'.
401200         10  FILLER      PIC X(15) VALUE '150024 00335567'.
401300         10  FILLER      PIC X(15) VALUE '150026 00048237'.
401400         10  FILLER      PIC X(15) VALUE '150030 00037783'.
401500         10  FILLER      PIC X(15) VALUE '150034 00033510'.
401600         10  FILLER      PIC X(15) VALUE '150035 00046207'.
401700         10  FILLER      PIC X(15) VALUE '150037 00029150'.
401800         10  FILLER      PIC X(15) VALUE '150038 00051608'.
401900         10  FILLER      PIC X(15) VALUE '150042 00025896'.
402000         10  FILLER      PIC X(15) VALUE '150044 00035988'.
402100         10  FILLER      PIC X(15) VALUE '150045 00080062'.
402200         10  FILLER      PIC X(15) VALUE '150046 00049343'.
402300         10  FILLER      PIC X(15) VALUE '150047 00159886'.
402400         10  FILLER      PIC X(15) VALUE '150048 00036308'.
402500         10  FILLER      PIC X(15) VALUE '150051 00064134'.
402600         10  FILLER      PIC X(15) VALUE '150056 00223165'.
402700         10  FILLER      PIC X(15) VALUE '150058 00115623'.
402800         10  FILLER      PIC X(15) VALUE '150059 00044670'.
402900         10  FILLER      PIC X(15) VALUE '150061 00041369'.
403000         10  FILLER      PIC X(15) VALUE '150064 00046421'.
403100         10  FILLER      PIC X(15) VALUE '150065 00062550'.
403200         10  FILLER      PIC X(15) VALUE '150069 00036430'.
403300         10  FILLER      PIC X(15) VALUE '150072 00061328'.
403400         10  FILLER      PIC X(15) VALUE '150074 00112653'.
403500         10  FILLER      PIC X(15) VALUE '150075 00037118'.
403600         10  FILLER      PIC X(15) VALUE '150076 00050753'.
403700         10  FILLER      PIC X(15) VALUE '150082 00051267'.
403800         10  FILLER      PIC X(15) VALUE '150084 00123351'.
403900         10  FILLER      PIC X(15) VALUE '150086 00047724'.
404000         10  FILLER      PIC X(15) VALUE '150088 00055077'.
404100         10  FILLER      PIC X(15) VALUE '150089 00066474'.
404200         10  FILLER      PIC X(15) VALUE '150091 00083746'.
404300         10  FILLER      PIC X(15) VALUE '150097 00040295'.
404400         10  FILLER      PIC X(15) VALUE '150100 00067451'.
404500         10  FILLER      PIC X(15) VALUE '150101 00057914'.
404600         10  FILLER      PIC X(15) VALUE '150102 00027127'.
404700         10  FILLER      PIC X(15) VALUE '150104 00054818'.
404800         10  FILLER      PIC X(15) VALUE '150109 00081905'.
404900         10  FILLER      PIC X(15) VALUE '150112 00054577'.
405000         10  FILLER      PIC X(15) VALUE '150113 00049578'.
405100         10  FILLER      PIC X(15) VALUE '150115 00029004'.
405200         10  FILLER      PIC X(15) VALUE '150125 00042879'.
405300         10  FILLER      PIC X(15) VALUE '150128 00037636'.
405400         10  FILLER      PIC X(15) VALUE '150133 00046031'.
405500         10  FILLER      PIC X(15) VALUE '150146 00059358'.
405600         10  FILLER      PIC X(15) VALUE '150149 05996347'.
405700         10  FILLER      PIC X(15) VALUE '150150 00213561'.
405800         10  FILLER      PIC X(15) VALUE '150157 00065853'.
405900         10  FILLER      PIC X(15) VALUE '150158 00050188'.
406000         10  FILLER      PIC X(15) VALUE '150161 00083716'.
406100         10  FILLER      PIC X(15) VALUE '150162 00064630'.
406200         10  FILLER      PIC X(15) VALUE '150163 00022320'.
406300         10  FILLER      PIC X(15) VALUE '150169 00099269'.
406400         10  FILLER      PIC X(15) VALUE '150173 00044047'.
406500         10  FILLER      PIC X(15) VALUE '160001 00036973'.
406600         10  FILLER      PIC X(15) VALUE '160008 00037152'.
406700         10  FILLER      PIC X(15) VALUE '160013 00048554'.
406800         10  FILLER      PIC X(15) VALUE '160016 00034802'.
406900         10  FILLER      PIC X(15) VALUE '160024 00075621'.
407000         10  FILLER      PIC X(15) VALUE '160028 00091414'.
407100         10  FILLER      PIC X(15) VALUE '160033 00047745'.
407200         10  FILLER      PIC X(15) VALUE '160045 00093909'.
407300         10  FILLER      PIC X(15) VALUE '160047 00048879'.
407400         10  FILLER      PIC X(15) VALUE '160057 00042504'.
407500         10  FILLER      PIC X(15) VALUE '160058 00243179'.
407600         10  FILLER      PIC X(15) VALUE '160064 00040429'.
407700         10  FILLER      PIC X(15) VALUE '160067 00117585'.
407800         10  FILLER      PIC X(15) VALUE '160080 00033132'.
407900         10  FILLER      PIC X(15) VALUE '160082 00085444'.
408000         10  FILLER      PIC X(15) VALUE '160083 00089870'.
408100         10  FILLER      PIC X(15) VALUE '160089 00047479'.
408200         10  FILLER      PIC X(15) VALUE '160101 00865583'.
408300         10  FILLER      PIC X(15) VALUE '160104 00041947'.
408400         10  FILLER      PIC X(15) VALUE '160110 00049847'.
408500         10  FILLER      PIC X(15) VALUE '160117 00029144'.
408600         10  FILLER      PIC X(15) VALUE '160122 00038530'.
408700         10  FILLER      PIC X(15) VALUE '160146 00137035'.
408800         10  FILLER      PIC X(15) VALUE '160153 00037108'.
408900         10  FILLER      PIC X(15) VALUE '170001 00041026'.
409000         10  FILLER      PIC X(15) VALUE '170006 00050766'.
409100         10  FILLER      PIC X(15) VALUE '170009 00035000'.
409200         10  FILLER      PIC X(15) VALUE '170012 00041584'.
409300         10  FILLER      PIC X(15) VALUE '170014 00037829'.
409400         10  FILLER      PIC X(15) VALUE '170016 00040669'.
409500         10  FILLER      PIC X(15) VALUE '170017 00043629'.
409600         10  FILLER      PIC X(15) VALUE '170023 00079300'.
409700         10  FILLER      PIC X(15) VALUE '170039 00031205'.
409800         10  FILLER      PIC X(15) VALUE '170040 00117747'.
409900         10  FILLER      PIC X(15) VALUE '170068 00086311'.
410000         10  FILLER      PIC X(15) VALUE '170086 00078650'.
410100         10  FILLER      PIC X(15) VALUE '170094 00022285'.
410200         10  FILLER      PIC X(15) VALUE '170103 00032146'.
410300         10  FILLER      PIC X(15) VALUE '170104 00048363'.
410400         10  FILLER      PIC X(15) VALUE '170120 00041054'.
410500         10  FILLER      PIC X(15) VALUE '170122 00077980'.
410600         10  FILLER      PIC X(15) VALUE '170123 00175872'.
410700         10  FILLER      PIC X(15) VALUE '170133 00078892'.
410800         10  FILLER      PIC X(15) VALUE '170137 00033111'.
410900         10  FILLER      PIC X(15) VALUE '170142 00030328'.
411000         10  FILLER      PIC X(15) VALUE '170145 00026293'.
411100         10  FILLER      PIC X(15) VALUE '170146 00057535'.
411200         10  FILLER      PIC X(15) VALUE '170150 00033195'.
411300         10  FILLER      PIC X(15) VALUE '170175 00056002'.
411400         10  FILLER      PIC X(15) VALUE '170176 00189524'.
411500         10  FILLER      PIC X(15) VALUE '170194 00010624'.
411600         10  FILLER      PIC X(15) VALUE '180001 00046381'.
411700         10  FILLER      PIC X(15) VALUE '180002 00041242'.
411800         10  FILLER      PIC X(15) VALUE '180004 00095325'.
411900         10  FILLER      PIC X(15) VALUE '180005 00097624'.
412000         10  FILLER      PIC X(15) VALUE '180009 00068506'.
412100         10  FILLER      PIC X(15) VALUE '180010 00034716'.
412200         10  FILLER      PIC X(15) VALUE '180011 00086537'.
412300         10  FILLER      PIC X(15) VALUE '180012 00051770'.
412400         10  FILLER      PIC X(15) VALUE '180013 00078660'.
412500         10  FILLER      PIC X(15) VALUE '180016 00023423'.
412600         10  FILLER      PIC X(15) VALUE '180017 00070499'.
412700         10  FILLER      PIC X(15) VALUE '180018 00071348'.
412800         10  FILLER      PIC X(15) VALUE '180019 00056650'.
412900         10  FILLER      PIC X(15) VALUE '180020 00045197'.
413000         10  FILLER      PIC X(15) VALUE '180021 00057377'.
413100         10  FILLER      PIC X(15) VALUE '180024 00077534'.
413200         10  FILLER      PIC X(15) VALUE '180025 00033196'.
413300         10  FILLER      PIC X(15) VALUE '180027 00055086'.
413400         10  FILLER      PIC X(15) VALUE '180029 00088875'.
413500         10  FILLER      PIC X(15) VALUE '180035 00063342'.
413600         10  FILLER      PIC X(15) VALUE '180036 00050014'.
413700         10  FILLER      PIC X(15) VALUE '180038 00056782'.
413800         10  FILLER      PIC X(15) VALUE '180040 00151344'.
413900         10  FILLER      PIC X(15) VALUE '180043 00130167'.
414000         10  FILLER      PIC X(15) VALUE '180044 00069746'.
414100         10  FILLER      PIC X(15) VALUE '180045 00068889'.
414200         10  FILLER      PIC X(15) VALUE '180046 00106186'.
414300         10  FILLER      PIC X(15) VALUE '180048 00055153'.
414400         10  FILLER      PIC X(15) VALUE '180049 00107438'.
414500         10  FILLER      PIC X(15) VALUE '180050 00072603'.
414600         10  FILLER      PIC X(15) VALUE '180051 00071137'.
414700         10  FILLER      PIC X(15) VALUE '180053 00034077'.
414800         10  FILLER      PIC X(15) VALUE '180056 00086492'.
414900         10  FILLER      PIC X(15) VALUE '180064 00060397'.
415000         10  FILLER      PIC X(15) VALUE '180066 00029143'.
415100         10  FILLER      PIC X(15) VALUE '180067 00228968'.
415200         10  FILLER      PIC X(15) VALUE '180069 00072962'.
415300         10  FILLER      PIC X(15) VALUE '180070 00077996'.
415400         10  FILLER      PIC X(15) VALUE '180078 00104575'.
415500         10  FILLER      PIC X(15) VALUE '180079 00068129'.
415600         10  FILLER      PIC X(15) VALUE '180080 00111153'.
415700         10  FILLER      PIC X(15) VALUE '180087 00046537'.
415800         10  FILLER      PIC X(15) VALUE '180088 00168901'.
415900         10  FILLER      PIC X(15) VALUE '180092 00072491'.
416000         10  FILLER      PIC X(15) VALUE '180093 00048965'.
416100         10  FILLER      PIC X(15) VALUE '180095 00025935'.
416200         10  FILLER      PIC X(15) VALUE '180101 00050190'.
416300         10  FILLER      PIC X(15) VALUE '180103 00085721'.
416400         10  FILLER      PIC X(15) VALUE '180104 00044579'.
416500         10  FILLER      PIC X(15) VALUE '180105 00077232'.
416600         10  FILLER      PIC X(15) VALUE '180106 00053805'.
416700         10  FILLER      PIC X(15) VALUE '180115 00037017'.
416800         10  FILLER      PIC X(15) VALUE '180116 00048467'.
416900         10  FILLER      PIC X(15) VALUE '180117 00052583'.
417000         10  FILLER      PIC X(15) VALUE '180124 00029272'.
417100         10  FILLER      PIC X(15) VALUE '180127 00066742'.
417200         10  FILLER      PIC X(15) VALUE '180128 00089652'.
417300         10  FILLER      PIC X(15) VALUE '180132 00093594'.
417400         10  FILLER      PIC X(15) VALUE '180138 00066032'.
417500         10  FILLER      PIC X(15) VALUE '180139 00079544'.
417600         10  FILLER      PIC X(15) VALUE '180141 00255514'.
417700         10  FILLER      PIC X(15) VALUE '180143 00126723'.
417800         10  FILLER      PIC X(15) VALUE '180149 00044305'.
417900         10  FILLER      PIC X(15) VALUE '190001 00118399'.
418000         10  FILLER      PIC X(15) VALUE '190002 00093416'.
418100         10  FILLER      PIC X(15) VALUE '190003 00102201'.
418200         10  FILLER      PIC X(15) VALUE '190004 00049170'.
418300         10  FILLER      PIC X(15) VALUE '190005 00653617'.
418400         10  FILLER      PIC X(15) VALUE '190006 00381445'.
418500         10  FILLER      PIC X(15) VALUE '190007 00098262'.
418600         10  FILLER      PIC X(15) VALUE '190008 00113587'.
418700         10  FILLER      PIC X(15) VALUE '190009 00332182'.
418800         10  FILLER      PIC X(15) VALUE '190011 00583814'.
418900         10  FILLER      PIC X(15) VALUE '190013 00042937'.
419000         10  FILLER      PIC X(15) VALUE '190014 00093693'.
419100         10  FILLER      PIC X(15) VALUE '190015 00134943'.
419200         10  FILLER      PIC X(15) VALUE '190017 00109537'.
419300         10  FILLER      PIC X(15) VALUE '190019 00077929'.
419400         10  FILLER      PIC X(15) VALUE '190020 00078423'.
419500         10  FILLER      PIC X(15) VALUE '190025 00116108'.
419600         10  FILLER      PIC X(15) VALUE '190026 00165788'.
419700         10  FILLER      PIC X(15) VALUE '190027 00035342'.
419800         10  FILLER      PIC X(15) VALUE '190034 00062810'.
419900         10  FILLER      PIC X(15) VALUE '190036 00184171'.
420000         10  FILLER      PIC X(15) VALUE '190039 00153048'.
420100         10  FILLER      PIC X(15) VALUE '190040 00084550'.
420200         10  FILLER      PIC X(15) VALUE '190041 00127456'.
420300         10  FILLER      PIC X(15) VALUE '190044 00115679'.
420400         10  FILLER      PIC X(15) VALUE '190045 00081620'.
420500         10  FILLER      PIC X(15) VALUE '190046 00238133'.
420600         10  FILLER      PIC X(15) VALUE '190050 00119522'.
420700         10  FILLER      PIC X(15) VALUE '190053 00054230'.
420800         10  FILLER      PIC X(15) VALUE '190054 00062265'.
420900         10  FILLER      PIC X(15) VALUE '190060 00158755'.
421000         10  FILLER      PIC X(15) VALUE '190064 00108896'.
421100         10  FILLER      PIC X(15) VALUE '190065 00117375'.
421200         10  FILLER      PIC X(15) VALUE '190079 00081183'.
421300         10  FILLER      PIC X(15) VALUE '190081 00053978'.
421400         10  FILLER      PIC X(15) VALUE '190086 00091727'.
421500         10  FILLER      PIC X(15) VALUE '190088 00027699'.
421600         10  FILLER      PIC X(15) VALUE '190090 00061764'.
421700         10  FILLER      PIC X(15) VALUE '190098 00471133'.
421800         10  FILLER      PIC X(15) VALUE '190099 00045768'.
421900         10  FILLER      PIC X(15) VALUE '190102 00040572'.
422000         10  FILLER      PIC X(15) VALUE '190106 00059055'.
422100         10  FILLER      PIC X(15) VALUE '190111 00072197'.
422200         10  FILLER      PIC X(15) VALUE '190114 00090743'.
422300         10  FILLER      PIC X(15) VALUE '190116 00092609'.
422400         10  FILLER      PIC X(15) VALUE '190118 00042496'.
422500         10  FILLER      PIC X(15) VALUE '190122 00030091'.
422600         10  FILLER      PIC X(15) VALUE '190125 00116302'.
422700         10  FILLER      PIC X(15) VALUE '190128 03563955'.
422800         10  FILLER      PIC X(15) VALUE '190133 00019092'.
422900         10  FILLER      PIC X(15) VALUE '190140 00050549'.
423000         10  FILLER      PIC X(15) VALUE '190144 00111032'.
423100         10  FILLER      PIC X(15) VALUE '190145 00035540'.
423200         10  FILLER      PIC X(15) VALUE '190146 00061366'.
423300         10  FILLER      PIC X(15) VALUE '190151 00044580'.
423400         10  FILLER      PIC X(15) VALUE '190160 00070162'.
423500         10  FILLER      PIC X(15) VALUE '190161 00203919'.
423600         10  FILLER      PIC X(15) VALUE '190164 00051635'.
423700         10  FILLER      PIC X(15) VALUE '190167 00098935'.
423800         10  FILLER      PIC X(15) VALUE '190175 00108223'.
423900         10  FILLER      PIC X(15) VALUE '190176 00284600'.
424000         10  FILLER      PIC X(15) VALUE '190177 00099338'.
424100         10  FILLER      PIC X(15) VALUE '190183 00017008'.
424200         10  FILLER      PIC X(15) VALUE '190184 00046330'.
424300         10  FILLER      PIC X(15) VALUE '190190 00097610'.
424400         10  FILLER      PIC X(15) VALUE '190199 00084892'.
424500         10  FILLER      PIC X(15) VALUE '190201 00542826'.
424600         10  FILLER      PIC X(15) VALUE '190202 00161265'.
424700         10  FILLER      PIC X(15) VALUE '190204 00149696'.
424800         10  FILLER      PIC X(15) VALUE '190205 00371118'.
424900         10  FILLER      PIC X(15) VALUE '190208 00064672'.
425000         10  FILLER      PIC X(15) VALUE '190218 00039465'.
425100         10  FILLER      PIC X(15) VALUE '190236 00045278'.
425200         10  FILLER      PIC X(15) VALUE '190242 00059658'.
425300         10  FILLER      PIC X(15) VALUE '190261 00079303'.
425400         10  FILLER      PIC X(15) VALUE '190274 00225358'.
425500         10  FILLER      PIC X(15) VALUE '190297 00032895'.
425600         10  FILLER      PIC X(15) VALUE '190303 00010674'.
425700         10  FILLER      PIC X(15) VALUE '190304 00062081'.
425800         10  FILLER      PIC X(15) VALUE '190307 00017192'.
425900         10  FILLER      PIC X(15) VALUE '200001 00034735'.
426000         10  FILLER      PIC X(15) VALUE '200008 00067238'.
426100         10  FILLER      PIC X(15) VALUE '200009 00090077'.
426200         10  FILLER      PIC X(15) VALUE '200018 00051228'.
426300         10  FILLER      PIC X(15) VALUE '200019 00037542'.
426400         10  FILLER      PIC X(15) VALUE '200021 00051984'.
426500         10  FILLER      PIC X(15) VALUE '200024 00061672'.
426600         10  FILLER      PIC X(15) VALUE '200031 00040495'.
426700         10  FILLER      PIC X(15) VALUE '200033 00089820'.
426800         10  FILLER      PIC X(15) VALUE '200034 00117704'.
426900         10  FILLER      PIC X(15) VALUE '200037 00048949'.
427000         10  FILLER      PIC X(15) VALUE '200039 00074271'.
427100         10  FILLER      PIC X(15) VALUE '200040 00035340'.
427200         10  FILLER      PIC X(15) VALUE '200052 00086822'.
427300         10  FILLER      PIC X(15) VALUE '200063 00070844'.
427400         10  FILLER      PIC X(15) VALUE '220001 00095468'.
427500         10  FILLER      PIC X(15) VALUE '220002 00046629'.
427600         10  FILLER      PIC X(15) VALUE '220008 00043240'.
427700         10  FILLER      PIC X(15) VALUE '220010 00113877'.
427800         10  FILLER      PIC X(15) VALUE '220011 00156012'.
427900         10  FILLER      PIC X(15) VALUE '220015 00039322'.
428000         10  FILLER      PIC X(15) VALUE '220016 00095308'.
428100         10  FILLER      PIC X(15) VALUE '220017 00128926'.
428200         10  FILLER      PIC X(15) VALUE '220019 00063511'.
428300         10  FILLER      PIC X(15) VALUE '220020 00068680'.
428400         10  FILLER      PIC X(15) VALUE '220024 00077370'.
428500         10  FILLER      PIC X(15) VALUE '220029 00040399'.
428600         10  FILLER      PIC X(15) VALUE '220030 00025626'.
428700         10  FILLER      PIC X(15) VALUE '220031 00239680'.
428800         10  FILLER      PIC X(15) VALUE '220033 00073785'.
428900         10  FILLER      PIC X(15) VALUE '220035 00075611'.
429000         10  FILLER      PIC X(15) VALUE '220036 00086084'.
429100         10  FILLER      PIC X(15) VALUE '220046 00068845'.
429200         10  FILLER      PIC X(15) VALUE '220049 00023252'.
429300         10  FILLER      PIC X(15) VALUE '220050 00027770'.
429400         10  FILLER      PIC X(15) VALUE '220051 00035048'.
429500         10  FILLER      PIC X(15) VALUE '220052 00105507'.
429600         10  FILLER      PIC X(15) VALUE '220058 00029786'.
429700         10  FILLER      PIC X(15) VALUE '220060 00034646'.
429800         10  FILLER      PIC X(15) VALUE '220062 00111766'.
429900         10  FILLER      PIC X(15) VALUE '220063 00125700'.
430000         10  FILLER      PIC X(15) VALUE '220065 00028429'.
430100         10  FILLER      PIC X(15) VALUE '220066 00134505'.
430200         10  FILLER      PIC X(15) VALUE '220067 00041316'.
430300         10  FILLER      PIC X(15) VALUE '220070 00037674'.
430400         10  FILLER      PIC X(15) VALUE '220071 00080600'.
430500         10  FILLER      PIC X(15) VALUE '220073 00040298'.
430600         10  FILLER      PIC X(15) VALUE '220074 00077287'.
430700         10  FILLER      PIC X(15) VALUE '220077 00138185'.
430800         10  FILLER      PIC X(15) VALUE '220080 00079226'.
430900         10  FILLER      PIC X(15) VALUE '220082 00044597'.
431000         10  FILLER      PIC X(15) VALUE '220086 00092434'.
431100         10  FILLER      PIC X(15) VALUE '220090 00029582'.
431200         10  FILLER      PIC X(15) VALUE '220095 00094590'.
431300         10  FILLER      PIC X(15) VALUE '220100 00046338'.
431400         10  FILLER      PIC X(15) VALUE '220110 00085252'.
431500         10  FILLER      PIC X(15) VALUE '220111 00106532'.
431600         10  FILLER      PIC X(15) VALUE '220116 00141757'.
431700         10  FILLER      PIC X(15) VALUE '220119 00042145'.
431800         10  FILLER      PIC X(15) VALUE '220135 00030570'.
431900         10  FILLER      PIC X(15) VALUE '220163 00124514'.
432000         10  FILLER      PIC X(15) VALUE '220174 00029009'.
432100         10  FILLER      PIC X(15) VALUE '220175 00046387'.
432200         10  FILLER      PIC X(15) VALUE '220176 00081530'.
432300         10  FILLER      PIC X(15) VALUE '220177 00059466'.
432400         10  FILLER      PIC X(15) VALUE '230004 00028469'.
432500         10  FILLER      PIC X(15) VALUE '230005 00055101'.
432600         10  FILLER      PIC X(15) VALUE '230013 00053320'.
432700         10  FILLER      PIC X(15) VALUE '230015 00045470'.
432800         10  FILLER      PIC X(15) VALUE '230017 00126451'.
432900         10  FILLER      PIC X(15) VALUE '230019 00048431'.
433000         10  FILLER      PIC X(15) VALUE '230020 00091981'.
433100         10  FILLER      PIC X(15) VALUE '230021 00060539'.
433200         10  FILLER      PIC X(15) VALUE '230022 00031011'.
433300         10  FILLER      PIC X(15) VALUE '230024 00141727'.
433400         10  FILLER      PIC X(15) VALUE '230029 00063136'.
433500         10  FILLER      PIC X(15) VALUE '230030 00049124'.
433600         10  FILLER      PIC X(15) VALUE '230031 00027680'.
433700         10  FILLER      PIC X(15) VALUE '230035 00053867'.
433800         10  FILLER      PIC X(15) VALUE '230036 00036264'.
433900         10  FILLER      PIC X(15) VALUE '230037 00046524'.
434000         10  FILLER      PIC X(15) VALUE '230038 00149852'.
434100         10  FILLER      PIC X(15) VALUE '230040 00039923'.
434200         10  FILLER      PIC X(15) VALUE '230041 00034543'.
434300         10  FILLER      PIC X(15) VALUE '230046 00152055'.
434400         10  FILLER      PIC X(15) VALUE '230047 00040961'.
434500         10  FILLER      PIC X(15) VALUE '230053 00142238'.
434600         10  FILLER      PIC X(15) VALUE '230054 00060661'.
434700         10  FILLER      PIC X(15) VALUE '230055 00045923'.
434800         10  FILLER      PIC X(15) VALUE '230058 00033528'.
434900         10  FILLER      PIC X(15) VALUE '230059 00080311'.
435000         10  FILLER      PIC X(15) VALUE '230066 00137940'.
435100         10  FILLER      PIC X(15) VALUE '230070 00088996'.
435200         10  FILLER      PIC X(15) VALUE '230072 00084739'.
435300         10  FILLER      PIC X(15) VALUE '230075 00052348'.
435400         10  FILLER      PIC X(15) VALUE '230077 00043746'.
435500         10  FILLER      PIC X(15) VALUE '230078 00024880'.
435600         10  FILLER      PIC X(15) VALUE '230080 00050129'.
435700         10  FILLER      PIC X(15) VALUE '230081 00031507'.
435800         10  FILLER      PIC X(15) VALUE '230085 00103593'.
435900         10  FILLER      PIC X(15) VALUE '230089 00031055'.
436000         10  FILLER      PIC X(15) VALUE '230092 00064103'.
436100         10  FILLER      PIC X(15) VALUE '230093 00073182'.
436200         10  FILLER      PIC X(15) VALUE '230096 00050473'.
436300         10  FILLER      PIC X(15) VALUE '230097 00038305'.
436400         10  FILLER      PIC X(15) VALUE '230099 00045496'.
436500         10  FILLER      PIC X(15) VALUE '230100 00045610'.
436600         10  FILLER      PIC X(15) VALUE '230104 00208456'.
436700         10  FILLER      PIC X(15) VALUE '230106 00063887'.
436800         10  FILLER      PIC X(15) VALUE '230108 00044090'.
436900         10  FILLER      PIC X(15) VALUE '230110 00042239'.
437000         10  FILLER      PIC X(15) VALUE '230117 00044050'.
437100         10  FILLER      PIC X(15) VALUE '230118 00041308'.
437200         10  FILLER      PIC X(15) VALUE '230121 00050693'.
437300         10  FILLER      PIC X(15) VALUE '230130 00050874'.
437400         10  FILLER      PIC X(15) VALUE '230132 00283368'.
437500         10  FILLER      PIC X(15) VALUE '230133 00035081'.
437600         10  FILLER      PIC X(15) VALUE '230141 00032781'.
437700         10  FILLER      PIC X(15) VALUE '230142 00073086'.
437800         10  FILLER      PIC X(15) VALUE '230146 00046827'.
437900         10  FILLER      PIC X(15) VALUE '230151 00054721'.
438000         10  FILLER      PIC X(15) VALUE '230165 00116275'.
438100         10  FILLER      PIC X(15) VALUE '230167 00048694'.
438200         10  FILLER      PIC X(15) VALUE '230180 00021131'.
438300         10  FILLER      PIC X(15) VALUE '230193 00040295'.
438400         10  FILLER      PIC X(15) VALUE '230195 00045710'.
438500         10  FILLER      PIC X(15) VALUE '230197 00048827'.
438600         10  FILLER      PIC X(15) VALUE '230207 00080774'.
438700         10  FILLER      PIC X(15) VALUE '230208 00081070'.
438800         10  FILLER      PIC X(15) VALUE '230216 00044427'.
438900         10  FILLER      PIC X(15) VALUE '230217 00062720'.
439000         10  FILLER      PIC X(15) VALUE '230222 00028997'.
439100         10  FILLER      PIC X(15) VALUE '230227 00042260'.
439200         10  FILLER      PIC X(15) VALUE '230230 00108001'.
439300         10  FILLER      PIC X(15) VALUE '230236 00187662'.
439400         10  FILLER      PIC X(15) VALUE '230239 00043747'.
439500         10  FILLER      PIC X(15) VALUE '230241 00039855'.
439600         10  FILLER      PIC X(15) VALUE '230244 00053672'.
439700         10  FILLER      PIC X(15) VALUE '230264 00042892'.
439800         10  FILLER      PIC X(15) VALUE '230269 00032273'.
439900         10  FILLER      PIC X(15) VALUE '230270 00049930'.
440000         10  FILLER      PIC X(15) VALUE '230273 00185061'.
440100         10  FILLER      PIC X(15) VALUE '230275 00037957'.
440200         10  FILLER      PIC X(15) VALUE '230297 00161449'.
440300         10  FILLER      PIC X(15) VALUE '240001 00079378'.
440400         10  FILLER      PIC X(15) VALUE '240002 00076823'.
440500         10  FILLER      PIC X(15) VALUE '240004 00289330'.
440600         10  FILLER      PIC X(15) VALUE '240006 00170289'.
440700         10  FILLER      PIC X(15) VALUE '240010 00045434'.
440800         10  FILLER      PIC X(15) VALUE '240014 00042205'.
440900         10  FILLER      PIC X(15) VALUE '240018 00044923'.
441000         10  FILLER      PIC X(15) VALUE '240019 00215779'.
441100         10  FILLER      PIC X(15) VALUE '240020 00092631'.
441200         10  FILLER      PIC X(15) VALUE '240022 00097956'.
441300         10  FILLER      PIC X(15) VALUE '240030 00038855'.
441400         10  FILLER      PIC X(15) VALUE '240036 00063834'.
441500         10  FILLER      PIC X(15) VALUE '240038 00079292'.
441600         10  FILLER      PIC X(15) VALUE '240040 00081175'.
441700         10  FILLER      PIC X(15) VALUE '240043 00040610'.
441800         10  FILLER      PIC X(15) VALUE '240044 00045073'.
441900         10  FILLER      PIC X(15) VALUE '240047 00062610'.
442000         10  FILLER      PIC X(15) VALUE '240050 00044821'.
442100         10  FILLER      PIC X(15) VALUE '240052 00039475'.
442200         10  FILLER      PIC X(15) VALUE '240053 00035887'.
442300         10  FILLER      PIC X(15) VALUE '240057 00071601'.
442400         10  FILLER      PIC X(15) VALUE '240063 00106487'.
442500         10  FILLER      PIC X(15) VALUE '240064 00044054'.
442600         10  FILLER      PIC X(15) VALUE '240066 00025236'.
442700         10  FILLER      PIC X(15) VALUE '240069 00077990'.
442800         10  FILLER      PIC X(15) VALUE '240071 00061490'.
442900         10  FILLER      PIC X(15) VALUE '240075 00031610'.
443000         10  FILLER      PIC X(15) VALUE '240076 00050004'.
443100         10  FILLER      PIC X(15) VALUE '240080 00227323'.
443200         10  FILLER      PIC X(15) VALUE '240084 00057860'.
443300         10  FILLER      PIC X(15) VALUE '240088 00079232'.
443400         10  FILLER      PIC X(15) VALUE '240093 00053753'.
443500         10  FILLER      PIC X(15) VALUE '240100 00085760'.
443600         10  FILLER      PIC X(15) VALUE '240101 00078593'.
443700         10  FILLER      PIC X(15) VALUE '240104 00050573'.
443800         10  FILLER      PIC X(15) VALUE '240106 00139882'.
443900         10  FILLER      PIC X(15) VALUE '240115 00069300'.
444000         10  FILLER      PIC X(15) VALUE '240132 00075087'.
444100         10  FILLER      PIC X(15) VALUE '240141 00075549'.
444200         10  FILLER      PIC X(15) VALUE '240187 00037094'.
444300         10  FILLER      PIC X(15) VALUE '240196 00011538'.
444400         10  FILLER      PIC X(15) VALUE '240206 00249244'.
444500         10  FILLER      PIC X(15) VALUE '240207 00083816'.
444600         10  FILLER      PIC X(15) VALUE '240210 00065893'.
444700         10  FILLER      PIC X(15) VALUE '240214 00135650'.
444800         10  FILLER      PIC X(15) VALUE '250001 00432768'.
444900         10  FILLER      PIC X(15) VALUE '250002 00019727'.
445000         10  FILLER      PIC X(15) VALUE '250004 00067827'.
445100         10  FILLER      PIC X(15) VALUE '250006 00132266'.
445200         10  FILLER      PIC X(15) VALUE '250007 00113587'.
445300         10  FILLER      PIC X(15) VALUE '250009 00059854'.
445400         10  FILLER      PIC X(15) VALUE '250010 00028248'.
445500         10  FILLER      PIC X(15) VALUE '250012 00035992'.
445600         10  FILLER      PIC X(15) VALUE '250015 00084056'.
445700         10  FILLER      PIC X(15) VALUE '250017 00029409'.
445800         10  FILLER      PIC X(15) VALUE '250018 00018624'.
445900         10  FILLER      PIC X(15) VALUE '250019 00095045'.
446000         10  FILLER      PIC X(15) VALUE '250020 00047864'.
446100         10  FILLER      PIC X(15) VALUE '250025 00091136'.
446200         10  FILLER      PIC X(15) VALUE '250027 00022964'.
446300         10  FILLER      PIC X(15) VALUE '250031 00141173'.
446400         10  FILLER      PIC X(15) VALUE '250034 00065544'.
446500         10  FILLER      PIC X(15) VALUE '250036 00037557'.
446600         10  FILLER      PIC X(15) VALUE '250038 00127321'.
446700         10  FILLER      PIC X(15) VALUE '250040 00069305'.
446800         10  FILLER      PIC X(15) VALUE '250042 00131295'.
446900         10  FILLER      PIC X(15) VALUE '250043 00038559'.
447000         10  FILLER      PIC X(15) VALUE '250044 00025761'.
447100         10  FILLER      PIC X(15) VALUE '250048 00074723'.
447200         10  FILLER      PIC X(15) VALUE '250049 00046943'.
447300         10  FILLER      PIC X(15) VALUE '250050 00086777'.
447400         10  FILLER      PIC X(15) VALUE '250051 00049478'.
447500         10  FILLER      PIC X(15) VALUE '250057 00114290'.
447600         10  FILLER      PIC X(15) VALUE '250058 00099057'.
447700         10  FILLER      PIC X(15) VALUE '250059 00022256'.
447800         10  FILLER      PIC X(15) VALUE '250060 00103828'.
447900         10  FILLER      PIC X(15) VALUE '250061 00023258'.
448000         10  FILLER      PIC X(15) VALUE '250067 00109132'.
448100         10  FILLER      PIC X(15) VALUE '250069 00101455'.
448200         10  FILLER      PIC X(15) VALUE '250072 00159747'.
448300         10  FILLER      PIC X(15) VALUE '250077 00092747'.
448400         10  FILLER      PIC X(15) VALUE '250078 00095120'.
448500         10  FILLER      PIC X(15) VALUE '250079 00040246'.
448600         10  FILLER      PIC X(15) VALUE '250081 00163725'.
448700         10  FILLER      PIC X(15) VALUE '250082 00151998'.
448800         10  FILLER      PIC X(15) VALUE '250084 00084283'.
448900         10  FILLER      PIC X(15) VALUE '250093 00100674'.
449000         10  FILLER      PIC X(15) VALUE '250094 00073746'.
449100         10  FILLER      PIC X(15) VALUE '250095 00152792'.
449200         10  FILLER      PIC X(15) VALUE '250096 00058449'.
449300         10  FILLER      PIC X(15) VALUE '250097 00088712'.
449400         10  FILLER      PIC X(15) VALUE '250099 00125032'.
449500         10  FILLER      PIC X(15) VALUE '250100 00080024'.
449600         10  FILLER      PIC X(15) VALUE '250102 00053827'.
449700         10  FILLER      PIC X(15) VALUE '250104 00070492'.
449800         10  FILLER      PIC X(15) VALUE '250117 00064622'.
449900         10  FILLER      PIC X(15) VALUE '250122 00102178'.
450000         10  FILLER      PIC X(15) VALUE '250123 00073302'.
450100         10  FILLER      PIC X(15) VALUE '250124 00085840'.
450200         10  FILLER      PIC X(15) VALUE '250126 00051889'.
450300         10  FILLER      PIC X(15) VALUE '250127 00051824'.
450400         10  FILLER      PIC X(15) VALUE '250128 00150407'.
450500         10  FILLER      PIC X(15) VALUE '250134 00042987'.
450600         10  FILLER      PIC X(15) VALUE '250136 01451372'.
450700         10  FILLER      PIC X(15) VALUE '250138 00154405'.
450800         10  FILLER      PIC X(15) VALUE '250141 00079401'.
450900         10  FILLER      PIC X(15) VALUE '250151 00220310'.
451000         10  FILLER      PIC X(15) VALUE '250152 00037249'.
451100         10  FILLER      PIC X(15) VALUE '250162 00062923'.
451200         10  FILLER      PIC X(15) VALUE '260001 00032040'.
451300         10  FILLER      PIC X(15) VALUE '260005 00119215'.
451400         10  FILLER      PIC X(15) VALUE '260006 00048943'.
451500         10  FILLER      PIC X(15) VALUE '260009 00034278'.
451600         10  FILLER      PIC X(15) VALUE '260011 00041503'.
451700         10  FILLER      PIC X(15) VALUE '260015 00167124'.
451800         10  FILLER      PIC X(15) VALUE '260017 00057425'.
451900         10  FILLER      PIC X(15) VALUE '260020 00135327'.
452000         10  FILLER      PIC X(15) VALUE '260022 00060227'.
452100         10  FILLER      PIC X(15) VALUE '260023 00032588'.
452200         10  FILLER      PIC X(15) VALUE '260024 00055478'.
452300         10  FILLER      PIC X(15) VALUE '260025 00041886'.
452400         10  FILLER      PIC X(15) VALUE '260027 00133865'.
452500         10  FILLER      PIC X(15) VALUE '260032 00107133'.
452600         10  FILLER      PIC X(15) VALUE '260040 00120275'.
452700         10  FILLER      PIC X(15) VALUE '260048 00442844'.
452800         10  FILLER      PIC X(15) VALUE '260050 00040529'.
452900         10  FILLER      PIC X(15) VALUE '260052 00055283'.
453000         10  FILLER      PIC X(15) VALUE '260057 00034077'.
453100         10  FILLER      PIC X(15) VALUE '260059 00052113'.
453200         10  FILLER      PIC X(15) VALUE '260061 00089808'.
453300         10  FILLER      PIC X(15) VALUE '260062 00065244'.
453400         10  FILLER      PIC X(15) VALUE '260065 00098606'.
453500         10  FILLER      PIC X(15) VALUE '260070 00090925'.
453600         10  FILLER      PIC X(15) VALUE '260074 00030207'.
453700         10  FILLER      PIC X(15) VALUE '260078 00094191'.
453800         10  FILLER      PIC X(15) VALUE '260080 00021869'.
453900         10  FILLER      PIC X(15) VALUE '260085 00036478'.
454000         10  FILLER      PIC X(15) VALUE '260091 00332443'.
454100         10  FILLER      PIC X(15) VALUE '260094 00041027'.
454200         10  FILLER      PIC X(15) VALUE '260095 00061351'.
454300         10  FILLER      PIC X(15) VALUE '260097 00057827'.
454400         10  FILLER      PIC X(15) VALUE '260102 00448650'.
454500         10  FILLER      PIC X(15) VALUE '260104 00113364'.
454600         10  FILLER      PIC X(15) VALUE '260105 00113502'.
454700         10  FILLER      PIC X(15) VALUE '260110 00049385'.
454800         10  FILLER      PIC X(15) VALUE '260113 00085715'.
454900         10  FILLER      PIC X(15) VALUE '260116 00086922'.
455000         10  FILLER      PIC X(15) VALUE '260119 00108393'.
455100         10  FILLER      PIC X(15) VALUE '260137 00106925'.
455200         10  FILLER      PIC X(15) VALUE '260138 00083593'.
455300         10  FILLER      PIC X(15) VALUE '260141 00159337'.
455400         10  FILLER      PIC X(15) VALUE '260142 00049332'.
455500         10  FILLER      PIC X(15) VALUE '260147 00031582'.
455600         10  FILLER      PIC X(15) VALUE '260160 00022931'.
455700         10  FILLER      PIC X(15) VALUE '260163 00046803'.
455800         10  FILLER      PIC X(15) VALUE '260175 00061349'.
455900         10  FILLER      PIC X(15) VALUE '260180 00073203'.
456000         10  FILLER      PIC X(15) VALUE '260183 00071819'.
456100         10  FILLER      PIC X(15) VALUE '260186 00045652'.
456200         10  FILLER      PIC X(15) VALUE '260195 00062894'.
456300         10  FILLER      PIC X(15) VALUE '260200 00052854'.
456400         10  FILLER      PIC X(15) VALUE '260207 00047424'.
456500         10  FILLER      PIC X(15) VALUE '260209 00026150'.
456600         10  FILLER      PIC X(15) VALUE '260210 00194260'.
456700         10  FILLER      PIC X(15) VALUE '270003 00041853'.
456800         10  FILLER      PIC X(15) VALUE '270004 00069699'.
456900         10  FILLER      PIC X(15) VALUE '270012 00061328'.
457000         10  FILLER      PIC X(15) VALUE '270017 00049865'.
457100         10  FILLER      PIC X(15) VALUE '270023 00124341'.
457200         10  FILLER      PIC X(15) VALUE '270032 00083529'.
457300         10  FILLER      PIC X(15) VALUE '270049 00071090'.
457400         10  FILLER      PIC X(15) VALUE '270051 00068954'.
457500         10  FILLER      PIC X(15) VALUE '270074 00032327'.
457600         10  FILLER      PIC X(15) VALUE '270087 00008034'.
457700         10  FILLER      PIC X(15) VALUE '280003 00054899'.
457800         10  FILLER      PIC X(15) VALUE '280009 00054336'.
457900         10  FILLER      PIC X(15) VALUE '280013 00118576'.
458000         10  FILLER      PIC X(15) VALUE '280020 00055760'.
458100         10  FILLER      PIC X(15) VALUE '280023 00039719'.
458200         10  FILLER      PIC X(15) VALUE '280030 00138023'.
458300         10  FILLER      PIC X(15) VALUE '280032 00032069'.
458400         10  FILLER      PIC X(15) VALUE '280060 00116131'.
458500         10  FILLER      PIC X(15) VALUE '280061 00054418'.
458600         10  FILLER      PIC X(15) VALUE '280065 00029154'.
458700         10  FILLER      PIC X(15) VALUE '280077 00036054'.
458800         10  FILLER      PIC X(15) VALUE '280081 00141903'.
458900         10  FILLER      PIC X(15) VALUE '280119 00066443'.
459000         10  FILLER      PIC X(15) VALUE '280125 00039726'.
459100         10  FILLER      PIC X(15) VALUE '290001 00118352'.
459200         10  FILLER      PIC X(15) VALUE '290003 00205756'.
459300         10  FILLER      PIC X(15) VALUE '290005 00114272'.
459400         10  FILLER      PIC X(15) VALUE '290007 00452354'.
459500         10  FILLER      PIC X(15) VALUE '290008 00048143'.
459600         10  FILLER      PIC X(15) VALUE '290009 00059500'.
459700         10  FILLER      PIC X(15) VALUE '290012 00039814'.
459800         10  FILLER      PIC X(15) VALUE '290020 00026041'.
459900         10  FILLER      PIC X(15) VALUE '290021 00167430'.
460000         10  FILLER      PIC X(15) VALUE '290022 00058706'.
460100         10  FILLER      PIC X(15) VALUE '290039 00058469'.
460200         10  FILLER      PIC X(15) VALUE '290041 00098054'.
460300         10  FILLER      PIC X(15) VALUE '290046 00112514'.
460400         10  FILLER      PIC X(15) VALUE '290047 00076473'.
460500         10  FILLER      PIC X(15) VALUE '300003 00082666'.
460600         10  FILLER      PIC X(15) VALUE '300012 00064500'.
460700         10  FILLER      PIC X(15) VALUE '300014 00043427'.
460800         10  FILLER      PIC X(15) VALUE '300018 00032184'.
460900         10  FILLER      PIC X(15) VALUE '300019 00022719'.
461000         10  FILLER      PIC X(15) VALUE '300020 00065343'.
461100         10  FILLER      PIC X(15) VALUE '310001 00060870'.
461200         10  FILLER      PIC X(15) VALUE '310002 00282269'.
461300         10  FILLER      PIC X(15) VALUE '310003 00110122'.
461400         10  FILLER      PIC X(15) VALUE '310006 00071871'.
461500         10  FILLER      PIC X(15) VALUE '310009 00081676'.
461600         10  FILLER      PIC X(15) VALUE '310011 00030568'.
461700         10  FILLER      PIC X(15) VALUE '310014 00192159'.
461800         10  FILLER      PIC X(15) VALUE '310016 00148828'.
461900         10  FILLER      PIC X(15) VALUE '310019 00169170'.
462000         10  FILLER      PIC X(15) VALUE '310021 00057734'.
462100         10  FILLER      PIC X(15) VALUE '310025 00049609'.
462200         10  FILLER      PIC X(15) VALUE '310027 00146851'.
462300         10  FILLER      PIC X(15) VALUE '310029 00088607'.
462400         10  FILLER      PIC X(15) VALUE '310032 00085465'.
462500         10  FILLER      PIC X(15) VALUE '310038 00092808'.
462600         10  FILLER      PIC X(15) VALUE '310039 00073826'.
462700         10  FILLER      PIC X(15) VALUE '310040 00148016'.
462800         10  FILLER      PIC X(15) VALUE '310044 00149994'.
462900         10  FILLER      PIC X(15) VALUE '310045 00038299'.
463000         10  FILLER      PIC X(15) VALUE '310050 00037537'.
463100         10  FILLER      PIC X(15) VALUE '310057 00065523'.
463200         10  FILLER      PIC X(15) VALUE '310058 00812401'.
463300         10  FILLER      PIC X(15) VALUE '310064 00083326'.
463400         10  FILLER      PIC X(15) VALUE '310070 00128816'.
463500         10  FILLER      PIC X(15) VALUE '310073 00055631'.
463600         10  FILLER      PIC X(15) VALUE '310074 00207055'.
463700         10  FILLER      PIC X(15) VALUE '310075 00128768'.
463800         10  FILLER      PIC X(15) VALUE '310076 00079347'.
463900         10  FILLER      PIC X(15) VALUE '310081 00035594'.
464000         10  FILLER      PIC X(15) VALUE '310083 00115607'.
464100         10  FILLER      PIC X(15) VALUE '310084 00081409'.
464200         10  FILLER      PIC X(15) VALUE '310086 00051730'.
464300         10  FILLER      PIC X(15) VALUE '310091 00038972'.
464400         10  FILLER      PIC X(15) VALUE '310092 00075575'.
464500         10  FILLER      PIC X(15) VALUE '310096 00101175'.
464600         10  FILLER      PIC X(15) VALUE '310118 00122017'.
464700         10  FILLER      PIC X(15) VALUE '310119 00400186'.
464800         10  FILLER      PIC X(15) VALUE '320001 00496972'.
464900         10  FILLER      PIC X(15) VALUE '320002 00080811'.
465000         10  FILLER      PIC X(15) VALUE '320004 00042056'.
465100         10  FILLER      PIC X(15) VALUE '320005 00098401'.
465200         10  FILLER      PIC X(15) VALUE '320006 00074916'.
465300         10  FILLER      PIC X(15) VALUE '320009 00062595'.
465400         10  FILLER      PIC X(15) VALUE '320011 00116011'.
465500         10  FILLER      PIC X(15) VALUE '320016 00050845'.
465600         10  FILLER      PIC X(15) VALUE '320017 00736922'.
465700         10  FILLER      PIC X(15) VALUE '320018 00144582'.
465800         10  FILLER      PIC X(15) VALUE '320021 00172954'.
465900         10  FILLER      PIC X(15) VALUE '320022 00148775'.
466000         10  FILLER      PIC X(15) VALUE '320030 00021790'.
466100         10  FILLER      PIC X(15) VALUE '320038 00056392'.
466200         10  FILLER      PIC X(15) VALUE '320057 00229168'.
466300         10  FILLER      PIC X(15) VALUE '320058 00154028'.
466400         10  FILLER      PIC X(15) VALUE '320059 00279144'.
466500         10  FILLER      PIC X(15) VALUE '320060 00191191'.
466600         10  FILLER      PIC X(15) VALUE '320061 00203834'.
466700         10  FILLER      PIC X(15) VALUE '320062 00052087'.
466800         10  FILLER      PIC X(15) VALUE '320063 00049015'.
466900         10  FILLER      PIC X(15) VALUE '320065 00103124'.
467000         10  FILLER      PIC X(15) VALUE '320067 00026008'.
467100         10  FILLER      PIC X(15) VALUE '320070 00051671'.
467200         10  FILLER      PIC X(15) VALUE '320084 00026150'.
467300         10  FILLER      PIC X(15) VALUE '320085 00063140'.
467400         10  FILLER      PIC X(15) VALUE '320086 00057720'.
467500         10  FILLER      PIC X(15) VALUE '330004 00053812'.
467600         10  FILLER      PIC X(15) VALUE '330005 00181374'.
467700         10  FILLER      PIC X(15) VALUE '330006 00218627'.
467800         10  FILLER      PIC X(15) VALUE '330009 01008075'.
467900         10  FILLER      PIC X(15) VALUE '330011 00047913'.
468000         10  FILLER      PIC X(15) VALUE '330013 00185868'.
468100         10  FILLER      PIC X(15) VALUE '330014 00411674'.
468200         10  FILLER      PIC X(15) VALUE '330019 00140112'.
468300         10  FILLER      PIC X(15) VALUE '330023 00055591'.
468400         10  FILLER      PIC X(15) VALUE '330024 00164073'.
468500         10  FILLER      PIC X(15) VALUE '330027 00391614'.
468600         10  FILLER      PIC X(15) VALUE '330028 00311340'.
468700         10  FILLER      PIC X(15) VALUE '330030 00082598'.
468800         10  FILLER      PIC X(15) VALUE '330033 00067095'.
468900         10  FILLER      PIC X(15) VALUE '330043 00111027'.
469000         10  FILLER      PIC X(15) VALUE '330044 00071031'.
469100         10  FILLER      PIC X(15) VALUE '330046 00275522'.
469200         10  FILLER      PIC X(15) VALUE '330047 00080184'.
469300         10  FILLER      PIC X(15) VALUE '330053 00062768'.
469400         10  FILLER      PIC X(15) VALUE '330055 00168621'.
469500         10  FILLER      PIC X(15) VALUE '330056 00390880'.
469600         10  FILLER      PIC X(15) VALUE '330057 00073117'.
469700         10  FILLER      PIC X(15) VALUE '330058 00065210'.
469800         10  FILLER      PIC X(15) VALUE '330059 00327862'.
469900         10  FILLER      PIC X(15) VALUE '330065 00245234'.
470000         10  FILLER      PIC X(15) VALUE '330067 00151539'.
470100         10  FILLER      PIC X(15) VALUE '330073 00139776'.
470200         10  FILLER      PIC X(15) VALUE '330074 00059321'.
470300         10  FILLER      PIC X(15) VALUE '330078 00156673'.
470400         10  FILLER      PIC X(15) VALUE '330079 00049456'.
470500         10  FILLER      PIC X(15) VALUE '330080 00747053'.
470600         10  FILLER      PIC X(15) VALUE '330084 00100325'.
470700         10  FILLER      PIC X(15) VALUE '330085 00046337'.
470800         10  FILLER      PIC X(15) VALUE '330086 00088976'.
470900         10  FILLER      PIC X(15) VALUE '330088 00174138'.
471000         10  FILLER      PIC X(15) VALUE '330090 00087762'.
471100         10  FILLER      PIC X(15) VALUE '330094 00056209'.
471200         10  FILLER      PIC X(15) VALUE '330096 00062371'.
471300         10  FILLER      PIC X(15) VALUE '330100 00286079'.
471400         10  FILLER      PIC X(15) VALUE '330101 00186224'.
471500         10  FILLER      PIC X(15) VALUE '330103 00064073'.
471600         10  FILLER      PIC X(15) VALUE '330104 00091699'.
471700         10  FILLER      PIC X(15) VALUE '330106 00069255'.
471800         10  FILLER      PIC X(15) VALUE '330107 00038619'.
471900         10  FILLER      PIC X(15) VALUE '330108 00095008'.
472000         10  FILLER      PIC X(15) VALUE '330115 00084208'.
472100         10  FILLER      PIC X(15) VALUE '330119 00076679'.
472200         10  FILLER      PIC X(15) VALUE '330125 00114367'.
472300         10  FILLER      PIC X(15) VALUE '330126 00047413'.
472400         10  FILLER      PIC X(15) VALUE '330127 00678080'.
472500         10  FILLER      PIC X(15) VALUE '330128 00641077'.
472600         10  FILLER      PIC X(15) VALUE '330135 00034843'.
472700         10  FILLER      PIC X(15) VALUE '330136 00055138'.
472800         10  FILLER      PIC X(15) VALUE '330140 00069318'.
472900         10  FILLER      PIC X(15) VALUE '330141 00057224'.
473000         10  FILLER      PIC X(15) VALUE '330151 00213665'.
473100         10  FILLER      PIC X(15) VALUE '330153 00113333'.
473200         10  FILLER      PIC X(15) VALUE '330157 00089703'.
473300         10  FILLER      PIC X(15) VALUE '330158 00115701'.
473400         10  FILLER      PIC X(15) VALUE '330160 00149329'.
473500         10  FILLER      PIC X(15) VALUE '330163 00112845'.
473600         10  FILLER      PIC X(15) VALUE '330164 00127106'.
473700         10  FILLER      PIC X(15) VALUE '330167 00088114'.
473800         10  FILLER      PIC X(15) VALUE '330169 00204121'.
473900         10  FILLER      PIC X(15) VALUE '330175 00065928'.
474000         10  FILLER      PIC X(15) VALUE '330180 00066644'.
474100         10  FILLER      PIC X(15) VALUE '330184 00130174'.
474200         10  FILLER      PIC X(15) VALUE '330188 00109336'.
474300         10  FILLER      PIC X(15) VALUE '330191 00067045'.
474400         10  FILLER      PIC X(15) VALUE '330193 00297261'.
474500         10  FILLER      PIC X(15) VALUE '330194 00252364'.
474600         10  FILLER      PIC X(15) VALUE '330195 00190747'.
474700         10  FILLER      PIC X(15) VALUE '330196 00305709'.
474800         10  FILLER      PIC X(15) VALUE '330197 00114317'.
474900         10  FILLER      PIC X(15) VALUE '330198 00045133'.
475000         10  FILLER      PIC X(15) VALUE '330199 00957085'.
475100         10  FILLER      PIC X(15) VALUE '330201 00176763'.
475200         10  FILLER      PIC X(15) VALUE '330202 00991367'.
475300         10  FILLER      PIC X(15) VALUE '330203 00191597'.
475400         10  FILLER      PIC X(15) VALUE '330204 00830983'.
475500         10  FILLER      PIC X(15) VALUE '330208 00265727'.
475600         10  FILLER      PIC X(15) VALUE '330211 00059995'.
475700         10  FILLER      PIC X(15) VALUE '330213 00055552'.
475800         10  FILLER      PIC X(15) VALUE '330214 00071864'.
475900         10  FILLER      PIC X(15) VALUE '330215 00071973'.
476000         10  FILLER      PIC X(15) VALUE '330218 00074379'.
476100         10  FILLER      PIC X(15) VALUE '330219 00284071'.
476200         10  FILLER      PIC X(15) VALUE '330221 00329504'.
476300         10  FILLER      PIC X(15) VALUE '330222 00056852'.
476400         10  FILLER      PIC X(15) VALUE '330223 00063528'.
476500         10  FILLER      PIC X(15) VALUE '330224 00093617'.
476600         10  FILLER      PIC X(15) VALUE '330225 00059663'.
476700         10  FILLER      PIC X(15) VALUE '330226 00161409'.
476800         10  FILLER      PIC X(15) VALUE '330229 00116409'.
476900         10  FILLER      PIC X(15) VALUE '330231 00660519'.
477000         10  FILLER      PIC X(15) VALUE '330232 00105102'.
477100         10  FILLER      PIC X(15) VALUE '330233 00487225'.
477200         10  FILLER      PIC X(15) VALUE '330234 00373761'.
477300         10  FILLER      PIC X(15) VALUE '330235 00044220'.
477400         10  FILLER      PIC X(15) VALUE '330236 00186708'.
477500         10  FILLER      PIC X(15) VALUE '330238 00067315'.
477600         10  FILLER      PIC X(15) VALUE '330239 00110987'.
477700         10  FILLER      PIC X(15) VALUE '330240 00725450'.
477800         10  FILLER      PIC X(15) VALUE '330241 00174049'.
477900         10  FILLER      PIC X(15) VALUE '330245 00054519'.
478000         10  FILLER      PIC X(15) VALUE '330246 00154063'.
478100         10  FILLER      PIC X(15) VALUE '330250 00062390'.
478200         10  FILLER      PIC X(15) VALUE '330259 00085469'.
478300         10  FILLER      PIC X(15) VALUE '330261 00141547'.
478400         10  FILLER      PIC X(15) VALUE '330263 00058365'.
478500         10  FILLER      PIC X(15) VALUE '330264 00067169'.
478600         10  FILLER      PIC X(15) VALUE '330265 00246118'.
478700         10  FILLER      PIC X(15) VALUE '330267 00039119'.
478800         10  FILLER      PIC X(15) VALUE '330276 00087881'.
478900         10  FILLER      PIC X(15) VALUE '330277 00038783'.
479000         10  FILLER      PIC X(15) VALUE '330279 00096239'.
479100         10  FILLER      PIC X(15) VALUE '330285 00271997'.
479200         10  FILLER      PIC X(15) VALUE '330286 00086096'.
479300         10  FILLER      PIC X(15) VALUE '330304 00052773'.
479400         10  FILLER      PIC X(15) VALUE '330306 00245282'.
479500         10  FILLER      PIC X(15) VALUE '330307 00047417'.
479600         10  FILLER      PIC X(15) VALUE '330316 00090239'.
479700         10  FILLER      PIC X(15) VALUE '330340 00033016'.
479800         10  FILLER      PIC X(15) VALUE '330350 00371573'.
479900         10  FILLER      PIC X(15) VALUE '330353 00155477'.
480000         10  FILLER      PIC X(15) VALUE '330372 00074374'.
480100         10  FILLER      PIC X(15) VALUE '330385 00939983'.
480200         10  FILLER      PIC X(15) VALUE '330386 00083439'.
480300         10  FILLER      PIC X(15) VALUE '330393 00133561'.
480400         10  FILLER      PIC X(15) VALUE '330394 00093002'.
480500         10  FILLER      PIC X(15) VALUE '330395 00295913'.
480600         10  FILLER      PIC X(15) VALUE '330396 00867325'.
480700         10  FILLER      PIC X(15) VALUE '330397 00590608'.
480800         10  FILLER      PIC X(15) VALUE '330399 00673612'.
480900         10  FILLER      PIC X(15) VALUE '330403 00071738'.
481000         10  FILLER      PIC X(15) VALUE '340001 00069913'.
481100         10  FILLER      PIC X(15) VALUE '340002 00080329'.
481200         10  FILLER      PIC X(15) VALUE '340003 00054858'.
481300         10  FILLER      PIC X(15) VALUE '340004 00070844'.
481400         10  FILLER      PIC X(15) VALUE '340008 00063756'.
481500         10  FILLER      PIC X(15) VALUE '340010 00064892'.
481600         10  FILLER      PIC X(15) VALUE '340011 00040648'.
481700         10  FILLER      PIC X(15) VALUE '340013 00047207'.
481800         10  FILLER      PIC X(15) VALUE '340014 00139042'.
481900         10  FILLER      PIC X(15) VALUE '340015 00057068'.
482000         10  FILLER      PIC X(15) VALUE '340016 00070650'.
482100         10  FILLER      PIC X(15) VALUE '340017 00038609'.
482200         10  FILLER      PIC X(15) VALUE '340020 00054985'.
482300         10  FILLER      PIC X(15) VALUE '340021 00051604'.
482400         10  FILLER      PIC X(15) VALUE '340023 00073085'.
482500         10  FILLER      PIC X(15) VALUE '340024 00068249'.
482600         10  FILLER      PIC X(15) VALUE '340027 00056606'.
482700         10  FILLER      PIC X(15) VALUE '340028 00145103'.
482800         10  FILLER      PIC X(15) VALUE '340030 00152472'.
482900         10  FILLER      PIC X(15) VALUE '340032 00073141'.
483000         10  FILLER      PIC X(15) VALUE '340036 00028308'.
483100         10  FILLER      PIC X(15) VALUE '340037 00033485'.
483200         10  FILLER      PIC X(15) VALUE '340039 00049568'.
483300         10  FILLER      PIC X(15) VALUE '340040 00124991'.
483400         10  FILLER      PIC X(15) VALUE '340041 00074197'.
483500         10  FILLER      PIC X(15) VALUE '340042 00110500'.
483600         10  FILLER      PIC X(15) VALUE '340047 00158099'.
483700         10  FILLER      PIC X(15) VALUE '340050 00098192'.
483800         10  FILLER      PIC X(15) VALUE '340051 00038538'.
483900         10  FILLER      PIC X(15) VALUE '340053 00156139'.
484000         10  FILLER      PIC X(15) VALUE '340060 00055685'.
484100         10  FILLER      PIC X(15) VALUE '340061 00225817'.
484200         10  FILLER      PIC X(15) VALUE '340064 00047957'.
484300         10  FILLER      PIC X(15) VALUE '340068 00073436'.
484400         10  FILLER      PIC X(15) VALUE '340069 00110762'.
484500         10  FILLER      PIC X(15) VALUE '340070 00073170'.
484600         10  FILLER      PIC X(15) VALUE '340071 00078311'.
484700         10  FILLER      PIC X(15) VALUE '340073 00032305'.
484800         10  FILLER      PIC X(15) VALUE '340075 00100013'.
484900         10  FILLER      PIC X(15) VALUE '340084 00023552'.
485000         10  FILLER      PIC X(15) VALUE '340085 00122102'.
485100         10  FILLER      PIC X(15) VALUE '340087 00048693'.
485200         10  FILLER      PIC X(15) VALUE '340090 00081413'.
485300         10  FILLER      PIC X(15) VALUE '340091 00105738'.
485400         10  FILLER      PIC X(15) VALUE '340096 00073987'.
485500         10  FILLER      PIC X(15) VALUE '340097 00049818'.
485600         10  FILLER      PIC X(15) VALUE '340098 00050721'.
485700         10  FILLER      PIC X(15) VALUE '340099 00068309'.
485800         10  FILLER      PIC X(15) VALUE '340106 00064854'.
485900         10  FILLER      PIC X(15) VALUE '340107 00067828'.
486000         10  FILLER      PIC X(15) VALUE '340109 00042818'.
486100         10  FILLER      PIC X(15) VALUE '340113 00192581'.
486200         10  FILLER      PIC X(15) VALUE '340115 00044485'.
486300         10  FILLER      PIC X(15) VALUE '340116 00044011'.
486400         10  FILLER      PIC X(15) VALUE '340119 00045618'.
486500         10  FILLER      PIC X(15) VALUE '340120 00096001'.
486600         10  FILLER      PIC X(15) VALUE '340123 00074919'.
486700         10  FILLER      PIC X(15) VALUE '340126 00054945'.
486800         10  FILLER      PIC X(15) VALUE '340127 00060115'.
486900         10  FILLER      PIC X(15) VALUE '340129 00055553'.
487000         10  FILLER      PIC X(15) VALUE '340130 00076321'.
487100         10  FILLER      PIC X(15) VALUE '340131 00040475'.
487200         10  FILLER      PIC X(15) VALUE '340132 00103727'.
487300         10  FILLER      PIC X(15) VALUE '340133 00048134'.
487400         10  FILLER      PIC X(15) VALUE '340141 00071671'.
487500         10  FILLER      PIC X(15) VALUE '340142 00030739'.
487600         10  FILLER      PIC X(15) VALUE '340143 00115519'.
487700         10  FILLER      PIC X(15) VALUE '340144 00078697'.
487800         10  FILLER      PIC X(15) VALUE '340145 00080402'.
487900         10  FILLER      PIC X(15) VALUE '340147 00084066'.
488000         10  FILLER      PIC X(15) VALUE '340151 00065901'.
488100         10  FILLER      PIC X(15) VALUE '340155 00069422'.
488200         10  FILLER      PIC X(15) VALUE '340156 00100501'.
488300         10  FILLER      PIC X(15) VALUE '340158 00041959'.
488400         10  FILLER      PIC X(15) VALUE '340159 00032348'.
488500         10  FILLER      PIC X(15) VALUE '340160 00048641'.
488600         10  FILLER      PIC X(15) VALUE '340166 00086244'.
488700         10  FILLER      PIC X(15) VALUE '340171 00045254'.
488800         10  FILLER      PIC X(15) VALUE '340173 00042862'.
488900         10  FILLER      PIC X(15) VALUE '340183 00047585'.
489000         10  FILLER      PIC X(15) VALUE '340184 00037103'.
489100         10  FILLER      PIC X(15) VALUE '340186 00000913'.
489200         10  FILLER      PIC X(15) VALUE '350002 00041163'.
489300         10  FILLER      PIC X(15) VALUE '350006 00039053'.
489400         10  FILLER      PIC X(15) VALUE '350011 00068455'.
489500         10  FILLER      PIC X(15) VALUE '350015 00061319'.
489600         10  FILLER      PIC X(15) VALUE '350019 00062859'.
489700         10  FILLER      PIC X(15) VALUE '350063 00093931'.
489800         10  FILLER      PIC X(15) VALUE '350070 00059445'.
489900         10  FILLER      PIC X(15) VALUE '360001 00058372'.
490000         10  FILLER      PIC X(15) VALUE '360002 00036106'.
490100         10  FILLER      PIC X(15) VALUE '360003 00215339'.
490200         10  FILLER      PIC X(15) VALUE '360006 00053511'.
490300         10  FILLER      PIC X(15) VALUE '360008 00065683'.
490400         10  FILLER      PIC X(15) VALUE '360009 00053160'.
490500         10  FILLER      PIC X(15) VALUE '360010 00045826'.
490600         10  FILLER      PIC X(15) VALUE '360011 00053810'.
490700         10  FILLER      PIC X(15) VALUE '360012 00104470'.
490800         10  FILLER      PIC X(15) VALUE '360013 00068203'.
490900         10  FILLER      PIC X(15) VALUE '360014 00083365'.
491000         10  FILLER      PIC X(15) VALUE '360017 00138177'.
491100         10  FILLER      PIC X(15) VALUE '360019 00074669'.
491200         10  FILLER      PIC X(15) VALUE '360020 00092778'.
491300         10  FILLER      PIC X(15) VALUE '360025 00049865'.
491400         10  FILLER      PIC X(15) VALUE '360026 00043311'.
491500         10  FILLER      PIC X(15) VALUE '360027 00069496'.
491600         10  FILLER      PIC X(15) VALUE '360029 00041971'.
491700         10  FILLER      PIC X(15) VALUE '360032 00026409'.
491800         10  FILLER      PIC X(15) VALUE '360035 00087131'.
491900         10  FILLER      PIC X(15) VALUE '360036 00051804'.
492000         10  FILLER      PIC X(15) VALUE '360037 00131712'.
492100         10  FILLER      PIC X(15) VALUE '360039 00061070'.
492200         10  FILLER      PIC X(15) VALUE '360040 00040394'.
492300         10  FILLER      PIC X(15) VALUE '360044 00036491'.
492400         10  FILLER      PIC X(15) VALUE '360046 00053498'.
492500         10  FILLER      PIC X(15) VALUE '360048 00073883'.
492600         10  FILLER      PIC X(15) VALUE '360051 00163802'.
492700         10  FILLER      PIC X(15) VALUE '360052 00076373'.
492800         10  FILLER      PIC X(15) VALUE '360054 00052125'.
492900         10  FILLER      PIC X(15) VALUE '360055 00064113'.
493000         10  FILLER      PIC X(15) VALUE '360056 00047131'.
493100         10  FILLER      PIC X(15) VALUE '360058 00032785'.
493200         10  FILLER      PIC X(15) VALUE '360059 00294585'.
493300         10  FILLER      PIC X(15) VALUE '360064 00080351'.
493400         10  FILLER      PIC X(15) VALUE '360065 00052665'.
493500         10  FILLER      PIC X(15) VALUE '360066 00060312'.
493600         10  FILLER      PIC X(15) VALUE '360068 00157532'.
493700         10  FILLER      PIC X(15) VALUE '360070 00076015'.
493800         10  FILLER      PIC X(15) VALUE '360071 00034053'.
493900         10  FILLER      PIC X(15) VALUE '360072 00045351'.
494000         10  FILLER      PIC X(15) VALUE '360074 00055775'.
494100         10  FILLER      PIC X(15) VALUE '360075 00031183'.
494200         10  FILLER      PIC X(15) VALUE '360076 00057778'.
494300         10  FILLER      PIC X(15) VALUE '360077 00091541'.
494400         10  FILLER      PIC X(15) VALUE '360078 00049274'.
494500         10  FILLER      PIC X(15) VALUE '360080 00049587'.
494600         10  FILLER      PIC X(15) VALUE '360081 00053175'.
494700         10  FILLER      PIC X(15) VALUE '360082 00045840'.
494800         10  FILLER      PIC X(15) VALUE '360084 00076996'.
494900         10  FILLER      PIC X(15) VALUE '360085 00180465'.
495000         10  FILLER      PIC X(15) VALUE '360086 00072614'.
495100         10  FILLER      PIC X(15) VALUE '360087 00067064'.
495200         10  FILLER      PIC X(15) VALUE '360089 00034772'.
495300         10  FILLER      PIC X(15) VALUE '360092 00077899'.
495400         10  FILLER      PIC X(15) VALUE '360095 00046315'.
495500         10  FILLER      PIC X(15) VALUE '360096 00067510'.
495600         10  FILLER      PIC X(15) VALUE '360107 00075541'.
495700         10  FILLER      PIC X(15) VALUE '360109 00048584'.
495800         10  FILLER      PIC X(15) VALUE '360112 00129289'.
495900         10  FILLER      PIC X(15) VALUE '360116 00068875'.
496000         10  FILLER      PIC X(15) VALUE '360118 00051377'.
496100         10  FILLER      PIC X(15) VALUE '360125 00054468'.
496200         10  FILLER      PIC X(15) VALUE '360131 00050619'.
496300         10  FILLER      PIC X(15) VALUE '360132 00078169'.
496400         10  FILLER      PIC X(15) VALUE '360133 00108002'.
496500         10  FILLER      PIC X(15) VALUE '360134 00160206'.
496600         10  FILLER      PIC X(15) VALUE '360137 00131358'.
496700         10  FILLER      PIC X(15) VALUE '360141 00072828'.
496800         10  FILLER      PIC X(15) VALUE '360144 00049332'.
496900         10  FILLER      PIC X(15) VALUE '360145 00039712'.
497000         10  FILLER      PIC X(15) VALUE '360147 00038666'.
497100         10  FILLER      PIC X(15) VALUE '360152 00118013'.
497200         10  FILLER      PIC X(15) VALUE '360153 00144012'.
497300         10  FILLER      PIC X(15) VALUE '360156 00049240'.
497400         10  FILLER      PIC X(15) VALUE '360159 00065216'.
497500         10  FILLER      PIC X(15) VALUE '360161 00074996'.
497600         10  FILLER      PIC X(15) VALUE '360163 00053702'.
497700         10  FILLER      PIC X(15) VALUE '360170 00069311'.
497800         10  FILLER      PIC X(15) VALUE '360172 00061226'.
497900         10  FILLER      PIC X(15) VALUE '360174 00061260'.
498000         10  FILLER      PIC X(15) VALUE '360175 00054870'.
498100         10  FILLER      PIC X(15) VALUE '360179 00045951'.
498200         10  FILLER      PIC X(15) VALUE '360180 00078491'.
498300         10  FILLER      PIC X(15) VALUE '360185 00041100'.
498400         10  FILLER      PIC X(15) VALUE '360189 00118008'.
498500         10  FILLER      PIC X(15) VALUE '360197 00043332'.
498600         10  FILLER      PIC X(15) VALUE '360203 00044156'.
498700         10  FILLER      PIC X(15) VALUE '360210 00054383'.
498800         10  FILLER      PIC X(15) VALUE '360211 00047801'.
498900         10  FILLER      PIC X(15) VALUE '360212 00055446'.
499000         10  FILLER      PIC X(15) VALUE '360218 00061767'.
499100         10  FILLER      PIC X(15) VALUE '360234 00080429'.
499200         10  FILLER      PIC X(15) VALUE '360236 00062171'.
499300         10  FILLER      PIC X(15) VALUE '360239 00075807'.
499400         10  FILLER      PIC X(15) VALUE '360245 00276361'.
499500         10  FILLER      PIC X(15) VALUE '360247 00032176'.
499600         10  FILLER      PIC X(15) VALUE '360259 00083463'.
499700         10  FILLER      PIC X(15) VALUE '360262 00037073'.
499800         10  FILLER      PIC X(15) VALUE '360274 00019981'.
499900         10  FILLER      PIC X(15) VALUE '370001 00211254'.
500000         10  FILLER      PIC X(15) VALUE '370002 00045804'.
500100         10  FILLER      PIC X(15) VALUE '370004 00046704'.
500200         10  FILLER      PIC X(15) VALUE '370006 00061598'.
500300         10  FILLER      PIC X(15) VALUE '370007 00057365'.
500400         10  FILLER      PIC X(15) VALUE '370008 00052263'.
500500         10  FILLER      PIC X(15) VALUE '370011 00043284'.
500600         10  FILLER      PIC X(15) VALUE '370013 00075810'.
500700         10  FILLER      PIC X(15) VALUE '370014 00079889'.
500800         10  FILLER      PIC X(15) VALUE '370015 00049934'.
500900         10  FILLER      PIC X(15) VALUE '370016 00305114'.
501000         10  FILLER      PIC X(15) VALUE '370018 00037523'.
501100         10  FILLER      PIC X(15) VALUE '370019 00057781'.
501200         10  FILLER      PIC X(15) VALUE '370020 00075063'.
501300         10  FILLER      PIC X(15) VALUE '370022 00048093'.
501400         10  FILLER      PIC X(15) VALUE '370023 00036579'.
501500         10  FILLER      PIC X(15) VALUE '370025 00065313'.
501600         10  FILLER      PIC X(15) VALUE '370026 00026098'.
501700         10  FILLER      PIC X(15) VALUE '370028 00182732'.
501800         10  FILLER      PIC X(15) VALUE '370029 00055499'.
501900         10  FILLER      PIC X(15) VALUE '370030 00042355'.
502000         10  FILLER      PIC X(15) VALUE '370032 00073907'.
502100         10  FILLER      PIC X(15) VALUE '370034 00049395'.
502200         10  FILLER      PIC X(15) VALUE '370036 00028658'.
502300         10  FILLER      PIC X(15) VALUE '370037 00385596'.
502400         10  FILLER      PIC X(15) VALUE '370039 00060752'.
502500         10  FILLER      PIC X(15) VALUE '370040 00095098'.
502600         10  FILLER      PIC X(15) VALUE '370047 00054381'.
502700         10  FILLER      PIC X(15) VALUE '370048 00073941'.
502800         10  FILLER      PIC X(15) VALUE '370049 00052085'.
502900         10  FILLER      PIC X(15) VALUE '370051 00028680'.
503000         10  FILLER      PIC X(15) VALUE '370054 00057007'.
503100         10  FILLER      PIC X(15) VALUE '370056 00058154'.
503200         10  FILLER      PIC X(15) VALUE '370057 00030360'.
503300         10  FILLER      PIC X(15) VALUE '370065 00033740'.
503400         10  FILLER      PIC X(15) VALUE '370072 00038555'.
503500         10  FILLER      PIC X(15) VALUE '370078 00127000'.
503600         10  FILLER      PIC X(15) VALUE '370083 00023241'.
503700         10  FILLER      PIC X(15) VALUE '370089 00055018'.
503800         10  FILLER      PIC X(15) VALUE '370091 00125312'.
503900         10  FILLER      PIC X(15) VALUE '370093 00463033'.
504000         10  FILLER      PIC X(15) VALUE '370094 00038391'.
504100         10  FILLER      PIC X(15) VALUE '370097 00361198'.
504200         10  FILLER      PIC X(15) VALUE '370099 00045127'.
504300         10  FILLER      PIC X(15) VALUE '370100 00034356'.
504400         10  FILLER      PIC X(15) VALUE '370103 00022897'.
504500         10  FILLER      PIC X(15) VALUE '370106 00074153'.
504600         10  FILLER      PIC X(15) VALUE '370112 00031250'.
504700         10  FILLER      PIC X(15) VALUE '370113 00048550'.
504800         10  FILLER      PIC X(15) VALUE '370114 00066042'.
504900         10  FILLER      PIC X(15) VALUE '370138 00104352'.
505000         10  FILLER      PIC X(15) VALUE '370149 00075020'.
505100         10  FILLER      PIC X(15) VALUE '370153 00027915'.
505200         10  FILLER      PIC X(15) VALUE '370156 00029661'.
505300         10  FILLER      PIC X(15) VALUE '370158 00018740'.
505400         10  FILLER      PIC X(15) VALUE '370166 00135130'.
505500         10  FILLER      PIC X(15) VALUE '370170 00102029'.
505600         10  FILLER      PIC X(15) VALUE '370171 00218093'.
505700         10  FILLER      PIC X(15) VALUE '370172 00201893'.
505800         10  FILLER      PIC X(15) VALUE '370173 00101103'.
505900         10  FILLER      PIC X(15) VALUE '370178 00055757'.
506000         10  FILLER      PIC X(15) VALUE '370180 00014524'.
506100         10  FILLER      PIC X(15) VALUE '370183 00045526'.
506200         10  FILLER      PIC X(15) VALUE '370201 00052966'.
506300         10  FILLER      PIC X(15) VALUE '370202 00130656'.
506400         10  FILLER      PIC X(15) VALUE '370211 00105644'.
506500         10  FILLER      PIC X(15) VALUE '370218 00080969'.
506600         10  FILLER      PIC X(15) VALUE '370220 00015204'.
506700         10  FILLER      PIC X(15) VALUE '370227 00043964'.
506800         10  FILLER      PIC X(15) VALUE '370228 00066045'.
506900         10  FILLER      PIC X(15) VALUE '370229 00031944'.
507000         10  FILLER      PIC X(15) VALUE '380001 00050199'.
507100         10  FILLER      PIC X(15) VALUE '380002 00060510'.
507200         10  FILLER      PIC X(15) VALUE '380004 00101949'.
507300         10  FILLER      PIC X(15) VALUE '380005 00066095'.
507400         10  FILLER      PIC X(15) VALUE '380007 00517653'.
507500         10  FILLER      PIC X(15) VALUE '380009 00255269'.
507600         10  FILLER      PIC X(15) VALUE '380014 00064499'.
507700         10  FILLER      PIC X(15) VALUE '380017 00063246'.
507800         10  FILLER      PIC X(15) VALUE '380018 00080335'.
507900         10  FILLER      PIC X(15) VALUE '380020 00054516'.
508000         10  FILLER      PIC X(15) VALUE '380021 00121584'.
508100         10  FILLER      PIC X(15) VALUE '380022 00088748'.
508200         10  FILLER      PIC X(15) VALUE '380025 00140176'.
508300         10  FILLER      PIC X(15) VALUE '380027 00062451'.
508400         10  FILLER      PIC X(15) VALUE '380029 00392617'.
508500         10  FILLER      PIC X(15) VALUE '380033 00071606'.
508600         10  FILLER      PIC X(15) VALUE '380037 00073621'.
508700         10  FILLER      PIC X(15) VALUE '380038 00103992'.
508800         10  FILLER      PIC X(15) VALUE '380040 00067160'.
508900         10  FILLER      PIC X(15) VALUE '380047 00077386'.
509000         10  FILLER      PIC X(15) VALUE '380050 00062402'.
509100         10  FILLER      PIC X(15) VALUE '380051 00146431'.
509200         10  FILLER      PIC X(15) VALUE '380052 00061007'.
509300         10  FILLER      PIC X(15) VALUE '380056 00089109'.
509400         10  FILLER      PIC X(15) VALUE '380060 00097927'.
509500         10  FILLER      PIC X(15) VALUE '380061 00094388'.
509600         10  FILLER      PIC X(15) VALUE '380071 00064716'.
509700         10  FILLER      PIC X(15) VALUE '380075 00050150'.
509800         10  FILLER      PIC X(15) VALUE '380082 00075383'.
509900         10  FILLER      PIC X(15) VALUE '380090 00049255'.
510000         10  FILLER      PIC X(15) VALUE '380102 00102895'.
510100         10  FILLER      PIC X(15) VALUE '390002 00135562'.
510200         10  FILLER      PIC X(15) VALUE '390003 00040826'.
510300         10  FILLER      PIC X(15) VALUE '390006 00139857'.
510400         10  FILLER      PIC X(15) VALUE '390008 00056144'.
510500         10  FILLER      PIC X(15) VALUE '390009 00110769'.
510600         10  FILLER      PIC X(15) VALUE '390016 00082265'.
510700         10  FILLER      PIC X(15) VALUE '390025 02102095'.
510800         10  FILLER      PIC X(15) VALUE '390026 00035589'.
510900         10  FILLER      PIC X(15) VALUE '390027 00434478'.
511000         10  FILLER      PIC X(15) VALUE '390028 00191739'.
511100         10  FILLER      PIC X(15) VALUE '390030 00117262'.
511200         10  FILLER      PIC X(15) VALUE '390039 00088308'.
511300         10  FILLER      PIC X(15) VALUE '390041 00096897'.
511400         10  FILLER      PIC X(15) VALUE '390042 00067208'.
511500         10  FILLER      PIC X(15) VALUE '390043 00038024'.
511600         10  FILLER      PIC X(15) VALUE '390044 00079640'.
511700         10  FILLER      PIC X(15) VALUE '390045 00045465'.
511800         10  FILLER      PIC X(15) VALUE '390046 00068548'.
511900         10  FILLER      PIC X(15) VALUE '390048 00039518'.
512000         10  FILLER      PIC X(15) VALUE '390049 00051627'.
512100         10  FILLER      PIC X(15) VALUE '390050 00086324'.
512200         10  FILLER      PIC X(15) VALUE '390052 00035300'.
512300         10  FILLER      PIC X(15) VALUE '390056 00049097'.
512400         10  FILLER      PIC X(15) VALUE '390061 00059502'.
512500         10  FILLER      PIC X(15) VALUE '390062 00090644'.
512600         10  FILLER      PIC X(15) VALUE '390063 00096365'.
512700         10  FILLER      PIC X(15) VALUE '390066 00041897'.
512800         10  FILLER      PIC X(15) VALUE '390067 00084309'.
512900         10  FILLER      PIC X(15) VALUE '390068 00067727'.
513000         10  FILLER      PIC X(15) VALUE '390070 00094855'.
513100         10  FILLER      PIC X(15) VALUE '390071 00050653'.
513200         10  FILLER      PIC X(15) VALUE '390072 00035662'.
513300         10  FILLER      PIC X(15) VALUE '390073 00082076'.
513400         10  FILLER      PIC X(15) VALUE '390076 00071193'.
513500         10  FILLER      PIC X(15) VALUE '390079 00064136'.
513600         10  FILLER      PIC X(15) VALUE '390080 00060186'.
513700         10  FILLER      PIC X(15) VALUE '390081 00107236'.
513800         10  FILLER      PIC X(15) VALUE '390084 00066050'.
513900         10  FILLER      PIC X(15) VALUE '390086 00118057'.
514000         10  FILLER      PIC X(15) VALUE '390090 00326274'.
514100         10  FILLER      PIC X(15) VALUE '390091 00042367'.
514200         10  FILLER      PIC X(15) VALUE '390093 00031390'.
514300         10  FILLER      PIC X(15) VALUE '390096 00070350'.
514400         10  FILLER      PIC X(15) VALUE '390097 00086229'.
514500         10  FILLER      PIC X(15) VALUE '390100 00060860'.
514600         10  FILLER      PIC X(15) VALUE '390101 00057712'.
514700         10  FILLER      PIC X(15) VALUE '390110 00120240'.
514800         10  FILLER      PIC X(15) VALUE '390111 00179920'.
514900         10  FILLER      PIC X(15) VALUE '390113 00071230'.
515000         10  FILLER      PIC X(15) VALUE '390114 00763804'.
515100         10  FILLER      PIC X(15) VALUE '390115 00083849'.
515200         10  FILLER      PIC X(15) VALUE '390116 00054376'.
515300         10  FILLER      PIC X(15) VALUE '390117 00052255'.
515400         10  FILLER      PIC X(15) VALUE '390118 00179753'.
515500         10  FILLER      PIC X(15) VALUE '390119 00114260'.
515600         10  FILLER      PIC X(15) VALUE '390122 00008166'.
515700         10  FILLER      PIC X(15) VALUE '390125 00039771'.
515800         10  FILLER      PIC X(15) VALUE '390127 00081328'.
515900         10  FILLER      PIC X(15) VALUE '390132 00424882'.
516000         10  FILLER      PIC X(15) VALUE '390133 00068196'.
516100         10  FILLER      PIC X(15) VALUE '390137 00032034'.
516200         10  FILLER      PIC X(15) VALUE '390138 00035946'.
516300         10  FILLER      PIC X(15) VALUE '390142 00204787'.
516400         10  FILLER      PIC X(15) VALUE '390145 00091054'.
516500         10  FILLER      PIC X(15) VALUE '390146 00034755'.
516600         10  FILLER      PIC X(15) VALUE '390147 00054485'.
516700         10  FILLER      PIC X(15) VALUE '390150 00060898'.
516800         10  FILLER      PIC X(15) VALUE '390151 00032507'.
516900         10  FILLER      PIC X(15) VALUE '390156 00136279'.
517000         10  FILLER      PIC X(15) VALUE '390163 00117749'.
517100         10  FILLER      PIC X(15) VALUE '390164 00112549'.
517200         10  FILLER      PIC X(15) VALUE '390168 00066324'.
517300         10  FILLER      PIC X(15) VALUE '390173 00044290'.
517400         10  FILLER      PIC X(15) VALUE '390174 00122887'.
517500         10  FILLER      PIC X(15) VALUE '390178 00054085'.
517600         10  FILLER      PIC X(15) VALUE '390180 00114546'.
517700         10  FILLER      PIC X(15) VALUE '390184 00098137'.
517800         10  FILLER      PIC X(15) VALUE '390185 00032834'.
517900         10  FILLER      PIC X(15) VALUE '390192 00027747'.
518000         10  FILLER      PIC X(15) VALUE '390194 00062223'.
518100         10  FILLER      PIC X(15) VALUE '390195 00050993'.
518200         10  FILLER      PIC X(15) VALUE '390197 00147432'.
518300         10  FILLER      PIC X(15) VALUE '390198 00116814'.
518400         10  FILLER      PIC X(15) VALUE '390199 00040763'.
518500         10  FILLER      PIC X(15) VALUE '390201 00042235'.
518600         10  FILLER      PIC X(15) VALUE '390204 00055648'.
518700         10  FILLER      PIC X(15) VALUE '390211 00075772'.
518800         10  FILLER      PIC X(15) VALUE '390217 00056694'.
518900         10  FILLER      PIC X(15) VALUE '390219 00070417'.
519000         10  FILLER      PIC X(15) VALUE '390220 00042785'.
519100         10  FILLER      PIC X(15) VALUE '390223 00102694'.
519200         10  FILLER      PIC X(15) VALUE '390226 00174522'.
519300         10  FILLER      PIC X(15) VALUE '390236 00045429'.
519400         10  FILLER      PIC X(15) VALUE '390256 00170852'.
519500         10  FILLER      PIC X(15) VALUE '390266 00045282'.
519600         10  FILLER      PIC X(15) VALUE '390270 00072460'.
519700         10  FILLER      PIC X(15) VALUE '390272 00353927'.
519800         10  FILLER      PIC X(15) VALUE '390278 00202200'.
519900         10  FILLER      PIC X(15) VALUE '390290 00280193'.
520000         10  FILLER      PIC X(15) VALUE '390304 00060270'.
520100         10  FILLER      PIC X(15) VALUE '400003 00447490'.
520200         10  FILLER      PIC X(15) VALUE '400005 00322363'.
520300         10  FILLER      PIC X(15) VALUE '400006 00558030'.
520400         10  FILLER      PIC X(15) VALUE '400007 00577421'.
520500         10  FILLER      PIC X(15) VALUE '400009 00221388'.
520600         10  FILLER      PIC X(15) VALUE '400010 00125469'.
520700         10  FILLER      PIC X(15) VALUE '400011 00570113'.
520800         10  FILLER      PIC X(15) VALUE '400012 00441801'.
520900         10  FILLER      PIC X(15) VALUE '400013 00298175'.
521000         10  FILLER      PIC X(15) VALUE '400015 01680070'.
521100         10  FILLER      PIC X(15) VALUE '400018 00289699'.
521200         10  FILLER      PIC X(15) VALUE '400021 00217347'.
521300         10  FILLER      PIC X(15) VALUE '400022 00345908'.
521400         10  FILLER      PIC X(15) VALUE '400032 00540705'.
521500         10  FILLER      PIC X(15) VALUE '400044 00368787'.
521600         10  FILLER      PIC X(15) VALUE '400048 00617955'.
521700         10  FILLER      PIC X(15) VALUE '400061 00929968'.
521800         10  FILLER      PIC X(15) VALUE '400079 00390848'.
521900         10  FILLER      PIC X(15) VALUE '400087 00444183'.
522000         10  FILLER      PIC X(15) VALUE '400098 00730111'.
522100         10  FILLER      PIC X(15) VALUE '400102 00486472'.
522200         10  FILLER      PIC X(15) VALUE '400104 00186640'.
522300         10  FILLER      PIC X(15) VALUE '400105 00641494'.
522400         10  FILLER      PIC X(15) VALUE '400110 00219830'.
522500         10  FILLER      PIC X(15) VALUE '400111 00302830'.
522600         10  FILLER      PIC X(15) VALUE '400112 00537160'.
522700         10  FILLER      PIC X(15) VALUE '400113 00373321'.
522800         10  FILLER      PIC X(15) VALUE '400114 00274888'.
522900         10  FILLER      PIC X(15) VALUE '400115 00730560'.
523000         10  FILLER      PIC X(15) VALUE '400117 00312055'.
523100         10  FILLER      PIC X(15) VALUE '400118 00240581'.
523200         10  FILLER      PIC X(15) VALUE '400120 00438239'.
523300         10  FILLER      PIC X(15) VALUE '400123 00255831'.
523400         10  FILLER      PIC X(15) VALUE '400125 00436990'.
523500         10  FILLER      PIC X(15) VALUE '400126 00241451'.
523600         10  FILLER      PIC X(15) VALUE '400127 02811259'.
523700         10  FILLER      PIC X(15) VALUE '400128 01317393'.
523800         10  FILLER      PIC X(15) VALUE '410001 00105602'.
523900         10  FILLER      PIC X(15) VALUE '410004 00075074'.
524000         10  FILLER      PIC X(15) VALUE '410006 00052132'.
524100         10  FILLER      PIC X(15) VALUE '410007 00139178'.
524200         10  FILLER      PIC X(15) VALUE '410009 00091720'.
524300         10  FILLER      PIC X(15) VALUE '410010 01738984'.
524400         10  FILLER      PIC X(15) VALUE '410011 00105434'.
524500         10  FILLER      PIC X(15) VALUE '420002 00080465'.
524600         10  FILLER      PIC X(15) VALUE '420004 00206948'.
524700         10  FILLER      PIC X(15) VALUE '420005 00083771'.
524800         10  FILLER      PIC X(15) VALUE '420007 00099057'.
524900         10  FILLER      PIC X(15) VALUE '420009 00035853'.
525000         10  FILLER      PIC X(15) VALUE '420010 00074642'.
525100         10  FILLER      PIC X(15) VALUE '420011 00028603'.
525200         10  FILLER      PIC X(15) VALUE '420015 00070187'.
525300         10  FILLER      PIC X(15) VALUE '420016 00026331'.
525400         10  FILLER      PIC X(15) VALUE '420018 00248055'.
525500         10  FILLER      PIC X(15) VALUE '420019 00037964'.
525600         10  FILLER      PIC X(15) VALUE '420020 00065877'.
525700         10  FILLER      PIC X(15) VALUE '420023 00038802'.
525800         10  FILLER      PIC X(15) VALUE '420027 00059211'.
525900         10  FILLER      PIC X(15) VALUE '420030 00097774'.
526000         10  FILLER      PIC X(15) VALUE '420033 00056904'.
526100         10  FILLER      PIC X(15) VALUE '420036 00064734'.
526200         10  FILLER      PIC X(15) VALUE '420038 00068924'.
526300         10  FILLER      PIC X(15) VALUE '420039 00037646'.
526400         10  FILLER      PIC X(15) VALUE '420043 00071846'.
526500         10  FILLER      PIC X(15) VALUE '420048 00058080'.
526600         10  FILLER      PIC X(15) VALUE '420049 00119274'.
526700         10  FILLER      PIC X(15) VALUE '420051 00101307'.
526800         10  FILLER      PIC X(15) VALUE '420053 00057060'.
526900         10  FILLER      PIC X(15) VALUE '420054 00076512'.
527000         10  FILLER      PIC X(15) VALUE '420055 00080151'.
527100         10  FILLER      PIC X(15) VALUE '420057 00028987'.
527200         10  FILLER      PIC X(15) VALUE '420062 00057889'.
527300         10  FILLER      PIC X(15) VALUE '420065 00077596'.
527400         10  FILLER      PIC X(15) VALUE '420066 00040136'.
527500         10  FILLER      PIC X(15) VALUE '420067 00074459'.
527600         10  FILLER      PIC X(15) VALUE '420068 00103955'.
527700         10  FILLER      PIC X(15) VALUE '420069 00099370'.
527800         10  FILLER      PIC X(15) VALUE '420070 00099726'.
527900         10  FILLER      PIC X(15) VALUE '420071 00080193'.
528000         10  FILLER      PIC X(15) VALUE '420072 00036547'.
528100         10  FILLER      PIC X(15) VALUE '420073 00081184'.
528200         10  FILLER      PIC X(15) VALUE '420078 00171583'.
528300         10  FILLER      PIC X(15) VALUE '420079 00070506'.
528400         10  FILLER      PIC X(15) VALUE '420080 00031105'.
528500         10  FILLER      PIC X(15) VALUE '420082 00084486'.
528600         10  FILLER      PIC X(15) VALUE '420083 00051749'.
528700         10  FILLER      PIC X(15) VALUE '420085 00036550'.
528800         10  FILLER      PIC X(15) VALUE '420086 00154213'.
528900         10  FILLER      PIC X(15) VALUE '420087 00033069'.
529000         10  FILLER      PIC X(15) VALUE '420089 00046310'.
529100         10  FILLER      PIC X(15) VALUE '420091 00068256'.
529200         10  FILLER      PIC X(15) VALUE '420105 00000000'.
529300         10  FILLER      PIC X(15) VALUE '430005 00026369'.
529400         10  FILLER      PIC X(15) VALUE '430012 00041189'.
529500         10  FILLER      PIC X(15) VALUE '430013 00034426'.
529600         10  FILLER      PIC X(15) VALUE '430015 00050652'.
529700         10  FILLER      PIC X(15) VALUE '430016 00114431'.
529800         10  FILLER      PIC X(15) VALUE '430027 00085590'.
529900         10  FILLER      PIC X(15) VALUE '430048 00047106'.
530000         10  FILLER      PIC X(15) VALUE '430077 00110616'.
530100         10  FILLER      PIC X(15) VALUE '430081 00334872'.
530200         10  FILLER      PIC X(15) VALUE '430083 00321269'.
530300         10  FILLER      PIC X(15) VALUE '430084 00181407'.
530400         10  FILLER      PIC X(15) VALUE '430090 00006640'.
530500         10  FILLER      PIC X(15) VALUE '440002 00065849'.
530600         10  FILLER      PIC X(15) VALUE '440003 00057056'.
530700         10  FILLER      PIC X(15) VALUE '440006 00074232'.
530800         10  FILLER      PIC X(15) VALUE '440007 00037564'.
530900         10  FILLER      PIC X(15) VALUE '440008 00017626'.
531000         10  FILLER      PIC X(15) VALUE '440009 00041603'.
531100         10  FILLER      PIC X(15) VALUE '440010 00022386'.
531200         10  FILLER      PIC X(15) VALUE '440011 00049996'.
531300         10  FILLER      PIC X(15) VALUE '440012 00047176'.
531400         10  FILLER      PIC X(15) VALUE '440015 00152026'.
531500         10  FILLER      PIC X(15) VALUE '440017 00074431'.
531600         10  FILLER      PIC X(15) VALUE '440018 00067521'.
531700         10  FILLER      PIC X(15) VALUE '440020 00043696'.
531800         10  FILLER      PIC X(15) VALUE '440025 00049779'.
531900         10  FILLER      PIC X(15) VALUE '440030 00062311'.
532000         10  FILLER      PIC X(15) VALUE '440031 00034810'.
532100         10  FILLER      PIC X(15) VALUE '440032 00041883'.
532200         10  FILLER      PIC X(15) VALUE '440033 00039905'.
532300         10  FILLER      PIC X(15) VALUE '440034 00050897'.
532400         10  FILLER      PIC X(15) VALUE '440035 00060820'.
532500         10  FILLER      PIC X(15) VALUE '440039 00207867'.
532600         10  FILLER      PIC X(15) VALUE '440040 00020339'.
532700         10  FILLER      PIC X(15) VALUE '440046 00046236'.
532800         10  FILLER      PIC X(15) VALUE '440048 00077816'.
532900         10  FILLER      PIC X(15) VALUE '440049 00139600'.
533000         10  FILLER      PIC X(15) VALUE '440050 00094844'.
533100         10  FILLER      PIC X(15) VALUE '440051 00052014'.
533200         10  FILLER      PIC X(15) VALUE '440053 00064546'.
533300         10  FILLER      PIC X(15) VALUE '440054 00023313'.
533400         10  FILLER      PIC X(15) VALUE '440057 00038099'.
533500         10  FILLER      PIC X(15) VALUE '440058 00043774'.
533600         10  FILLER      PIC X(15) VALUE '440059 00047535'.
533700         10  FILLER      PIC X(15) VALUE '440060 00027774'.
533800         10  FILLER      PIC X(15) VALUE '440061 00043921'.
533900         10  FILLER      PIC X(15) VALUE '440063 00100645'.
534000         10  FILLER      PIC X(15) VALUE '440064 00042720'.
534100         10  FILLER      PIC X(15) VALUE '440065 00081143'.
534200         10  FILLER      PIC X(15) VALUE '440067 00060404'.
534300         10  FILLER      PIC X(15) VALUE '440068 00061844'.
534400         10  FILLER      PIC X(15) VALUE '440070 00014443'.
534500         10  FILLER      PIC X(15) VALUE '440072 00040470'.
534600         10  FILLER      PIC X(15) VALUE '440073 00046076'.
534700         10  FILLER      PIC X(15) VALUE '440081 00079988'.
534800         10  FILLER      PIC X(15) VALUE '440083 00035745'.
534900         10  FILLER      PIC X(15) VALUE '440084 00057474'.
535000         10  FILLER      PIC X(15) VALUE '440102 00051298'.
535100         10  FILLER      PIC X(15) VALUE '440104 00208810'.
535200         10  FILLER      PIC X(15) VALUE '440109 00085770'.
535300         10  FILLER      PIC X(15) VALUE '440111 00451897'.
535400         10  FILLER      PIC X(15) VALUE '440115 00028214'.
535500         10  FILLER      PIC X(15) VALUE '440120 00060363'.
535600         10  FILLER      PIC X(15) VALUE '440125 00104236'.
535700         10  FILLER      PIC X(15) VALUE '440130 00036269'.
535800         10  FILLER      PIC X(15) VALUE '440131 00122267'.
535900         10  FILLER      PIC X(15) VALUE '440132 00031784'.
536000         10  FILLER      PIC X(15) VALUE '440133 00130607'.
536100         10  FILLER      PIC X(15) VALUE '440137 00026047'.
536200         10  FILLER      PIC X(15) VALUE '440141 00033758'.
536300         10  FILLER      PIC X(15) VALUE '440144 00044252'.
536400         10  FILLER      PIC X(15) VALUE '440148 00026365'.
536500         10  FILLER      PIC X(15) VALUE '440150 00050687'.
536600         10  FILLER      PIC X(15) VALUE '440151 00065074'.
536700         10  FILLER      PIC X(15) VALUE '440152 01188265'.
536800         10  FILLER      PIC X(15) VALUE '440153 00049296'.
536900         10  FILLER      PIC X(15) VALUE '440156 00174745'.
537000         10  FILLER      PIC X(15) VALUE '440159 00120368'.
537100         10  FILLER      PIC X(15) VALUE '440161 00094046'.
537200         10  FILLER      PIC X(15) VALUE '440173 00067729'.
537300         10  FILLER      PIC X(15) VALUE '440174 00033532'.
537400         10  FILLER      PIC X(15) VALUE '440175 00046893'.
537500         10  FILLER      PIC X(15) VALUE '440176 00086033'.
537600         10  FILLER      PIC X(15) VALUE '440180 00097467'.
537700         10  FILLER      PIC X(15) VALUE '440181 00022128'.
537800         10  FILLER      PIC X(15) VALUE '440182 00073886'.
537900         10  FILLER      PIC X(15) VALUE '440183 00130853'.
538000         10  FILLER      PIC X(15) VALUE '440184 00085073'.
538100         10  FILLER      PIC X(15) VALUE '440185 00058869'.
538200         10  FILLER      PIC X(15) VALUE '440187 00047173'.
538300         10  FILLER      PIC X(15) VALUE '440189 00049274'.
538400         10  FILLER      PIC X(15) VALUE '440192 00026159'.
538500         10  FILLER      PIC X(15) VALUE '440193 00079823'.
538600         10  FILLER      PIC X(15) VALUE '440194 00064408'.
538700         10  FILLER      PIC X(15) VALUE '440197 00047930'.
538800         10  FILLER      PIC X(15) VALUE '440200 00025378'.
538900         10  FILLER      PIC X(15) VALUE '440227 00091803'.
539000         10  FILLER      PIC X(15) VALUE '440228 00074349'.
539100         10  FILLER      PIC X(15) VALUE '450002 00247464'.
539200         10  FILLER      PIC X(15) VALUE '450005 00089965'.
539300         10  FILLER      PIC X(15) VALUE '450010 00052867'.
539400         10  FILLER      PIC X(15) VALUE '450011 00052182'.
539500         10  FILLER      PIC X(15) VALUE '450015 01044680'.
539600         10  FILLER      PIC X(15) VALUE '450018 00380120'.
539700         10  FILLER      PIC X(15) VALUE '450021 00098101'.
539800         10  FILLER      PIC X(15) VALUE '450023 00036878'.
539900         10  FILLER      PIC X(15) VALUE '450024 00588372'.
540000         10  FILLER      PIC X(15) VALUE '450028 00245851'.
540100         10  FILLER      PIC X(15) VALUE '450029 00182464'.
540200         10  FILLER      PIC X(15) VALUE '450032 00079659'.
540300         10  FILLER      PIC X(15) VALUE '450033 00137060'.
540400         10  FILLER      PIC X(15) VALUE '450034 00066023'.
540500         10  FILLER      PIC X(15) VALUE '450035 00492189'.
540600         10  FILLER      PIC X(15) VALUE '450037 00099410'.
540700         10  FILLER      PIC X(15) VALUE '450039 00596982'.
540800         10  FILLER      PIC X(15) VALUE '450040 00054823'.
540900         10  FILLER      PIC X(15) VALUE '450042 00046515'.
541000         10  FILLER      PIC X(15) VALUE '450044 00082803'.
541100         10  FILLER      PIC X(15) VALUE '450046 00127788'.
541200         10  FILLER      PIC X(15) VALUE '450051 00167682'.
541300         10  FILLER      PIC X(15) VALUE '450052 00032025'.
541400         10  FILLER      PIC X(15) VALUE '450054 00091019'.
541500         10  FILLER      PIC X(15) VALUE '450055 00054188'.
541600         10  FILLER      PIC X(15) VALUE '450056 00061403'.
541700         10  FILLER      PIC X(15) VALUE '450058 00120319'.
541800         10  FILLER      PIC X(15) VALUE '450064 00070637'.
541900         10  FILLER      PIC X(15) VALUE '450068 00358534'.
542000         10  FILLER      PIC X(15) VALUE '450072 00033794'.
542100         10  FILLER      PIC X(15) VALUE '450073 00065603'.
542200         10  FILLER      PIC X(15) VALUE '450078 00045864'.
542300         10  FILLER      PIC X(15) VALUE '450079 00093851'.
542400         10  FILLER      PIC X(15) VALUE '450080 00085190'.
542500         10  FILLER      PIC X(15) VALUE '450082 00096991'.
542600         10  FILLER      PIC X(15) VALUE '450083 00072657'.
542700         10  FILLER      PIC X(15) VALUE '450085 00052562'.
542800         10  FILLER      PIC X(15) VALUE '450090 00080463'.
542900         10  FILLER      PIC X(15) VALUE '450092 00144680'.
543000         10  FILLER      PIC X(15) VALUE '450097 00202479'.
543100         10  FILLER      PIC X(15) VALUE '450099 00042062'.
543200         10  FILLER      PIC X(15) VALUE '450101 00138860'.
543300         10  FILLER      PIC X(15) VALUE '450102 00056598'.
543400         10  FILLER      PIC X(15) VALUE '450104 00055339'.
543500         10  FILLER      PIC X(15) VALUE '450107 00175708'.
543600         10  FILLER      PIC X(15) VALUE '450119 00243398'.
543700         10  FILLER      PIC X(15) VALUE '450124 00332791'.
543800         10  FILLER      PIC X(15) VALUE '450128 00156862'.
543900         10  FILLER      PIC X(15) VALUE '450130 00195393'.
544000         10  FILLER      PIC X(15) VALUE '450132 00090108'.
544100         10  FILLER      PIC X(15) VALUE '450133 00071985'.
544200         10  FILLER      PIC X(15) VALUE '450135 00095322'.
544300         10  FILLER      PIC X(15) VALUE '450137 00150107'.
544400         10  FILLER      PIC X(15) VALUE '450144 00169354'.
544500         10  FILLER      PIC X(15) VALUE '450147 00077057'.
544600         10  FILLER      PIC X(15) VALUE '450148 00066103'.
544700         10  FILLER      PIC X(15) VALUE '450152 00084807'.
544800         10  FILLER      PIC X(15) VALUE '450154 00075632'.
544900         10  FILLER      PIC X(15) VALUE '450155 00204833'.
545000         10  FILLER      PIC X(15) VALUE '450163 00095500'.
545100         10  FILLER      PIC X(15) VALUE '450165 00055179'.
545200         10  FILLER      PIC X(15) VALUE '450176 00216163'.
545300         10  FILLER      PIC X(15) VALUE '450177 00091583'.
545400         10  FILLER      PIC X(15) VALUE '450178 00067389'.
545500         10  FILLER      PIC X(15) VALUE '450184 00133790'.
545600         10  FILLER      PIC X(15) VALUE '450187 00064538'.
545700         10  FILLER      PIC X(15) VALUE '450188 00023488'.
545800         10  FILLER      PIC X(15) VALUE '450192 00041982'.
545900         10  FILLER      PIC X(15) VALUE '450193 00078294'.
546000         10  FILLER      PIC X(15) VALUE '450194 00077197'.
546100         10  FILLER      PIC X(15) VALUE '450196 00038982'.
546200         10  FILLER      PIC X(15) VALUE '450200 00100529'.
546300         10  FILLER      PIC X(15) VALUE '450203 00030358'.
546400         10  FILLER      PIC X(15) VALUE '450209 00165714'.
546500         10  FILLER      PIC X(15) VALUE '450210 00038415'.
546600         10  FILLER      PIC X(15) VALUE '450211 00049069'.
546700         10  FILLER      PIC X(15) VALUE '450213 00489851'.
546800         10  FILLER      PIC X(15) VALUE '450214 00071365'.
546900         10  FILLER      PIC X(15) VALUE '450219 00039153'.
547000         10  FILLER      PIC X(15) VALUE '450221 00073199'.
547100         10  FILLER      PIC X(15) VALUE '450222 00087590'.
547200         10  FILLER      PIC X(15) VALUE '450229 00057958'.
547300         10  FILLER      PIC X(15) VALUE '450231 00047164'.
547400         10  FILLER      PIC X(15) VALUE '450235 00046084'.
547500         10  FILLER      PIC X(15) VALUE '450236 00081549'.
547600         10  FILLER      PIC X(15) VALUE '450237 00189363'.
547700         10  FILLER      PIC X(15) VALUE '450253 00019592'.
547800         10  FILLER      PIC X(15) VALUE '450270 00013772'.
547900         10  FILLER      PIC X(15) VALUE '450272 00077218'.
548000         10  FILLER      PIC X(15) VALUE '450280 00063371'.
548100         10  FILLER      PIC X(15) VALUE '450283 00041841'.
548200         10  FILLER      PIC X(15) VALUE '450289 01407850'.
548300         10  FILLER      PIC X(15) VALUE '450292 00057612'.
548400         10  FILLER      PIC X(15) VALUE '450293 00164064'.
548500         10  FILLER      PIC X(15) VALUE '450296 00106356'.
548600         10  FILLER      PIC X(15) VALUE '450299 00083078'.
548700         10  FILLER      PIC X(15) VALUE '450306 00033524'.
548800         10  FILLER      PIC X(15) VALUE '450324 00082767'.
548900         10  FILLER      PIC X(15) VALUE '450330 00127829'.
549000         10  FILLER      PIC X(15) VALUE '450340 00066747'.
549100         10  FILLER      PIC X(15) VALUE '450346 00104384'.
549200         10  FILLER      PIC X(15) VALUE '450347 00045104'.
549300         10  FILLER      PIC X(15) VALUE '450348 00050847'.
549400         10  FILLER      PIC X(15) VALUE '450351 00033597'.
549500         10  FILLER      PIC X(15) VALUE '450352 00062947'.
549600         10  FILLER      PIC X(15) VALUE '450358 00040856'.
549700         10  FILLER      PIC X(15) VALUE '450369 00060412'.
549800         10  FILLER      PIC X(15) VALUE '450370 00040520'.
549900         10  FILLER      PIC X(15) VALUE '450379 00034472'.
550000         10  FILLER      PIC X(15) VALUE '450388 00131648'.
550100         10  FILLER      PIC X(15) VALUE '450389 00045766'.
550200         10  FILLER      PIC X(15) VALUE '450395 00056008'.
550300         10  FILLER      PIC X(15) VALUE '450399 00049665'.
550400         10  FILLER      PIC X(15) VALUE '450400 00018581'.
550500         10  FILLER      PIC X(15) VALUE '450403 00077283'.
550600         10  FILLER      PIC X(15) VALUE '450411 00027195'.
550700         10  FILLER      PIC X(15) VALUE '450424 00084744'.
550800         10  FILLER      PIC X(15) VALUE '450431 00141714'.
550900         10  FILLER      PIC X(15) VALUE '450446 00413236'.
551000         10  FILLER      PIC X(15) VALUE '450447 00048085'.
551100         10  FILLER      PIC X(15) VALUE '450460 00019290'.
551200         10  FILLER      PIC X(15) VALUE '450462 00110999'.
551300         10  FILLER      PIC X(15) VALUE '450465 00059937'.
551400         10  FILLER      PIC X(15) VALUE '450469 00035682'.
551500         10  FILLER      PIC X(15) VALUE '450475 00049738'.
551600         10  FILLER      PIC X(15) VALUE '450484 00044589'.
551700         10  FILLER      PIC X(15) VALUE '450488 00033502'.
551800         10  FILLER      PIC X(15) VALUE '450489 00052490'.
551900         10  FILLER      PIC X(15) VALUE '450497 00015971'.
552000         10  FILLER      PIC X(15) VALUE '450508 00073122'.
552100         10  FILLER      PIC X(15) VALUE '450518 00098370'.
552200         10  FILLER      PIC X(15) VALUE '450539 00130530'.
552300         10  FILLER      PIC X(15) VALUE '450558 00070165'.
552400         10  FILLER      PIC X(15) VALUE '450565 00065229'.
552500         10  FILLER      PIC X(15) VALUE '450571 00052055'.
552600         10  FILLER      PIC X(15) VALUE '450573 00091964'.
552700         10  FILLER      PIC X(15) VALUE '450580 00045006'.
552800         10  FILLER      PIC X(15) VALUE '450586 00030832'.
552900         10  FILLER      PIC X(15) VALUE '450587 00049878'.
553000         10  FILLER      PIC X(15) VALUE '450591 00162034'.
553100         10  FILLER      PIC X(15) VALUE '450596 00031248'.
553200         10  FILLER      PIC X(15) VALUE '450597 00054129'.
553300         10  FILLER      PIC X(15) VALUE '450604 00029050'.
553400         10  FILLER      PIC X(15) VALUE '450605 00041718'.
553500         10  FILLER      PIC X(15) VALUE '450610 00060493'.
553600         10  FILLER      PIC X(15) VALUE '450617 00103852'.
553700         10  FILLER      PIC X(15) VALUE '450620 00112748'.
553800         10  FILLER      PIC X(15) VALUE '450634 00041788'.
553900         10  FILLER      PIC X(15) VALUE '450638 00146257'.
554000         10  FILLER      PIC X(15) VALUE '450639 00047029'.
554100         10  FILLER      PIC X(15) VALUE '450643 00218651'.
554200         10  FILLER      PIC X(15) VALUE '450644 00173037'.
554300         10  FILLER      PIC X(15) VALUE '450647 00158401'.
554400         10  FILLER      PIC X(15) VALUE '450651 00081333'.
554500         10  FILLER      PIC X(15) VALUE '450653 00045673'.
554600         10  FILLER      PIC X(15) VALUE '450654 00105513'.
554700         10  FILLER      PIC X(15) VALUE '450656 00036891'.
554800         10  FILLER      PIC X(15) VALUE '450659 00157968'.
554900         10  FILLER      PIC X(15) VALUE '450661 00396216'.
555000         10  FILLER      PIC X(15) VALUE '450662 00230370'.
555100         10  FILLER      PIC X(15) VALUE '450668 00103372'.
555200         10  FILLER      PIC X(15) VALUE '450669 00099640'.
555300         10  FILLER      PIC X(15) VALUE '450670 00035184'.
555400         10  FILLER      PIC X(15) VALUE '450672 00039771'.
555500         10  FILLER      PIC X(15) VALUE '450674 06895469'.
555600         10  FILLER      PIC X(15) VALUE '450675 00189479'.
555700         10  FILLER      PIC X(15) VALUE '450677 00065857'.
555800         10  FILLER      PIC X(15) VALUE '450678 00077682'.
555900         10  FILLER      PIC X(15) VALUE '450684 00115278'.
556000         10  FILLER      PIC X(15) VALUE '450686 00146477'.
556100         10  FILLER      PIC X(15) VALUE '450688 00062075'.
556200         10  FILLER      PIC X(15) VALUE '450690 00026362'.
556300         10  FILLER      PIC X(15) VALUE '450694 00017895'.
556400         10  FILLER      PIC X(15) VALUE '450697 00309587'.
556500         10  FILLER      PIC X(15) VALUE '450698 00102419'.
556600         10  FILLER      PIC X(15) VALUE '450702 00060554'.
556700         10  FILLER      PIC X(15) VALUE '450711 00197457'.
556800         10  FILLER      PIC X(15) VALUE '450713 00055981'.
556900         10  FILLER      PIC X(15) VALUE '450716 00316459'.
557000         10  FILLER      PIC X(15) VALUE '450718 00076532'.
557100         10  FILLER      PIC X(15) VALUE '450723 00096876'.
557200         10  FILLER      PIC X(15) VALUE '450730 00121964'.
557300         10  FILLER      PIC X(15) VALUE '450742 00094379'.
557400         10  FILLER      PIC X(15) VALUE '450743 00076636'.
557500         10  FILLER      PIC X(15) VALUE '450746 00014129'.
557600         10  FILLER      PIC X(15) VALUE '450747 00090470'.
557700         10  FILLER      PIC X(15) VALUE '450749 00038874'.
557800         10  FILLER      PIC X(15) VALUE '450755 00112402'.
557900         10  FILLER      PIC X(15) VALUE '450770 00045883'.
558000         10  FILLER      PIC X(15) VALUE '450771 00085587'.
558100         10  FILLER      PIC X(15) VALUE '450775 00108682'.
558200         10  FILLER      PIC X(15) VALUE '450779 00077860'.
558300         10  FILLER      PIC X(15) VALUE '450788 00164135'.
558400         10  FILLER      PIC X(15) VALUE '450795 00075956'.
558500         10  FILLER      PIC X(15) VALUE '450801 00053096'.
558600         10  FILLER      PIC X(15) VALUE '450803 00273472'.
558700         10  FILLER      PIC X(15) VALUE '450809 00106602'.
558800         10  FILLER      PIC X(15) VALUE '450820 00050393'.
558900         10  FILLER      PIC X(15) VALUE '450822 00079407'.
559000         10  FILLER      PIC X(15) VALUE '450825 00034643'.
559100         10  FILLER      PIC X(15) VALUE '450828 00102862'.
559200         10  FILLER      PIC X(15) VALUE '450831 00010194'.
559300         10  FILLER      PIC X(15) VALUE '450832 00096126'.
559400         10  FILLER      PIC X(15) VALUE '450833 00078772'.
559500         10  FILLER      PIC X(15) VALUE '450840 00134257'.
559600         10  FILLER      PIC X(15) VALUE '450841 00310099'.
559700         10  FILLER      PIC X(15) VALUE '450844 00097259'.
559800         10  FILLER      PIC X(15) VALUE '450845 00019021'.
559900         10  FILLER      PIC X(15) VALUE '450847 00089616'.
560000         10  FILLER      PIC X(15) VALUE '450848 00121101'.
560100         10  FILLER      PIC X(15) VALUE '450855 00097529'.
560200         10  FILLER      PIC X(15) VALUE '450862 00075209'.
560300         10  FILLER      PIC X(15) VALUE '450867 00048640'.
560400         10  FILLER      PIC X(15) VALUE '450869 00339316'.
560500         10  FILLER      PIC X(15) VALUE '450877 00047917'.
560600         10  FILLER      PIC X(15) VALUE '450884 00022287'.
560700         10  FILLER      PIC X(15) VALUE '460001 00151029'.
560800         10  FILLER      PIC X(15) VALUE '460003 00053375'.
560900         10  FILLER      PIC X(15) VALUE '460004 00099637'.
561000         10  FILLER      PIC X(15) VALUE '460005 00125451'.
561100         10  FILLER      PIC X(15) VALUE '460006 00146861'.
561200         10  FILLER      PIC X(15) VALUE '460007 00078046'.
561300         10  FILLER      PIC X(15) VALUE '460009 00232729'.
561400         10  FILLER      PIC X(15) VALUE '460010 00089657'.
561500         10  FILLER      PIC X(15) VALUE '460011 00059230'.
561600         10  FILLER      PIC X(15) VALUE '460013 00087480'.
561700         10  FILLER      PIC X(15) VALUE '460014 00059058'.
561800         10  FILLER      PIC X(15) VALUE '460015 00158823'.
561900         10  FILLER      PIC X(15) VALUE '460017 00123094'.
562000         10  FILLER      PIC X(15) VALUE '460019 00082956'.
562100         10  FILLER      PIC X(15) VALUE '460021 00051439'.
562200         10  FILLER      PIC X(15) VALUE '460023 00133782'.
562300         10  FILLER      PIC X(15) VALUE '460026 00065898'.
562400         10  FILLER      PIC X(15) VALUE '460030 00077086'.
562500         10  FILLER      PIC X(15) VALUE '460035 00089829'.
562600         10  FILLER      PIC X(15) VALUE '460039 00058413'.
562700         10  FILLER      PIC X(15) VALUE '460041 00104377'.
562800         10  FILLER      PIC X(15) VALUE '460042 00053388'.
562900         10  FILLER      PIC X(15) VALUE '460043 08826144'.
563000         10  FILLER      PIC X(15) VALUE '460047 00085907'.
563100         10  FILLER      PIC X(15) VALUE '460051 00153639'.
563200         10  FILLER      PIC X(15) VALUE '460052 00130931'.
563300         10  FILLER      PIC X(15) VALUE '460058 00251639'.
563400         10  FILLER      PIC X(15) VALUE '470001 00049861'.
563500         10  FILLER      PIC X(15) VALUE '470003 00098872'.
563600         10  FILLER      PIC X(15) VALUE '470005 00063667'.
563700         10  FILLER      PIC X(15) VALUE '470011 00050390'.
563800         10  FILLER      PIC X(15) VALUE '470012 00038343'.
563900         10  FILLER      PIC X(15) VALUE '470024 00046286'.
564000         10  FILLER      PIC X(15) VALUE '490001 00074212'.
564100         10  FILLER      PIC X(15) VALUE '490002 00044213'.
564200         10  FILLER      PIC X(15) VALUE '490004 00039835'.
564300         10  FILLER      PIC X(15) VALUE '490005 00050586'.
564400         10  FILLER      PIC X(15) VALUE '490007 00125312'.
564500         10  FILLER      PIC X(15) VALUE '490009 00157067'.
564600         10  FILLER      PIC X(15) VALUE '490011 00050771'.
564700         10  FILLER      PIC X(15) VALUE '490012 00048303'.
564800         10  FILLER      PIC X(15) VALUE '490013 00048938'.
564900         10  FILLER      PIC X(15) VALUE '490017 00082996'.
565000         10  FILLER      PIC X(15) VALUE '490018 00028236'.
565100         10  FILLER      PIC X(15) VALUE '490019 00042489'.
565200         10  FILLER      PIC X(15) VALUE '490020 00040384'.
565300         10  FILLER      PIC X(15) VALUE '490021 00049101'.
565400         10  FILLER      PIC X(15) VALUE '490022 00059984'.
565500         10  FILLER      PIC X(15) VALUE '490023 00039570'.
565600         10  FILLER      PIC X(15) VALUE '490024 00103842'.
565700         10  FILLER      PIC X(15) VALUE '490032 00227941'.
565800         10  FILLER      PIC X(15) VALUE '490033 00052433'.
565900         10  FILLER      PIC X(15) VALUE '490037 00053715'.
566000         10  FILLER      PIC X(15) VALUE '490040 00088001'.
566100         10  FILLER      PIC X(15) VALUE '490041 00047726'.
566200         10  FILLER      PIC X(15) VALUE '490042 00049519'.
566300         10  FILLER      PIC X(15) VALUE '490043 00056991'.
566400         10  FILLER      PIC X(15) VALUE '490044 00055501'.
566500         10  FILLER      PIC X(15) VALUE '490045 00075682'.
566600         10  FILLER      PIC X(15) VALUE '490046 00045269'.
566700         10  FILLER      PIC X(15) VALUE '490050 00042814'.
566800         10  FILLER      PIC X(15) VALUE '490052 00083045'.
566900         10  FILLER      PIC X(15) VALUE '490053 00045479'.
567000         10  FILLER      PIC X(15) VALUE '490059 00060717'.
567100         10  FILLER      PIC X(15) VALUE '490060 00054805'.
567200         10  FILLER      PIC X(15) VALUE '490063 00147558'.
567300         10  FILLER      PIC X(15) VALUE '490067 00066568'.
567400         10  FILLER      PIC X(15) VALUE '490069 00042435'.
567500         10  FILLER      PIC X(15) VALUE '490075 00053903'.
567600         10  FILLER      PIC X(15) VALUE '490079 00045729'.
567700         10  FILLER      PIC X(15) VALUE '490088 00000000'.
567800         10  FILLER      PIC X(15) VALUE '490089 00053073'.
567900         10  FILLER      PIC X(15) VALUE '490090 00054318'.
568000         10  FILLER      PIC X(15) VALUE '490092 00044415'.
568100         10  FILLER      PIC X(15) VALUE '490093 00047070'.
568200         10  FILLER      PIC X(15) VALUE '490094 00178708'.
568300         10  FILLER      PIC X(15) VALUE '490097 00040560'.
568400         10  FILLER      PIC X(15) VALUE '490098 00048388'.
568500         10  FILLER      PIC X(15) VALUE '490101 00062405'.
568600         10  FILLER      PIC X(15) VALUE '490110 00033052'.
568700         10  FILLER      PIC X(15) VALUE '490111 00033574'.
568800         10  FILLER      PIC X(15) VALUE '490112 00072572'.
568900         10  FILLER      PIC X(15) VALUE '490113 00088750'.
569000         10  FILLER      PIC X(15) VALUE '490114 00054392'.
569100         10  FILLER      PIC X(15) VALUE '490115 00048262'.
569200         10  FILLER      PIC X(15) VALUE '490117 00021185'.
569300         10  FILLER      PIC X(15) VALUE '490118 00068457'.
569400         10  FILLER      PIC X(15) VALUE '490119 00044978'.
569500         10  FILLER      PIC X(15) VALUE '490120 00070034'.
569600         10  FILLER      PIC X(15) VALUE '490127 00032963'.
569700         10  FILLER      PIC X(15) VALUE '490134 00000000'.
569800         10  FILLER      PIC X(15) VALUE '490135 00062127'.
569900         10  FILLER      PIC X(15) VALUE '490136 00043602'.
570000         10  FILLER      PIC X(15) VALUE '490141 00067569'.
570100         10  FILLER      PIC X(15) VALUE '500001 00033593'.
570200         10  FILLER      PIC X(15) VALUE '500002 00048394'.
570300         10  FILLER      PIC X(15) VALUE '500003 00074788'.
570400         10  FILLER      PIC X(15) VALUE '500008 00198386'.
570500         10  FILLER      PIC X(15) VALUE '500011 00080680'.
570600         10  FILLER      PIC X(15) VALUE '500012 00054242'.
570700         10  FILLER      PIC X(15) VALUE '500014 00106055'.
570800         10  FILLER      PIC X(15) VALUE '500015 00077408'.
570900         10  FILLER      PIC X(15) VALUE '500016 00060717'.
571000         10  FILLER      PIC X(15) VALUE '500019 00057639'.
571100         10  FILLER      PIC X(15) VALUE '500021 00057457'.
571200         10  FILLER      PIC X(15) VALUE '500024 00073562'.
571300         10  FILLER      PIC X(15) VALUE '500025 00034728'.
571400         10  FILLER      PIC X(15) VALUE '500026 00086900'.
571500         10  FILLER      PIC X(15) VALUE '500027 00161749'.
571600         10  FILLER      PIC X(15) VALUE '500030 00081978'.
571700         10  FILLER      PIC X(15) VALUE '500031 00057928'.
571800         10  FILLER      PIC X(15) VALUE '500033 00124578'.
571900         10  FILLER      PIC X(15) VALUE '500036 00114783'.
572000         10  FILLER      PIC X(15) VALUE '500037 00206635'.
572100         10  FILLER      PIC X(15) VALUE '500039 00053039'.
572200         10  FILLER      PIC X(15) VALUE '500041 00106649'.
572300         10  FILLER      PIC X(15) VALUE '500044 00127356'.
572400         10  FILLER      PIC X(15) VALUE '500049 00060396'.
572500         10  FILLER      PIC X(15) VALUE '500050 00099762'.
572600         10  FILLER      PIC X(15) VALUE '500052 00046561'.
572700         10  FILLER      PIC X(15) VALUE '500053 00097423'.
572800         10  FILLER      PIC X(15) VALUE '500054 00140585'.
572900         10  FILLER      PIC X(15) VALUE '500058 00103550'.
573000         10  FILLER      PIC X(15) VALUE '500060 00059517'.
573100         10  FILLER      PIC X(15) VALUE '500064 00217862'.
573200         10  FILLER      PIC X(15) VALUE '500072 00032165'.
573300         10  FILLER      PIC X(15) VALUE '500077 00068887'.
573400         10  FILLER      PIC X(15) VALUE '500079 00053194'.
573500         10  FILLER      PIC X(15) VALUE '500084 00048556'.
573600         10  FILLER      PIC X(15) VALUE '500088 00114220'.
573700         10  FILLER      PIC X(15) VALUE '500108 00105109'.
573800         10  FILLER      PIC X(15) VALUE '500119 00046040'.
573900         10  FILLER      PIC X(15) VALUE '500124 00069297'.
574000         10  FILLER      PIC X(15) VALUE '500129 00146432'.
574100         10  FILLER      PIC X(15) VALUE '500139 00046293'.
574200         10  FILLER      PIC X(15) VALUE '500141 00070056'.
574300         10  FILLER      PIC X(15) VALUE '500150 00141756'.
574400         10  FILLER      PIC X(15) VALUE '510001 00183767'.
574500         10  FILLER      PIC X(15) VALUE '510002 00056859'.
574600         10  FILLER      PIC X(15) VALUE '510006 00075982'.
574700         10  FILLER      PIC X(15) VALUE '510007 00055668'.
574800         10  FILLER      PIC X(15) VALUE '510008 00073573'.
574900         10  FILLER      PIC X(15) VALUE '510012 00049552'.
575000         10  FILLER      PIC X(15) VALUE '510013 00045748'.
575100         10  FILLER      PIC X(15) VALUE '510022 00104019'.
575200         10  FILLER      PIC X(15) VALUE '510023 00051686'.
575300         10  FILLER      PIC X(15) VALUE '510029 00066124'.
575400         10  FILLER      PIC X(15) VALUE '510030 00051835'.
575500         10  FILLER      PIC X(15) VALUE '510031 00046248'.
575600         10  FILLER      PIC X(15) VALUE '510038 00085751'.
575700         10  FILLER      PIC X(15) VALUE '510039 00059766'.
575800         10  FILLER      PIC X(15) VALUE '510046 00059731'.
575900         10  FILLER      PIC X(15) VALUE '510047 00050003'.
576000         10  FILLER      PIC X(15) VALUE '510048 00073941'.
576100         10  FILLER      PIC X(15) VALUE '510050 00068458'.
576200         10  FILLER      PIC X(15) VALUE '510053 00073549'.
576300         10  FILLER      PIC X(15) VALUE '510055 00240280'.
576400         10  FILLER      PIC X(15) VALUE '510058 00055719'.
576500         10  FILLER      PIC X(15) VALUE '510062 00062489'.
576600         10  FILLER      PIC X(15) VALUE '510070 00074391'.
576700         10  FILLER      PIC X(15) VALUE '510071 00061720'.
576800         10  FILLER      PIC X(15) VALUE '510072 00031104'.
576900         10  FILLER      PIC X(15) VALUE '510077 00130295'.
577000         10  FILLER      PIC X(15) VALUE '510082 00073231'.
577100         10  FILLER      PIC X(15) VALUE '510085 00042988'.
577200         10  FILLER      PIC X(15) VALUE '510086 00079716'.
577300         10  FILLER      PIC X(15) VALUE '520002 00038653'.
577400         10  FILLER      PIC X(15) VALUE '520004 00068148'.
577500         10  FILLER      PIC X(15) VALUE '520009 00182353'.
577600         10  FILLER      PIC X(15) VALUE '520011 00041526'.
577700         10  FILLER      PIC X(15) VALUE '520013 00083420'.
577800         10  FILLER      PIC X(15) VALUE '520017 00139267'.
577900         10  FILLER      PIC X(15) VALUE '520019 00045422'.
578000         10  FILLER      PIC X(15) VALUE '520021 00050608'.
578100         10  FILLER      PIC X(15) VALUE '520030 00051350'.
578200         10  FILLER      PIC X(15) VALUE '520033 00060785'.
578300         10  FILLER      PIC X(15) VALUE '520034 00042701'.
578400         10  FILLER      PIC X(15) VALUE '520035 00083111'.
578500         10  FILLER      PIC X(15) VALUE '520037 00098684'.
578600         10  FILLER      PIC X(15) VALUE '520044 00035219'.
578700         10  FILLER      PIC X(15) VALUE '520045 00100025'.
578800         10  FILLER      PIC X(15) VALUE '520048 00068596'.
578900         10  FILLER      PIC X(15) VALUE '520049 00055922'.
579000         10  FILLER      PIC X(15) VALUE '520051 00162915'.
579100         10  FILLER      PIC X(15) VALUE '520057 00053261'.
579200         10  FILLER      PIC X(15) VALUE '520066 00045903'.
579300         10  FILLER      PIC X(15) VALUE '520070 00050104'.
579400         10  FILLER      PIC X(15) VALUE '520071 00031691'.
579500         10  FILLER      PIC X(15) VALUE '520075 00104875'.
579600         10  FILLER      PIC X(15) VALUE '520076 00027821'.
579700         10  FILLER      PIC X(15) VALUE '520078 00121234'.
579800         10  FILLER      PIC X(15) VALUE '520083 00058693'.
579900         10  FILLER      PIC X(15) VALUE '520087 00095678'.
580000         10  FILLER      PIC X(15) VALUE '520088 00060018'.
580100         10  FILLER      PIC X(15) VALUE '520089 00089105'.
580200         10  FILLER      PIC X(15) VALUE '520091 00036093'.
580300         10  FILLER      PIC X(15) VALUE '520096 00104350'.
580400         10  FILLER      PIC X(15) VALUE '520097 00048903'.
580500         10  FILLER      PIC X(15) VALUE '520098 00081376'.
580600         10  FILLER      PIC X(15) VALUE '520100 00053317'.
580700         10  FILLER      PIC X(15) VALUE '520102 00043464'.
580800         10  FILLER      PIC X(15) VALUE '520109 00038804'.
580900         10  FILLER      PIC X(15) VALUE '520113 00028464'.
581000         10  FILLER      PIC X(15) VALUE '520116 00023711'.
581100         10  FILLER      PIC X(15) VALUE '520136 00208944'.
581200         10  FILLER      PIC X(15) VALUE '520138 00092980'.
581300         10  FILLER      PIC X(15) VALUE '520139 00073217'.
581400         10  FILLER      PIC X(15) VALUE '520177 00103919'.
581500         10  FILLER      PIC X(15) VALUE '520189 00052924'.
581600         10  FILLER      PIC X(15) VALUE '520193 00102544'.
581700         10  FILLER      PIC X(15) VALUE '520198 00050391'.
581800         10  FILLER      PIC X(15) VALUE '520202 00045401'.
581900         10  FILLER      PIC X(15) VALUE '530002 00066089'.
582000         10  FILLER      PIC X(15) VALUE '530006 00039490'.
582100         10  FILLER      PIC X(15) VALUE '530008 00061505'.
582200         10  FILLER      PIC X(15) VALUE '530010 00061548'.
582300         10  FILLER      PIC X(15) VALUE '530011 00046474'.
582400         10  FILLER      PIC X(15) VALUE '530012 00041618'.
582500         10  FILLER      PIC X(15) VALUE '530014 00038710'.
582600         10  FILLER      PIC X(15) VALUE '530025 00043903'.
582700         10  FILLER      PIC X(15) VALUE '530032 00052104'.
582800         10  FILLER      PIC X(15) VALUE '670002 00079912'.
582900         10  FILLER      PIC X(15) VALUE '670004 00029363'.
583000         10  FILLER      PIC X(15) VALUE '670018 00041573'.
583100         10  FILLER      PIC X(15) VALUE '670019 00047535'.
583200         10  FILLER      PIC X(15) VALUE '670041 00070870'.
583300         10  FILLER      PIC X(15) VALUE '670043 00054206'.
583400         10  FILLER      PIC X(15) VALUE '670044 00045432'.
583500         10  FILLER      PIC X(15) VALUE '670047 00159514'.
583600         10  FILLER      PIC X(15) VALUE '670053 00140280'.
583700         10  FILLER      PIC X(15) VALUE '670056 00065244'.
583800         10  FILLER      PIC X(15) VALUE '670060 00036185'.
583900         10  FILLER      PIC X(15) VALUE '670066 00017383'.
584000         10  FILLER      PIC X(15) VALUE '670072 00090349'.
584100         10  FILLER      PIC X(15) VALUE '670075 00055462'.
584200         10  FILLER      PIC X(15) VALUE '670077 00037500'.
584300     05 WK-UNCOMP-CARE-DATA2 REDEFINES PROV-ADJ-AMOUNT-DATA.
584400        10  UNCOMP-CARE-TAB OCCURS 2687
584500                        ASCENDING KEY IS TB-UNCOMP-CARE-PROV
584600                        INDEXED BY UNCOMP-CARE-IDX.
584700          15 WK-UNCOMP-CARE-COUNT-ALL.
584800             20  TB-UNCOMP-CARE-PROV      PIC X(6).
584900             20  FILLER                   PIC X.
585000             20  TB-UNCOMP-CARE-AMOUNT    PIC 9(06)V9(02).
585100
585200*****YEARCHANGE 2014.3 ************************************
585300***********************************************************
585400***  PROVIDER ADJUSTMENT TABLE FOR UNCOMPENSATED CARE UCC
585500***********************************************************
585600
585700
585800 01  MES-ADD-PROV                   PIC X(53) VALUE SPACES.
585900 01  MES-CHG-PROV                   PIC X(53) VALUE SPACES.
586000 01  MES-PPS-PROV                   PIC X(06).
586100 01  MES-PPS-STATE                  PIC X(02).
586200 01  MES-INTRO                      PIC X(53) VALUE SPACES.
586300 01  MES-TOT-PAY                    PIC 9(07)V9(02) VALUE 0.
586400 01  MES-SSRFBN.
586500     05 MES-SSRFBN-STATE PIC 99.
586600     05 FILLER           PIC XX.
586700     05 MES-SSRFBN-RATE  PIC 9(1)V9(5).
586800     05 FILLER           PIC XX.
586900     05 MES-SSRFBN-CODE2 PIC 99.
587000     05 FILLER           PIC XX.
587100     05 MES-SSRFBN-STNAM PIC X(20).
587200     05 MES-SSRFBN-REST  PIC X(22).
587300
587400 01 WK-HLDDRG-DATA.
587500     05  HLDDRG-DATA.
587600         10  HLDDRG-DRGX               PIC X(03).
587700         10  FILLER1                   PIC X(01).
587800         10  HLDDRG-WEIGHT             PIC 9(02)V9(04).
587900         10  FILLER2                   PIC X(01).
588000         10  HLDDRG-GMALOS             PIC 9(02)V9(01).
588100         10  FILLER3                   PIC X(05).
588200         10  HLDDRG-LOW                PIC X(01).
588300         10  FILLER5                   PIC X(01).
588400         10  HLDDRG-ARITH-ALOS         PIC 9(02)V9(01).
588500         10  FILLER6                   PIC X(02).
588600         10  HLDDRG-PAC                PIC X(01).
588700         10  FILLER7                   PIC X(01).
588800         10  HLDDRG-SPPAC              PIC X(01).
588900         10  FILLER8                   PIC X(02).
589000         10  HLDDRG-DESC               PIC X(26).
589100
589200
589300 01 WK-HLDDRG-DATA2.
589400     05  HLDDRG-DATA2.
589500         10  HLDDRG-DRGX2               PIC X(03).
589600         10  FILLER21                   PIC X(01).
589700         10  HLDDRG-WEIGHT2             PIC 9(02)V9(04).
589800         10  FILLER22                   PIC X(01).
589900         10  HLDDRG-GMALOS2             PIC 9(02)V9(01).
590000         10  FILLER23                   PIC X(05).
590100         10  HLDDRG-LOW2                PIC X(01).
590200         10  FILLER25                   PIC X(01).
590300         10  HLDDRG-ARITH-ALOS2         PIC 9(02)V9(01).
590400         10  FILLER26                   PIC X(02).
590500         10  HLDDRG-TRANS-FLAGS.
590600                   88  D-DRG-POSTACUTE-50-50
590700                   VALUE 'Y Y'.
590800                   88  D-DRG-POSTACUTE-PERDIEM
590900                   VALUE 'Y  '.
591000             15  HLDDRG-PAC2            PIC X(01).
591100             15  FILLER27               PIC X(01).
591200             15  HLDDRG-SPPAC2          PIC X(01).
591300         10  FILLER28                   PIC X(02).
591400         10  HLDDRG-DESC2               PIC X(26).
591500         10  HLDDRG-VALID               PIC X(01).
591600
591700
591800 01  MES-LOWVOL.
591900     05  MES-LOWVOL-PROV             PIC X(6).
592000     05  FILLER                      PIC XXX.
592100     05  MESWK-LOWVOL-PROV-DISCHG    PIC 9999.
592200
592300
592400 01  WK-UNCOMP-CARE.
592500     05  WK-UNCOMP-CARE-PROV         PIC X(6).
592600     05  FILLER                      PIC X.
592700     05  WK-UNCOMP-CARE-AMOUNT       PIC 9(06)V9(02).
592800
592900
593000 01  HOLD-AREA.
593100     02  HOLD-PPS-COMPONENTS.
593200         05  H-OPER-SHARE-DOLL-THRESHOLD  PIC 9(07)V9(09).
593300         05  H-CAPI-SHARE-DOLL-THRESHOLD  PIC 9(07)V9(09).
593400
593500         05  H-OPER-HSP-PART              PIC 9(06)V9(09).
593600         05  H-CAPI-HSP-PART              PIC 9(06)V9(09).
593700
593800         05  H-OPER-FSP-PART              PIC 9(06)V9(09).
593900         05  H-CAPI-FSP-PART              PIC 9(06)V9(09).
594000         05  H-CAPI2-B-FSP-PART           PIC 9(06)V9(09).
594100
594200         05  H-OPER-OUTLIER-PART          PIC 9(07)V9(09).
594300         05  H-CAPI-OUTLIER-PART          PIC 9(07)V9(09).
594400         05  H-CAPI2-B-OUTLIER-PART       PIC 9(07)V9(09).
594500
594600         05  H-OPER-OUTDAY-PART           PIC 9(07)V9(09).
594700         05  H-CAPI-OUTDAY-PART           PIC 9(07)V9(09).
594800
594900         05  H-OPER-OUTCST-PART           PIC 9(07)V9(09).
595000         05  H-CAPI-OUTCST-PART           PIC 9(07)V9(09).
595100
595200         05  H-OPER-CSTCHG-RATIO          PIC 9(01)V9(03).
595300         05  H-CAPI-CSTCHG-RATIO          PIC 9(01)V9(03).
595400
595500         05  H-OPER-IME-TEACH             PIC 9(06)V9(09).
595600         05  H-CAPI-PAYCDE-PCT1           PIC 9(01)V9(02).
595700         05  H-CAPI-PAYCDE-PCT2           PIC 9(01)V9(02).
595800         05  H-CAPI-COST-OUTLIER          PIC 9(07)V9(09).
595900         05  H-CAPI-BILL-COSTS            PIC 9(07)V9(09).
596000         05  H-CAPI-DOLLAR-THRESHOLD      PIC 9(07)V9(09).
596100         05  H-CAPI-COLA                  PIC 9(01)V9(03).
596200         05  H-CAPI-SCH                   PIC 9(05)V9(02).
596300         05  H-CAPI-BUD-NEUTRALITY        PIC 9(01)V9(04).
596400         05  H-CAPI-OLD-HARMLESS          PIC 9(09)V9(02).
596500         05  H-CAPI-FED-RATE              PIC 9(05)V9(04).
596600         05  H-CAPI-FULL-PROS             PIC 9(05)V9(04).
596700         05  H-CAPI-LARG-URBAN            PIC 9(01)V9(02).
596800         05  H-CAPI-GAF                   PIC 9(05)V9(04).
596900         05  H-PR-CAPI-GAF                PIC 9(05)V9(04).
597000         05  H-BLEND-GAF                  PIC 9(05)V9(04).
597100         05  H-WAGE-INDEX                 PIC 9(02)V9(04).
597200         05  H-COV-DAYS                   PIC 9(3).
597300         05  H-PERDIEM-DAYS               PIC 9(3).
597400         05  H-REG-DAYS                   PIC 9(3).
597500         05  H-LTR-DAYS                   PIC 9(3).
597600         05  H-DSCHG-FRCTN                PIC 9(3)V9999.
597700         05  H-DRG-WT-FRCTN               PIC 9(2)V9999.
597800         05  H-ALOS                       PIC 9(02)V9(01).
597900         05  H-DAYS-CUTOFF                PIC 9(02)V9(01).
598000         05  H-DAYOUT-PCT                 PIC 9(01)V9(02).
598100         05  H-CSTOUT-PCT                 PIC 9(01)V9(02).
598200         05  H-CST-THRESH                 PIC 9(05)V9(02).
598300         05  H-PRE-CAPI-THRESH            PIC 9(05)V9(02).
598400         05  H-BUDG-NUTR01                PIC 9(01)V9(06).
598500         05  H-BUDG-NUTR02                PIC 9(01)V9(06).
598600         05  H-BUDG-NUTR03                PIC 9(01)V9(06).
598700         05  H-BUDG-NUTR04                PIC 9(01)V9(06).
598800         05  H-BUDG-NUTR05                PIC 9(01)V9(06).
598900         05  H-BUDG-NUTR06                PIC 9(01)V9(06).
599000         05  H-BUDG-NUTR07                PIC 9(01)V9(06).
599100         05  H-BUDG-NUTR08                PIC 9(01)V9(06).
599200         05  H-BUDG-NUTR09                PIC 9(01)V9(06).
599300         05  H-BUDG-NUTR10                PIC 9(01)V9(06).
599400         05  H-BUDG-NUTR109               PIC 9(01)V9(06).
599500         05  H-BUDG-NUTR113               PIC 9(01)V9(06).
599600         05  H-BUDG-NUTR120               PIC 9(01)V9(06).
599700         05  H-BUDG-NUTR130               PIC 9(01)V9(06).
599800         05  H-BUDG-NUTR140               PIC 9(01)V9(06).
599900         05  H-CASE-MIX-ADJ               PIC 9(01)V9(04).
600000         05  H-SHORT-STAY-ADJ             PIC 9(01)V9(04).
600100         05  H-UPDATE-01                  PIC 9(01)V9(04).
600200         05  H-UPDATE-02                  PIC 9(01)V9(04).
600300         05  H-UPDATE-03                  PIC 9(01)V9(04).
600400         05  H-UPDATE-04                  PIC 9(01)V9(04).
600500         05  H-UPDATE-05                  PIC 9(01)V9(04).
600600         05  H-UPDATE-06                  PIC 9(01)V9(04).
600700         05  H-UPDATE-07                  PIC 9(01)V9(04).
600800         05  H-UPDATE-08                  PIC 9(01)V9(04).
600900         05  H-UPDATE-09                  PIC 9(01)V9(04).
601000         05  H-UPDATE-10                  PIC 9(01)V9(04).
601100         05  H-UPDATE-109                 PIC 9(01)V9(04).
601200         05  H-UPDATE-113                 PIC 9(01)V9(04).
601300         05  H-UPDATE-120                 PIC 9(01)V9(04).
601400         05  H-UPDATE-130                 PIC 9(01)V9(04).
601500         05  H-UPDATE-140                 PIC 9(01)V9(04).
601600         05  H-ACCUM-TO-HSP               PIC 9(01)V9(04).
601700         05  H-HSP-UPDATE94               PIC 9(01)V9(04).
601800         05  H-HSP-UPDATE95               PIC 9(01)V9(04).
601900         05  H-HSP-UPDATE96               PIC 9(01)V9(04).
602000         05  H-HSP-UPDATE97               PIC 9(01)V9(04).
602100         05  H-HSP-UPDATE98               PIC 9(01)V9(04).
602200         05  H-HSP-UPDATE99               PIC 9(01)V9(04).
602300         05  H-HSP-UPDATE00               PIC 9(01)V9(04).
602400         05  H-HSP-UPDATE01               PIC 9(01)V9(04).
602500         05  H-PUERTO-RICO-RATE           PIC 9(04)V9(02).
602600         05  H-FEDERAL-RATE               PIC 9(04)V9(02).
602700         05  H-LABOR-PCT                  PIC 9(01)V9(04).
602800         05  H-NONLABOR-PCT               PIC 9(01)V9(04).
602900         05  H-PR-LABOR-PCT               PIC 9(01)V9(04).
603000         05  H-PR-NONLABOR-PCT            PIC 9(01)V9(04).
603100         05  H-HSP-RATE                   PIC 9(08)V9(09).
603200         05  H-FSP-RATE                   PIC 9(08)V9(09).
603300         05  H-OUTLIER-OFFSET-NAT         PIC 9(01)V9(06).
603400         05  H-OUTLIER-OFFSET-PR          PIC 9(01)V9(06).
603500         05  H-WK-OPER-DSH                PIC 9(01)V9(04).
603600         05  H-WK-CAPI-IME-TEACH          PIC 9(06)V9(09).
603700         05  H-OPER-PR-DOLLAR-THRESHOLD   PIC 9(07)V9(09).
603800         05  H-CAPI-PR-DOLLAR-THRESHOLD   PIC 9(07)V9(09).
603900         05  H-DSH-REDUCT-FACTOR          PIC 9(01)V9(04).
604000         05  H-WK-PASS-AMT-PLUS-MISC      PIC 9(06)V99.
604100         05  H-BASE-DRG-PAYMENT           PIC S9(07)V99.
604200         05  H-NEW-TECH-ADDON-CAP         PIC S9(07)V99.
604300         05  H-NEW-TECH-ADDON-CAPDIF      PIC S9(07)V99.
604400         05  H-NEW-TECH-ADDON-NEURO       PIC S9(07)V99.
604500         05  H-NEW-TECH-ADDON-GRAFT       PIC S9(07)V99.
604600         05  H-NEW-TECH-ADDON-X-STOP      PIC S9(07)V99.
604700         05  H-NEW-TECH-ADDON-HRTIMP-STOP PIC S9(07)V99.
604800         05  H-NEW-TECH-ADDON-ISLET       PIC S9(07)V99.
604900         05  H-NEW-TECH-ADDON-SPIRAT-STOP PIC S9(07)V99.
605000         05  H-NEW-TECH-ADDON-SPIRAT      PIC S9(07)V99.
605100         05  H-NEW-TECH-ADDON-AUTOLITT-STOP PIC S9(07)V99.
605200         05  H-NEW-TECH-ADDON-AUTOLITT    PIC S9(07)V99.
605300         05  H-NEW-TECH-ADDON-DIFICID-STOP PIC S9(07)V99.
605400         05  H-NEW-TECH-ADDON-DIFICID     PIC S9(07)V99.
605500         05  H-NEW-TECH-ADDON-ZENITH-STOP PIC S9(07)V99.
605600         05  H-NEW-TECH-ADDON-ZENITH      PIC S9(07)V99.
605700         05  H-NEW-TECH-ADDON-VORAXAZE-STOP PIC S9(07)V99.
605800         05  H-NEW-TECH-ADDON-VORAXAZE    PIC S9(07)V99.
605900         05  H-NEW-TECH-ADDON-ARGUS-STOP  PIC S9(07)V99.
606000         05  H-NEW-TECH-ADDON-ARGUS       PIC S9(07)V99.
606100         05  H-NEW-TECH-ADDON-KCENTRA-STOP  PIC S9(07)V99.
606200         05  H-NEW-TECH-ADDON-KCENTRA     PIC S9(07)V99.
606300         05  H-NEW-TECH-ADDON-ZILVER-STOP  PIC S9(07)V99.
606400         05  H-NEW-TECH-ADDON-ZILVER      PIC S9(07)V99.
606500         05  H-TECH-ADDON-ISLET-CNTR      PIC S9(02).
606600         05  H-TECH-ADDON-ISLET-CNTR2     PIC S9(02).
606700*        05  H-READMIS-ADJUST-AMT         PIC S9(07)V99.
606800*        05  H-VAL-BASED-PURCH-ADJUST-AMT PIC S9(07)V99.
606900*        05  H-BUNDLE-ADJUST-AMT          PIC S9(07)V99.
607000
607100         05  H-LESSER-NEURO-1             PIC S9(07)V99.
607200         05  H-LESSER-NEURO-2             PIC S9(07)V99.
607300
607400         05  H-LESSER-GRAFT-1             PIC S9(07)V99.
607500         05  H-LESSER-GRAFT-2             PIC S9(07)V99.
607600
607700         05  H-LESSER-X-STOP-1            PIC S9(07)V99.
607800         05  H-LESSER-X-STOP-2            PIC S9(07)V99.
607900
608000         05  H-LESSER-HRTIMP-STOP-1       PIC S9(07)V99.
608100         05  H-LESSER-HRTIMP-STOP-2       PIC S9(07)V99.
608200
608300         05  H-LESSER-SPIRAT-STOP-1       PIC S9(07)V99.
608400         05  H-LESSER-SPIRAT-STOP-2       PIC S9(07)V99.
608500
608600         05  H-LESSER-AUTOLITT-STOP-1     PIC S9(07)V99.
608700         05  H-LESSER-AUTOLITT-STOP-2     PIC S9(07)V99.
608800
608900         05  H-LESSER-DIFICID-STOP-1      PIC S9(07)V99.
609000         05  H-LESSER-DIFICID-STOP-2      PIC S9(07)V99.
609100
609200         05  H-LESSER-ZENITH-STOP-1       PIC S9(07)V99.
609300         05  H-LESSER-ZENITH-STOP-2       PIC S9(07)V99.
609400
609500         05  H-LESSER-VORAXAZE-STOP-1     PIC S9(07)V99.
609600         05  H-LESSER-VORAXAZE-STOP-2     PIC S9(07)V99.
609700
609800         05  H-LESSER-ARGUS-STOP-1        PIC S9(07)V99.
609900         05  H-LESSER-ARGUS-STOP-2        PIC S9(07)V99.
610000
610100         05  H-LESSER-KCENTRA-STOP-1      PIC S9(07)V99.
610200         05  H-LESSER-KCENTRA-STOP-2      PIC S9(07)V99.
610300
610400         05  H-LESSER-ZILVER-STOP-1       PIC S9(07)V99.
610500         05  H-LESSER-ZILVER-STOP-2       PIC S9(07)V99.
610600
610700         05  H-LESSER-VAL-BASED-PUR-STOP-1 PIC S9(07)V99.
610800         05  H-LESSER-VAL-BASED-PUR-STOP-2 PIC S9(07)V99.
610900
611000         05  H-CSTMED-NEURO               PIC S9(07)V99.
611100         05  H-CSTMED-GRAFT               PIC S9(07)V99.
611200         05  H-CSTMED-X-STOP              PIC S9(07)V99.
611300         05  H-CSTMED-HRTIMP-STOP         PIC S9(07)V99.
611400         05  H-CSTMED-SPIRAT-STOP         PIC S9(07)V99.
611500         05  H-CSTMED-AUTOLITT-STOP       PIC S9(07)V99.
611600         05  H-CSTMED-DIFICID-STOP        PIC S9(07)V99.
611700         05  H-CSTMED-ZENITH-STOP         PIC S9(07)V99.
611800         05  H-CSTMED-VORAXAZE-STOP       PIC S9(07)V99.
611900         05  H-CSTMED-ARGUS-STOP          PIC S9(07)V99.
612000         05  H-CSTMED-KCENTRA-STOP        PIC S9(07)V99.
612100         05  H-CSTMED-ZILVER-STOP         PIC S9(07)V99.
612200
612300
612400     02  HOLD-ADDITIONAL-VARIABLES.
612500         05  H-OPER-HSP-PCT               PIC 9(01)V9(02).
612600         05  H-OPER-FSP-PCT               PIC 9(01)V9(02).
612700         05  H-NAT-PCT                    PIC 9(01)V9(02).
612800         05  H-REG-PCT                    PIC 9(01)V9(02).
612900         05  H-FAC-SPEC-RATE              PIC 9(05)V9(02).
613000         05  H-UPDATE-FACTOR              PIC 9(01)V9(05).
613100         05  H-DRG-WT                     PIC 9(02)V9(04).
613200         05  H-NAT-LABOR                  PIC 9(05)V9(02).
613300         05  H-NAT-NONLABOR               PIC 9(05)V9(02).
613400         05  H-REG-LABOR                  PIC 9(05)V9(02).
613500         05  H-REG-NONLABOR               PIC 9(05)V9(02).
613600         05  H-OPER-COLA                  PIC 9(01)V9(03).
613700         05  H-INTERN-RATIO               PIC 9(01)V9(04).
613800         05  H-OPER-COST-OUTLIER          PIC 9(07)V9(09).
613900         05  H-OPER-BILL-COSTS            PIC 9(07)V9(09).
614000         05  H-OPER-DOLLAR-THRESHOLD      PIC 9(07)V9(09).
614100
614200     02  HOLD-CAPITAL-VARIABLES.
614300         05  H-CAPI-TOTAL-PAY             PIC 9(07)V9(02).
614400         05  H-CAPI-HSP                   PIC 9(07)V9(02).
614500         05  H-CAPI-FSP                   PIC 9(07)V9(02).
614600         05  H-CAPI-OUTLIER               PIC 9(07)V9(02).
614700         05  H-CAPI-OLD-HARM              PIC 9(07)V9(02).
614800         05  H-CAPI-DSH-ADJ               PIC 9(07)V9(02).
614900         05  H-CAPI-IME-ADJ               PIC 9(07)V9(02).
615000         05  H-CAPI-EXCEPTIONS            PIC 9(07)V9(02).
615100
615200     02  HOLD-CAPITAL2-VARIABLES.
615300         05  H-CAPI2-PAY-CODE             PIC X(1).
615400         05  H-CAPI2-B-FSP                PIC 9(07)V9(02).
615500         05  H-CAPI2-B-OUTLIER            PIC 9(07)V9(02).
615600     02  HOLD-OTHER-VARIABLES.
615700         05  H-NON-TEMP-RELIEF-PAYMENT    PIC 9(07)V9(02).
615800         05  H-NEW-TECH-PAY-ADD-ON        PIC 9(07)V9(02).
615900         05  H-LOW-VOL-PAYMENT            PIC 9(07)V9(02).
616000         05  H-VAL-BASED-PURCH-PARTIPNT   PIC X.
616100         05  H-VAL-BASED-PURCH-ADJUST     PIC 9V9(11).
616200         05  H-HOSP-READMISSION-REDU      PIC X.
616300         05  H-HOSP-HRR-ADJUSTMT          PIC 9V9(4).
616400         05  H-OPERATNG-DATA.
616500             10  H-MODEL1-BUNDLE-DISPRCNT    PIC V999.
616600             10  H-OPER-BASE-DRG-PAY         PIC 9(08)V99.
616700             10  H-OPER-HSP-AMT              PIC 9(08)V99.
616800     02  HOLD-PC-OTH-VARIABLES.
616900         05  H-OPER-DSH                   PIC 9(01)V9(04).
617000         05  H-CAPI-DSH                   PIC 9(01)V9(04).
617100         05  H-CAPI-HSP-PCT               PIC 9(01)V9(02).
617200         05  H-CAPI-FSP-PCT               PIC 9(01)V9(04).
617300         05  H-ARITH-ALOS                 PIC 9(02)V9(01).
617400         05  H-PR-WAGE-INDEX              PIC 9(02)V9(04).
617500         05  H-TRANSFER-ADJ               PIC 9(01)V9(04).
617600         05  H-PC-HMO-FLAG                PIC X(01).
617700         05  H-PC-COT-FLAG                PIC X(01).
617800         05  H-OPER-HSP-PART2             PIC 9(07)V9(02).
617900         05  H-BUNDLE-ADJUST-PAY          PIC S9(07)V99.
618000     02  H-ADDITIONAL-PAY-INFO-DATA.
618100         05 H-UNCOMP-CARE-AMOUNT          PIC S9(07)V9(02).
618200         05 H-BUNDLE-ADJUST-AMT           PIC S9(07)V9(02).
618300         05 H-VAL-BASED-PURCH-ADJUST-AMT  PIC S9(07)V9(02).
618400         05 H-READMIS-ADJUST-AMT          PIC S9(07)V9(02).
618500     02  H-ADDITIONAL-PAY-INFO-DATA2.
618600         05  H-HAC-PROG-REDUC-IND         PIC X.
618700         05  H-EHR-PROG-REDUC-IND         PIC X.
618800         05  H-EHR-ADJUST-AMT             PIC S9(07)V9(02).
618900         05  H-STNDRD-VALUE               PIC S9(07)V9(02).
619000         05  H-FLX6-PAYMENT               PIC S9(07)V9(02).
619100         05  H-FLX7-PAYMENT               PIC S9(07)V9(02).
619200     02 H-FILLER                          PIC X(0906).
619300
619400 01  HLD-PPS-DATA.
619500         10  HLD-PPS-RTC                PIC 9(02).
619600         10  HLD-PPS-WAGE-INDX          PIC 9(02)V9(04).
619700         10  HLD-PPS-OUTLIER-DAYS       PIC 9(03).
619800         10  HLD-PPS-AVG-LOS            PIC 9(02)V9(01).
619900         10  HLD-PPS-DAYS-CUTOFF        PIC 9(02)V9(01).
620000         10  HLD-PPS-OPER-IME-ADJ       PIC 9(06)V9(02).
620100         10  HLD-PPS-TOTAL-PAYMENT      PIC 9(07)V9(02).
620200         10  HLD-PPS-OPER-HSP-PART      PIC 9(06)V9(02).
620300         10  HLD-PPS-OPER-FSP-PART      PIC 9(06)V9(02).
620400         10  HLD-PPS-OPER-OUTLIER-PART  PIC 9(07)V9(02).
620500         10  HLD-PPS-REG-DAYS-USED      PIC 9(03).
620600         10  HLD-PPS-LTR-DAYS-USED      PIC 9(02).
620700         10  HLD-PPS-OPER-DSH-ADJ       PIC 9(06)V9(02).
620800         10  HLD-PPS-CALC-VERS          PIC X(05).
620900
621000 LINKAGE SECTION.
621100***************************************************************
621200*                 * * * * * * * * *                           *
621300*    REVIEW CODES ARE USED TO DIRECT THE PPCAL  SUBROUTINE    *
621400*    IN HOW TO PAY THE BILL.                                  *
621500*                         *****                               *
621600*    COMMENTS  ** CLAIMS RECEIVED WITH CONDITION CODE 66      *
621700*                 SHOULD BE PROCESSED UNDER REVIEW CODE 06,   *
621800*                 07 OR 11 AS APPROPRIATE TO EXCLUDE ANY      *
621900*                 OUTLIER COMPUTATION.                        *
622000*                         *****                               *
622100*         REVIEW-CODE:                                        *
622200*            00 = PAY-WITH-OUTLIER.                           *
622300*                 WILL CALCULATE THE STANDARD PAYMENT.        *
622400*                 WILL ALSO ATTEMPT TO PAY ONLY COST          *
622500*                 OUTLIERS, DAY OUTLIERS EXPIRED 10/01/97     *
622600*            03 = PAY-PERDIEM-DAYS.                           *
622700*                 WILL CALCULATE A PERDIEM PAYMENT BASED ON   *
622800*                 THE STANDARD PAYMENT IF THE COVERED DAYS    *
622900*                 ARE LESS THAN THE AVERAGE LENGTH OF STAY    *
623000*                 FOR THE DRG. IF COVERED DAYS EQUAL OR       *
623100*                 EXCEED THE AVERAGE LENGTH OF STAY, THE      *
623200*                 STANDARD PAYMENT IS CALCULATED. WILL ALSO   *
623300*                 CALCULATE THE COST OUTLIER PORTION OF THE   *
623400*                 PAYMENT IF THE ADJUSTED CHARGES ON THE      *
623500*                 BILL EXCEED THE COST THRESHOLD.             *
623600*            06 = PAY-XFER-NO-COST                            *
623700*                 WILL CALCULATE A PERDIEM PAYMENT BASED ON   *
623800*                 THE STANDARD PAYMENT IF THE COVERED DAYS    *
623900*                 ARE LESS THAN THE AVERAGE LENGTH OF STAY    *
624000*                 FOR THE DRG.  IF COVERED DAYS EQUAL OR      *
624100*                 EXCEED THE AVERAGE LENGTH OF STAY, THE      *
624200*                 STANDARD PAYMENT IS CALCULATED. WILL NOT    *
624300*                 CALCULATE ANY COST OUTLIER PORTION          *
624400*                 OF THE PAYMENT.                             *
624500*            07 = PAY-WITHOUT-COST.                           *
624600*                 WILL CALCULATE THE STANDARD PAYMENT         *
624700*                 WITHOUT COST PORTION.                       *
624800*            09 = PAY-XFER-SPEC-DRG - POST-ACUTE TRANSFERS    *
624900*                 50-50> NOW USES Y INDICATORS ON DRGS
625000*                        SEE TABLE 5 FROM ANNUAL IPPS FINAL
625100*                        RULE
625200* =======================================================
625300* THE 50/50 DRG'S DO NOT REPEAT WITH THE FULL PERDIEM DRG'S
625400* =======================================================
625500*
625600*
625700*     FULL PERDIEM >   NOW USES Y INDICATORS ON DRGS
625800*                      SEE TABLE 5 FROM ANNUAL IPPS FINAL
625900*                      RULE
626000*
626100*                               POST-ACUTE TRANSFERS          *
626200*                 WILL CALCULATE A PERDIEM PAYMENT BASED ON   *
626300*                 THE STANDARD DRG PAYMENT IF THE COVERED DAYS*
626400*                 ARE LESS THAN THE AVERAGE LENGTH OF STAY    *
626500*                 FOR THE DRG. IF COVERED DAYS EQUAL OR       *
626600*                 EXCEED THE AVERAGE LENGTH OF STAY, THE      *
626700*                 STANDARD PAYMENT IS CALCULATED. WILL ALSO   *
626800*                 CALCULATE THE COST OUTLIER PORTION OF THE   *
626900*                 PAYMENT IF THE ADJUSTED CHARGES ON THE      *
627000*                 BILL EXCEED THE COST THRESHOLD.             *
627100*            11 = PAY-XFER-SPEC-DRG-NO-COST                   *
627200*                 POST-ACUTE TRANSFERS                        *
627300*                 50-50> NOW USES Y INDICATORS ON DRGS
627400*                        SEE TABLE 5 FROM ANNUAL IPPS FINAL
627500*                        RULE
627600* =======================================================
627700* THE 50/50 DRG'S DO NOT REPEAT WITH THE FULL PERDIEM DRG'S
627800* =======================================================
627900*
628000*     FULL PERDIEM >  NOW USES Y INDICATORS ON DRGS
628100*                     SEE TABLE 5
628200*
628300*
628400*                               POST-ACUTE TRANSFERS          *
628500*                 WILL CALCULATE A PERDIEM PAYMENT BASED ON   *
628600*                 THE STANDARD DRG PAYMENT IF THE COVERED DAYS*
628700*                 ARE LESS THAN THE AVERAGE LENGTH OF STAY    *
628800*                 FOR THE DRG. IF COVERED DAYS EQUAL OR       *
628900*                 EXCEED THE AVERAGE LENGTH OF STAY, THE      *
629000*                 STANDARD PAYMENT IS CALCULATED. WILL NOT    *
629100*                 CALCULATE THE COST OUTLIER PORTION OF THE   *
629200*                 PAYMENT.                                    *
629300***************************************************************
629400
629500**************************************************************
629600*      MILLINNIUM COMPATIBLE                                 *
629700*      THIS IS THE BILL-RECORD THAT WILL BE PASSED BACK FROM *
629800*      THE PPCAL001 PROGRAM AND AFTER FOR PROCESSING         *
629900*      IN THE NEW FORMAT                                     *
630000**************************************************************
630100 01  BILL-NEW-DATA.
630200         10  B-NPI10.
630300             15  B-NPI8             PIC X(08).
630400             15  B-NPI-FILLER       PIC X(02).
630500         10  B-PROVIDER-NO          PIC X(06).
630600         10  B-REVIEW-CODE          PIC 9(02).
630700             88  VALID-REVIEW-CODE    VALUE 00 03 06 07 09 11.
630800             88  PAY-WITH-OUTLIER     VALUE 00 07.
630900             88  PAY-PERDIEM-DAYS     VALUE 03.
631000             88  PAY-XFER-NO-COST     VALUE 06.
631100             88  PAY-WITHOUT-COST     VALUE 07.
631200             88  PAY-XFER-SPEC-DRG    VALUE 09 11.
631300             88  PAY-XFER-SPEC-DRG-NO-COST VALUE 11.
631400         10  B-DRG                  PIC 9(03).
631500
631600             88  B-DRG-SPIRATN-DRG
631700                   VALUE 163 164 165.
631800
631900             88  B-DRG-SPIRATN-DRG11
632000                   VALUE 199 200 201.
632100
632200
632300             88  B-DRG-AUTOLITT-DRG
632400                   VALUE 25 26 27.
632500
632600* =======================================================
632700* THE 50/50 DRG'S DO NOT REPEAT WITH THE POSTACUTE  DRG'S
632800* =======================================================
632900*
633000*            88  B-DRG-POSTACUTE-PERDIEM
633100*                         VALUE  NOW USES Y INDICATORS ON DRGS
633200*                         SEE TABLE 5
633300*                         D-DRG-POSTACUTE-PERDIEM
633400
633500         10  B-LOS                  PIC 9(03).
633600         10  B-COVERED-DAYS         PIC 9(03).
633700         10  B-LTR-DAYS             PIC 9(02).
633800         10  B-DISCHARGE-DATE.
633900             15  B-DISCHG-CC        PIC 9(02).
634000             15  B-DISCHG-YY        PIC 9(02).
634100             15  B-DISCHG-MM        PIC 9(02).
634200             15  B-DISCHG-DD        PIC 9(02).
634300         10  B-CHARGES-CLAIMED      PIC 9(07)V9(02).
634400         10  B-PRIN-PROC-CODE       PIC X(07).
634500         10  B-OTHER-PROC-CODE1     PIC X(07).
634600         10  B-OTHER-PROC-CODE2     PIC X(07).
634700         10  B-OTHER-PROC-CODE3     PIC X(07).
634800         10  B-OTHER-PROC-CODE4     PIC X(07).
634900         10  B-OTHER-PROC-CODE5     PIC X(07).
635000         10  B-OTHER-PROC-CODE6     PIC X(07).
635100         10  B-OTHER-PROC-CODE7     PIC X(07).
635200         10  B-OTHER-PROC-CODE8     PIC X(07).
635300         10  B-OTHER-PROC-CODE9     PIC X(07).
635400         10  B-OTHER-PROC-CODE10    PIC X(07).
635500         10  B-OTHER-PROC-CODE11    PIC X(07).
635600         10  B-OTHER-PROC-CODE12    PIC X(07).
635700         10  B-OTHER-PROC-CODE13    PIC X(07).
635800         10  B-OTHER-PROC-CODE14    PIC X(07).
635900         10  B-OTHER-PROC-CODE15    PIC X(07).
636000         10  B-OTHER-PROC-CODE16    PIC X(07).
636100         10  B-OTHER-PROC-CODE17    PIC X(07).
636200         10  B-OTHER-PROC-CODE18    PIC X(07).
636300         10  B-OTHER-PROC-CODE19    PIC X(07).
636400         10  B-OTHER-PROC-CODE20    PIC X(07).
636500         10  B-OTHER-PROC-CODE21    PIC X(07).
636600         10  B-OTHER-PROC-CODE22    PIC X(07).
636700         10  B-OTHER-PROC-CODE23    PIC X(07).
636800         10  B-OTHER-PROC-CODE24    PIC X(07).
636900         10  B-OTHER-DIAG-CODE1     PIC X(07).
637000             88  B-DIAG-ISLET-DIAG1
637100                   VALUE 'V707   '.
637200             88  B-DIAG-AUTOLITT-DIAG
637300                   VALUE '1910   ' '1911   ' '1912   ' '1913  '
637400                         '1914   ' '1915   ' '1916   ' '1917  '
637500                         '1918   ' '1919   ' 'C710   ' 'C711  '
637600                         'C712   ' 'C713   ' 'C714   ' 'C715  '
637700                         'C716   ' 'C717   ' 'C718   ' 'C719  '.
637800             88  B-DIAG-KCENTRA-DIAG1
637900                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
638000                         '2864   ' '2865   ' '2867   ' '28652 '
638100                         '28653  ' '28659  '.
638200         10  B-OTHER-DIAG-CODE2     PIC X(07).
638300             88  B-DIAG-ISLET-DIAG2
638400                   VALUE 'V707   '.
638500             88  B-DIAG-KCENTRA-DIAG2
638600                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
638700                         '2864   ' '2865   ' '2867   ' '28652 '
638800                         '28653  ' '28659  '.
638900         10  B-OTHER-DIAG-CODE3     PIC X(07).
639000             88  B-DIAG-ISLET-DIAG3
639100                   VALUE 'V707   '.
639200             88  B-DIAG-KCENTRA-DIAG3
639300                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
639400                         '2864   ' '2865   ' '2867   ' '28652 '
639500                         '28653  ' '28659  '.
639600         10  B-OTHER-DIAG-CODE4     PIC X(07).
639700             88  B-DIAG-ISLET-DIAG4
639800                   VALUE 'V707   '.
639900             88  B-DIAG-KCENTRA-DIAG4
640000                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
640100                         '2864   ' '2865   ' '2867   ' '28652 '
640200                         '28653  ' '28659  '.
640300         10  B-OTHER-DIAG-CODE5     PIC X(07).
640400             88  B-DIAG-ISLET-DIAG5
640500                   VALUE 'V707   '.
640600             88  B-DIAG-KCENTRA-DIAG5
640700                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
640800                         '2864   ' '2865   ' '2867   ' '28652 '
640900                         '28653  ' '28659  '.
641000         10  B-OTHER-DIAG-CODE6     PIC X(07).
641100             88  B-DIAG-ISLET-DIAG6
641200                   VALUE 'V707   '.
641300             88  B-DIAG-KCENTRA-DIAG6
641400                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
641500                         '2864   ' '2865   ' '2867   ' '28652 '
641600                         '28653  ' '28659  '.
641700         10  B-OTHER-DIAG-CODE7     PIC X(07).
641800             88  B-DIAG-ISLET-DIAG7
641900                   VALUE 'V707   '.
642000             88  B-DIAG-KCENTRA-DIAG7
642100                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
642200                         '2864   ' '2865   ' '2867   ' '28652 '
642300                         '28653  ' '28659  '.
642400         10  B-OTHER-DIAG-CODE8     PIC X(07).
642500             88  B-DIAG-ISLET-DIAG8
642600                   VALUE 'V707   '.
642700             88  B-DIAG-KCENTRA-DIAG8
642800                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
642900                         '2864   ' '2865   ' '2867   ' '28652 '
643000                         '28653  ' '28659  '.
643100         10  B-OTHER-DIAG-CODE9     PIC X(07).
643200             88  B-DIAG-ISLET-DIAG9
643300                   VALUE 'V707   '.
643400             88  B-DIAG-KCENTRA-DIAG9
643500                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
643600                         '2864   ' '2865   ' '2867   ' '28652 '
643700                         '28653  ' '28659  '.
643800         10  B-OTHER-DIAG-CODE10    PIC X(07).
643900             88  B-DIAG-ISLET-DIAG10
644000                   VALUE 'V707   '.
644100             88  B-DIAG-KCENTRA-DIAG10
644200                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
644300                         '2864   ' '2865   ' '2867   ' '28652 '
644400                         '28653  ' '28659  '.
644500         10  B-OTHER-DIAG-CODE11    PIC X(07).
644600             88  B-DIAG-ISLET-DIAG11
644700                   VALUE 'V707   '.
644800             88  B-DIAG-KCENTRA-DIAG11
644900                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
645000                         '2864   ' '2865   ' '2867   ' '28652 '
645100                         '28653  ' '28659  '.
645200         10  B-OTHER-DIAG-CODE12    PIC X(07).
645300             88  B-DIAG-ISLET-DIAG12
645400                   VALUE 'V707   '.
645500             88  B-DIAG-KCENTRA-DIAG12
645600                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
645700                         '2864   ' '2865   ' '2867   ' '28652 '
645800                         '28653  ' '28659  '.
645900         10  B-OTHER-DIAG-CODE13    PIC X(07).
646000             88  B-DIAG-ISLET-DIAG13
646100                   VALUE 'V707   '.
646200             88  B-DIAG-KCENTRA-DIAG13
646300                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
646400                         '2864   ' '2865   ' '2867   ' '28652 '
646500                         '28653  ' '28659  '.
646600         10  B-OTHER-DIAG-CODE14    PIC X(07).
646700             88  B-DIAG-ISLET-DIAG14
646800                   VALUE 'V707   '.
646900             88  B-DIAG-KCENTRA-DIAG14
647000                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
647100                         '2864   ' '2865   ' '2867   ' '28652 '
647200                         '28653  ' '28659  '.
647300         10  B-OTHER-DIAG-CODE15    PIC X(07).
647400             88  B-DIAG-ISLET-DIAG15
647500                   VALUE 'V707   '.
647600             88  B-DIAG-KCENTRA-DIAG15
647700                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
647800                         '2864   ' '2865   ' '2867   ' '28652 '
647900                         '28653  ' '28659  '.
648000         10  B-OTHER-DIAG-CODE16    PIC X(07).
648100             88  B-DIAG-ISLET-DIAG16
648200                   VALUE 'V707   '.
648300             88  B-DIAG-KCENTRA-DIAG16
648400                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
648500                         '2864   ' '2865   ' '2867   ' '28652 '
648600                         '28653  ' '28659  '.
648700         10  B-OTHER-DIAG-CODE17    PIC X(07).
648800             88  B-DIAG-ISLET-DIAG17
648900                   VALUE 'V707   '.
649000             88  B-DIAG-KCENTRA-DIAG17
649100                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
649200                         '2864   ' '2865   ' '2867   ' '28652 '
649300                         '28653  ' '28659  '.
649400         10  B-OTHER-DIAG-CODE18    PIC X(07).
649500             88  B-DIAG-ISLET-DIAG18
649600                   VALUE 'V707   '.
649700             88  B-DIAG-KCENTRA-DIAG18
649800                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
649900                         '2864   ' '2865   ' '2867   ' '28652 '
650000                         '28653  ' '28659  '.
650100         10  B-OTHER-DIAG-CODE19    PIC X(07).
650200             88  B-DIAG-ISLET-DIAG19
650300                   VALUE 'V707   '.
650400             88  B-DIAG-KCENTRA-DIAG19
650500                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
650600                         '2864   ' '2865   ' '2867   ' '28652 '
650700                         '28653  ' '28659  '.
650800         10  B-OTHER-DIAG-CODE20    PIC X(07).
650900             88  B-DIAG-ISLET-DIAG20
651000                   VALUE 'V707   '.
651100             88  B-DIAG-KCENTRA-DIAG20
651200                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
651300                         '2864   ' '2865   ' '2867   ' '28652 '
651400                         '28653  ' '28659  '.
651500         10  B-OTHER-DIAG-CODE21    PIC X(07).
651600             88  B-DIAG-ISLET-DIAG21
651700                   VALUE 'V707   '.
651800             88  B-DIAG-KCENTRA-DIAG21
651900                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
652000                         '2864   ' '2865   ' '2867   ' '28652 '
652100                         '28653  ' '28659  '.
652200         10  B-OTHER-DIAG-CODE22    PIC X(07).
652300             88  B-DIAG-ISLET-DIAG22
652400                   VALUE 'V707   '.
652500             88  B-DIAG-KCENTRA-DIAG22
652600                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
652700                         '2864   ' '2865   ' '2867   ' '28652 '
652800                         '28653  ' '28659  '.
652900         10  B-OTHER-DIAG-CODE23    PIC X(07).
653000             88  B-DIAG-ISLET-DIAG23
653100                   VALUE 'V707   '.
653200             88  B-DIAG-KCENTRA-DIAG23
653300                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
653400                         '2864   ' '2865   ' '2867   ' '28652 '
653500                         '28653  ' '28659  '.
653600         10  B-OTHER-DIAG-CODE24    PIC X(07).
653700             88  B-DIAG-ISLET-DIAG24
653800                   VALUE 'V707   '.
653900             88  B-DIAG-KCENTRA-DIAG24
654000                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
654100                         '2864   ' '2865   ' '2867   ' '28652 '
654200                         '28653  ' '28659  '.
654300         10  B-OTHER-DIAG-CODE25    PIC X(07).
654400             88  B-DIAG-ISLET-DIAG25
654500                   VALUE 'V707   '.
654600             88  B-DIAG-KCENTRA-DIAG25
654700                   VALUE '2860   ' '2861   ' '2862   ' '2863  '
654800                         '2864   ' '2865   ' '2867   ' '28652 '
654900                         '28653  ' '28659  '.
655000         10  B-DEMO-DATA.
655100             15  B-DEMO-CODE1           PIC X(02).
655200             15  B-DEMO-CODE2           PIC X(02).
655300             15  B-DEMO-CODE3           PIC X(02).
655400             15  B-DEMO-CODE4           PIC X(02).
655500         10  B-NDC-DATA.
655600             15  B-NDC-NUMBER           PIC X(11).
655700               88  B-NDC-DIFICID-NDC
655800                   VALUE '52015008001'.
655900         10  FILLER                     PIC X(73).
656000
656100
656200***************************************************************
656300*    THIS DATA IS CALCULATED BY THIS PPCAL  SUBROUTINE        *
656400*    AND PASSED BACK TO THE CALLING PROGRAM                   *
656500*            RETURN CODE VALUES (PPS-RTC)                     *
656600*                                                             *
656700*            PPS-RTC 00-49 = HOW THE BILL WAS PAID            *
656800*                                                             *
656900*      PPS-RTC 30,33,40,42,44  = OUTLIER RECONCILIATION       *
657000*                                                             *
657100*           30,00 = PAID NORMAL DRG PAYMENT                   *
657200*                                                             *
657300*              01 = PAID AS A DAY-OUTLIER.                    *
657400*                   NOTE:                                     *
657500*                     DAY-OUTLIER NO LONGER BEING PAID        *
657600*                         AS OF 10/01/97                      *
657700*                                                             *
657800*              02 = PAID AS A COST-OUTLIER.                   *
657900*                                                             *
658000*           33,03 = TRANSFER PAID ON A PERDIEM BASIS UP TO    *
658100*                   AND INCLUDING THE FULL DRG.               *
658200*              05 = TRANSFER PAID ON A PERDIEM BASIS UP TO    *
658300*                   AND INCLUDING THE FULL DRG WHICH ALSO     *
658400*                   QUALIFIED FOR A COST OUTLIER PAYMENT.     *
658500*              06 = TRANSFER PAID ON A PERDIEM BASIS UP TO    *
658600*                   AND INCLUDING THE FULL DRG. PROVIDER      *
658700*                   REFUSED COST OUTLIER.                     *
658800*           40,10 = POST-ACUTE TRANSFER                       *
658900*                   SEE TABLE 5 FROM ANNUAL IPPS FINAL RULE
659000*
659100* =======================================================
659200* THE 50/50 DRG'S DO NOT REPEAT WITH THE POSTACUTE  DRG'S
659300* =======================================================
659400*
659500*           42,12 = POST-ACAUTE TRANSFER WITH SPECIFIC DRGS   *
659600*                       THE FOLLOWING DRG'S                   *
659700*                   DRG =  VALUE  NOW USES Y INDICATORS ON DRGS
659800*                       SEE TABLE 5 FROM ANNUAL IPPS FINAL RULE
659900*                          D-DRG-POSTACUTE-PERDIEM
660000*
660100*           44,14 = PAID NORMAL DRG PAYMENT WITH              *
660200*                    PERDIEM DAYS = OR > GM  ALOS             *
660300*              16 = PAID AS A COST-OUTLIER WITH               *
660400*                    PERDIEM DAYS = OR > GM  ALOS             *
660500*                                                             *
660600*            PPS-RTC 50-99 = WHY THE BILL WAS NOT PAID        *
660700*              51 = NO PROVIDER SPECIFIC INFO FOUND           *
660800*              52 = INVALID CBSA# IN PROVIDER FILE            *
660900*                   OR INVALID WAGE INDEX                     *
661000*                                      OR                     *
661100*                   INVALID PROVIDER TYPES ON PROVIDER FILE   *
661200*              53 = WAIVER STATE - NOT CALCULATED BY PPS      *
661300*              54 = INVALID DRG                               *
661400*              55 = DISCHARGE DATE < PROVIDER EFF START DATE  *
661500*                                      OR                     *
661600*                   DISCHARGE DATE < CBSA EFF START DATE      *
661700*                   FOR PPS                                   *
661800*                                      OR                     *
661900*                   PROVIDER HAS BEEN TERMINATED ON OR BEFORE *
662000*                   DISCHARGE DATE                            *
662100*              56 = INVALID LENGTH OF STAY                    *
662200*              57 = REVIEW CODE INVALID (NOT 00 03 06 07 09   *
662300*                                        NOT 11)              *
662400*              58 = TOTAL CHARGES NOT NUMERIC                 *
662500*              61 = LIFETIME RESERVE DAYS NOT NUMERIC         *
662600*                   OR BILL-LTR-DAYS > 60                     *
662700*              62 = INVALID NUMBER OF COVERED DAYS            *
662800*              65 = PAY-CODE NOT = A,B OR C ON PROVIDER        *
662900*                   SPECIFIC FILE FOR CAPITAL                  *
663000*                   OR                                         *
663100*                   INVALID READMISSION FLAG IN PSF FILE       *
663200*                   OR                                         *
663300*                   BLANK READMISSION FLAG IN PSF FILE         *
663400*                   OR                                         *
663500*                   READMISSION ADJUSTMENT IS INVALID OR       *
663600*                   OUT OF RANGE IN PSF FILE                   *
663700*                   OR                                         *
663800*                   BLANK READMISSION ADJUSTMENT IN PSF FILE   *
663900*                   OR                                         *
664000*                   INVALID STATE CODE IN COMBINATION WITH     *
664100*                   READMISSION FLAG IN PSF FILE               *
664200*              67 = COST OUTLIER WITH LOS > COVERED DAYS      **
664300*                   OR COST OUTLIER THRESHOLD CALUCULATION    **
664400*              68 = INVALID VALUE BASED PURCHASE FLAG IN PSF   *
664500*                   FILE                                       *
664600*                   OR                                         *
664700*                   BLANK VALUE BASED PURCHASE FLAG IN PSF FILE*
664800*                   OR                                         *
664900*                   VALUE BASED PURCHASE ADJUSTMEMT IS INVALID *
665000*                   OR OUT OF RANGE IN PSF FILE                *
665100*                   INDICATOR                                  *
665200*                   OR                                         *
665300*                   BLANK VALUE BASED PURCHASE ADJUSTMEMT IN   *
665400*                   PSF FILE                                   *
665500*                   OR                                         *
665600*                   INVALID COMBINATION OF HOSPITAL QUALITY    *
665700*                   INDICATOR                                  *
665800*                   AND VALUE BASED PURCHASE FLAG IN PSF FILE  *
665900*                   OR                                         *
666000*                   INVALID STATE CODE IN COMBINATION WITH VALUE
666100*                   BASED PURCHASE FLAG IN PSF FILE            *
666200*              98 = CANNOT PROCESS BILL OLDER THAN 5 YEARS    *
666300***************************************************************
666400 01  PPS-DATA.
666500         10  PPS-RTC                PIC 9(02).
666600         10  PPS-WAGE-INDX          PIC 9(02)V9(04).
666700         10  PPS-OUTLIER-DAYS       PIC 9(03).
666800         10  PPS-AVG-LOS            PIC 9(02)V9(01).
666900         10  PPS-DAYS-CUTOFF        PIC 9(02)V9(01).
667000         10  PPS-OPER-IME-ADJ       PIC 9(06)V9(02).
667100         10  PPS-TOTAL-PAYMENT      PIC 9(07)V9(02).
667200         10  PPS-OPER-HSP-PART      PIC 9(06)V9(02).
667300         10  PPS-OPER-FSP-PART      PIC 9(06)V9(02).
667400         10  PPS-OPER-OUTLIER-PART  PIC 9(07)V9(02).
667500         10  PPS-REG-DAYS-USED      PIC 9(03).
667600         10  PPS-LTR-DAYS-USED      PIC 9(02).
667700         10  PPS-OPER-DSH-ADJ       PIC 9(06)V9(02).
667800         10  PPS-CALC-VERS          PIC X(05).
667900
668000*****************************************************************
668100*            THESE ARE THE VERSIONS OF THE PPCAL
668200*           PROGRAMS THAT WILL BE PASSED BACK----
668300*          ASSOCIATED WITH THE BILL BEING PROCESSED
668400*****************************************************************
668500 01  PRICER-OPT-VERS-SW.
668600     02  PRICER-OPTION-SW          PIC X(01).
668700         88  ALL-TABLES-PASSED          VALUE 'A'.
668800         88  PROV-RECORD-PASSED         VALUE 'P'.
668900         88  ADDITIONAL-VARIABLES       VALUE 'M'.
669000         88  PC-PRICER                  VALUE 'C'.
669100     02  PPS-VERSIONS.
669200         10  PPDRV-VERSION         PIC X(05).
669300
669400*****************************************************************
669500*        THIS IS THE VARIABLES THAT WILL BE PASSED BACK
669600*          ASSOCIATED WITH THE BILL BEING PROCESSED
669700*****************************************************************
669800 01  PPS-ADDITIONAL-VARIABLES.
669900     05  PPS-HSP-PCT                PIC 9(01)V9(02).
670000     05  PPS-FSP-PCT                PIC 9(01)V9(02).
670100     05  PPS-NAT-PCT                PIC 9(01)V9(02).
670200     05  PPS-REG-PCT                PIC 9(01)V9(02).
670300     05  PPS-FAC-SPEC-RATE          PIC 9(05)V9(02).
670400     05  PPS-UPDATE-FACTOR          PIC 9(01)V9(05).
670500     05  PPS-DRG-WT                 PIC 9(02)V9(04).
670600     05  PPS-NAT-LABOR              PIC 9(05)V9(02).
670700     05  PPS-NAT-NLABOR             PIC 9(05)V9(02).
670800     05  PPS-REG-LABOR              PIC 9(05)V9(02).
670900     05  PPS-REG-NLABOR             PIC 9(05)V9(02).
671000     05  PPS-OPER-COLA              PIC 9(01)V9(03).
671100     05  PPS-INTERN-RATIO           PIC 9(01)V9(04).
671200     05  PPS-COST-OUTLIER           PIC 9(07)V9(09).
671300     05  PPS-BILL-COSTS             PIC 9(07)V9(09).
671400     05  PPS-DOLLAR-THRESHOLD       PIC 9(07)V9(09).
671500     05  PPS-DSCHG-FRCTN            PIC 9(1)V9999.
671600     05  PPS-DRG-WT-FRCTN           PIC 9(2)V9999.
671700     05  PPS-CAPITAL-VARIABLES.
671800         10  PPS-CAPI-TOTAL-PAY           PIC 9(07)V9(02).
671900         10  PPS-CAPI-HSP                 PIC 9(07)V9(02).
672000         10  PPS-CAPI-FSP                 PIC 9(07)V9(02).
672100         10  PPS-CAPI-OUTLIER             PIC 9(07)V9(02).
672200         10  PPS-CAPI-OLD-HARM            PIC 9(07)V9(02).
672300         10  PPS-CAPI-DSH-ADJ             PIC 9(07)V9(02).
672400         10  PPS-CAPI-IME-ADJ             PIC 9(07)V9(02).
672500         10  PPS-CAPI-EXCEPTIONS          PIC 9(07)V9(02).
672600     05  PPS-CAPITAL2-VARIABLES.
672700         10  PPS-CAPI2-PAY-CODE             PIC X(1).
672800         10  PPS-CAPI2-B-FSP                PIC 9(07)V9(02).
672900         10  PPS-CAPI2-B-OUTLIER            PIC 9(07)V9(02).
673000
673100     05  PPS-OTHER-VARIABLES.
673200         10  PPS-NON-TEMP-RELIEF-PAYMENT    PIC 9(07)V9(02).
673300         10  PPS-NEW-TECH-PAY-ADD-ON        PIC 9(07)V9(02).
673400         10  PPS-LOW-VOL-PAYMENT            PIC 9(07)V9(02).
673500         10  PPS-VAL-BASED-PURCH-PARTIPNT   PIC X.
673600         10  PPS-VAL-BASED-PURCH-ADJUST     PIC 9V9(11).
673700         10  PPS-HOSP-READMISSION-REDU      PIC X.
673800         10  PPS-HOSP-HRR-ADJUSTMT          PIC 9V9(4).
673900         10  PPS-OPERATNG-DATA.
674000             15  PPS-MODEL1-BUNDLE-DISPRCNT  PIC V999.
674100             15  PPS-OPER-BASE-DRG-PAY       PIC 9(08)V99.
674200             15  PPS-OPER-HSP-AMT            PIC 9(08)V99.
674300
674400     05  PPS-PC-OTH-VARIABLES.
674500         10  PPS-OPER-DSH                   PIC 9(01)V9(04).
674600         10  PPS-CAPI-DSH                   PIC 9(01)V9(04).
674700         10  PPS-CAPI-HSP-PCT               PIC 9(01)V9(02).
674800         10  PPS-CAPI-FSP-PCT               PIC 9(01)V9(04).
674900         10  PPS-ARITH-ALOS                 PIC 9(02)V9(01).
675000         10  PPS-PR-WAGE-INDEX              PIC 9(02)V9(04).
675100         10  PPS-TRANSFER-ADJ               PIC 9(01)V9(04).
675200         10  PPS-PC-HMO-FLAG                PIC X(01).
675300         10  PPS-PC-COT-FLAG                PIC X(01).
675400         10  PPS-OPER-HSP-PART2             PIC 9(07)V9(02).
675500         10  PPS-BUNDLE-ADJUST-PAY          PIC S9(07)V99.
675600
675700     05  PPS-ADDITIONAL-PAY-INFO-DATA.
675800         10 PPS-UNCOMP-CARE-AMOUNT          PIC S9(07)V9(02).
675900         10 PPS-BUNDLE-ADJUST-AMT           PIC S9(07)V9(02).
676000         10 PPS-VAL-BASED-PURCH-ADJUST-AMT  PIC S9(07)V9(02).
676100         10 PPS-READMIS-ADJUST-AMT          PIC S9(07)V9(02).
676200     05  PPS-ADDITIONAL-PAY-INFO-DATA2.
676300         10  PPS-HAC-PROG-REDUC-IND      PIC X.
676400         10  PPS-EHR-PROG-REDUC-IND      PIC X.
676500         10  PPS-EHR-ADJUST-AMT          PIC S9(07)V9(02).
676600         10  PPS-STNDRD-VALUE            PIC S9(07)V9(02).
676700         10  PPS-FLX6-PAYMENT            PIC S9(07)V9(02).
676800         10  PPS-FLX7-PAYMENT            PIC S9(07)V9(02).
676900     05 PPS-FILLER                       PIC X(0906).
677000
677100 01  PROV-NEW-HOLD.
677200     02  PROV-NEWREC-HOLD1.
677300         05  P-NEW-NPI10.
677400             10  P-NEW-NPI8             PIC X(08).
677500             10  P-NEW-NPI-FILLER       PIC X(02).
677600         05  P-NEW-PROVIDER-NO.
677700             88  P-NEW-DSH-ADJ-PROVIDERS
677800                             VALUE '180049' '190044' '190144'
677900                                   '190191' '330047' '340085'
678000                                   '370016' '370149' '420043'.
678100             10  P-NEW-STATE            PIC 9(02).
678200                 88  P-VBP-INVALID-STATE
678300                             VALUE 21 80 40.
678400                 88  P-READ-INVALID-STATE
678500                             VALUE 40.
678600             10  FILLER                 PIC X(04).
678700         05  P-NEW-DATE-DATA.
678800             10  P-NEW-EFF-DATE.
678900                 15  P-NEW-EFF-DT-CC    PIC 9(02).
679000                 15  P-NEW-EFF-DT-YY    PIC 9(02).
679100                 15  P-NEW-EFF-DT-MM    PIC 9(02).
679200                 15  P-NEW-EFF-DT-DD    PIC 9(02).
679300             10  P-NEW-FY-BEGIN-DATE.
679400                 15  P-NEW-FY-BEG-DT-CC PIC 9(02).
679500                 15  P-NEW-FY-BEG-DT-YY PIC 9(02).
679600                 15  P-NEW-FY-BEG-DT-MM PIC 9(02).
679700                 15  P-NEW-FY-BEG-DT-DD PIC 9(02).
679800             10  P-NEW-REPORT-DATE.
679900                 15  P-NEW-REPORT-DT-CC PIC 9(02).
680000                 15  P-NEW-REPORT-DT-YY PIC 9(02).
680100                 15  P-NEW-REPORT-DT-MM PIC 9(02).
680200                 15  P-NEW-REPORT-DT-DD PIC 9(02).
680300             10  P-NEW-TERMINATION-DATE.
680400                 15  P-NEW-TERM-DT-CC   PIC 9(02).
680500                 15  P-NEW-TERM-DT-YY   PIC 9(02).
680600                 15  P-NEW-TERM-DT-MM   PIC 9(02).
680700                 15  P-NEW-TERM-DT-DD   PIC 9(02).
680800         05  P-NEW-WAIVER-CODE          PIC X(01).
680900             88  P-NEW-WAIVER-STATE       VALUE 'Y'.
681000         05  P-NEW-INTER-NO             PIC 9(05).
681100         05  P-NEW-PROVIDER-TYPE        PIC X(02).
681200             88  P-N-SOLE-COMMUNITY-PROV    VALUE '01' '11'.
681300             88  P-N-REFERRAL-CENTER        VALUE '07' '11'
681400                                                  '15' '17'
681500                                                  '22'.
681600             88  P-N-INDIAN-HEALTH-SERVICE  VALUE '08'.
681700             88  P-N-REDESIGNATED-RURAL-YR1 VALUE '09'.
681800             88  P-N-REDESIGNATED-RURAL-YR2 VALUE '10'.
681900             88  P-N-SOLE-COM-REF-CENT      VALUE '11'.
682000             88  P-N-MDH-REBASED-FY90       VALUE '14' '15'.
682100             88  P-N-MDH-RRC-REBASED-FY90   VALUE '15'.
682200             88  P-N-SCH-REBASED-FY90       VALUE '16' '17'.
682300             88  P-N-SCH-RRC-REBASED-FY90   VALUE '17'.
682400             88  P-N-MEDICAL-ASSIST-FACIL   VALUE '18'.
682500             88  P-N-EACH                   VALUE '21' '22'.
682600             88  P-N-EACH-REFERRAL-CENTER   VALUE '22'.
682700             88  P-N-NHCMQ-II-SNF           VALUE '32'.
682800             88  P-N-NHCMQ-III-SNF          VALUE '33'.
682900             88  P-N-INVALID-PROV-TYPES     VALUE '14' '15'.
683000         05  P-NEW-CURRENT-CENSUS-DIV   PIC 9(01).
683100             88  P-N-NEW-ENGLAND            VALUE  1.
683200             88  P-N-MIDDLE-ATLANTIC        VALUE  2.
683300             88  P-N-SOUTH-ATLANTIC         VALUE  3.
683400             88  P-N-EAST-NORTH-CENTRAL     VALUE  4.
683500             88  P-N-EAST-SOUTH-CENTRAL     VALUE  5.
683600             88  P-N-WEST-NORTH-CENTRAL     VALUE  6.
683700             88  P-N-WEST-SOUTH-CENTRAL     VALUE  7.
683800             88  P-N-MOUNTAIN               VALUE  8.
683900             88  P-N-PACIFIC                VALUE  9.
684000         05  P-NEW-CURRENT-DIV   REDEFINES
684100                    P-NEW-CURRENT-CENSUS-DIV   PIC 9(01).
684200             88  P-N-VALID-CENSUS-DIV    VALUE 1 THRU 9.
684300         05  P-NEW-MSA-DATA.
684400             10  P-NEW-CHG-CODE-INDEX       PIC X.
684500             10  P-NEW-GEO-LOC-MSAX         PIC X(04) JUST RIGHT.
684600             10  P-NEW-GEO-LOC-MSA9   REDEFINES
684700                             P-NEW-GEO-LOC-MSAX  PIC 9(04).
684800             10  P-NEW-WAGE-INDEX-LOC-MSA   PIC X(04) JUST RIGHT.
684900             10  P-NEW-STAND-AMT-LOC-MSA    PIC X(04) JUST RIGHT.
685000             10  P-NEW-STAND-AMT-LOC-MSA9
685100       REDEFINES P-NEW-STAND-AMT-LOC-MSA.
685200                 15  P-NEW-RURAL-1ST.
685300                     20  P-NEW-STAND-RURAL  PIC XX.
685400                         88  P-NEW-STD-RURAL-CHECK VALUE '  '.
685500                 15  P-NEW-RURAL-2ND        PIC XX.
685600         05  P-NEW-SOL-COM-DEP-HOSP-YR PIC XX.
685700                 88  P-NEW-SCH-YRBLANK    VALUE   '  '.
685800                 88  P-NEW-SCH-YR82       VALUE   '82'.
685900                 88  P-NEW-SCH-YR87       VALUE   '87'.
686000         05  P-NEW-LUGAR                    PIC X.
686100         05  P-NEW-TEMP-RELIEF-IND          PIC X.
686200         05  P-NEW-FED-PPS-BLEND-IND        PIC X.
686300         05  FILLER                         PIC X(05).
686400     02  PROV-NEWREC-HOLD2.
686500         05  P-NEW-VARIABLES.
686600             10  P-NEW-FAC-SPEC-RATE     PIC  9(05)V9(02).
686700             10  P-NEW-COLA              PIC  9(01)V9(03).
686800             10  P-NEW-INTERN-RATIO      PIC  9(01)V9(04).
686900             10  P-NEW-BED-SIZE          PIC  9(05).
687000             10  P-NEW-OPER-CSTCHG-RATIO PIC  9(01)V9(03).
687100             10  P-NEW-CMI               PIC  9(01)V9(04).
687200             10  P-NEW-SSI-RATIO         PIC  V9(04).
687300             10  P-NEW-MEDICAID-RATIO    PIC  V9(04).
687400             10  P-NEW-PPS-BLEND-YR-IND  PIC  9(01).
687500             10  P-NEW-PRUF-UPDTE-FACTOR PIC  9(01)V9(05).
687600             10  P-NEW-DSH-PERCENT       PIC  V9(04).
687700             10  P-NEW-FYE-DATE          PIC  X(08).
687800         05  P-NEW-CBSA-DATA.
687900             10  P-NEW-CBSA-SPEC-PAY-IND    PIC X.
688000             10  P-NEW-CBSA-HOSP-QUAL-IND   PIC X.
688100             10  P-NEW-CBSA-GEO-LOC         PIC X(05) JUST RIGHT.
688200             10  P-NEW-CBSA-GEO-RURAL REDEFINES
688300                 P-NEW-CBSA-GEO-LOC.
688400                 15  P-NEW-CBSA-GEO-RURAL1ST PIC XXX.
688500                     88  P-NEW-CBSA-GEO-RURAL1    VALUE '   '.
688600                 15  P-NEW-CBSA-GEO-RURAL2ND PIC XX.
688700
688800             10  P-NEW-CBSA-RECLASS-LOC     PIC X(05) JUST RIGHT.
688900             10  P-NEW-CBSA-STAND-AMT-LOC   PIC X(05) JUST RIGHT.
689000             10  P-NEW-CBSA-SPEC-WAGE-INDEX    PIC 9(02)V9(04).
689100     02  PROV-NEWREC-HOLD3.
689200         05  P-NEW-PASS-AMT-DATA.
689300             10  P-NEW-PASS-AMT-CAPITAL    PIC 9(04)V99.
689400             10  P-NEW-PASS-AMT-DIR-MED-ED PIC 9(04)V99.
689500             10  P-NEW-PASS-AMT-ORGAN-ACQ  PIC 9(04)V99.
689600             10  P-NEW-PASS-AMT-PLUS-MISC  PIC 9(04)V99.
689700         05  P-NEW-CAPI-DATA.
689800             15  P-NEW-CAPI-PPS-PAY-CODE   PIC X.
689900             15  P-NEW-CAPI-HOSP-SPEC-RATE PIC 9(04)V99.
690000             15  P-NEW-CAPI-OLD-HARM-RATE  PIC 9(04)V99.
690100             15  P-NEW-CAPI-NEW-HARM-RATIO PIC 9(01)V9999.
690200             15  P-NEW-CAPI-CSTCHG-RATIO   PIC 9V999.
690300             15  P-NEW-CAPI-NEW-HOSP       PIC X.
690400             15  P-NEW-CAPI-IME            PIC 9V9999.
690500             15  P-NEW-CAPI-EXCEPTIONS     PIC 9(04)V99.
690600         05  P-HVBP-HRR-DATA.
690700             15  P-VAL-BASED-PURCH-PARTIPNT PIC X.
690800             15  P-VAL-BASED-PURCH-ADJUST   PIC 9V9(11).
690900             15  P-HOSP-READMISSION-REDU    PIC X.
691000             15  P-HOSP-HRR-ADJUSTMT        PIC 9V9(4).
691100         05  P-MODEL1-BUNDLE-DATA.
691200             15  P-MODEL1-BUNDLE-DISPRCNT   PIC V999.
691300             15  P-HAC-REDUC-IND            PIC X.
691400             15  P-UNCOMP-CARE-AMOUNT       PIC 9(07)V99.
691500             15  P-EHR-REDUC-IND            PIC X.
691600         05  FILLER                         PIC X(09).
691700
691800*****************************************************************
691900 01  WAGE-NEW-CBSA-INDEX-RECORD.
692000     05  W-CBSA                        PIC X(5).
692100     05  W-CBSA-SIZE                   PIC X.
692200         88  LARGE-URBAN       VALUE 'L'.
692300         88  OTHER-URBAN       VALUE 'O'.
692400         88  ALL-RURAL         VALUE 'R'.
692500     05  W-CBSA-EFF-DATE               PIC X(8).
692600     05  FILLER                        PIC X.
692700     05  W-CBSA-INDEX-RECORD           PIC S9(02)V9(04).
692800     05  W-CBSA-PR-INDEX-RECORD        PIC S9(02)V9(04).
692900
693000
693100 PROCEDURE DIVISION  USING BILL-NEW-DATA
693200                           PPS-DATA
693300                           PRICER-OPT-VERS-SW
693400                           PPS-ADDITIONAL-VARIABLES
693500                           PROV-NEW-HOLD
693600                           WAGE-NEW-CBSA-INDEX-RECORD.
693700
693800***************************************************************
693900*    PROCESSING:                                              *
694000*        A. WILL PROCESS CASES BASED ON DISCHARGE DATE
694100*        B. INITIALIZE PPCAL  HOLD VARIABLES.                 *
694200*        C. EDIT THE DATA PASSED FROM THE BILL BEFORE         *
694300*           ATTEMPTING TO CALCULATE PPS. IF THIS BILL         *
694400*           CANNOT BE PROCESSED, SET A RETURN CODE AND        *
694500*           GOBACK.                                           *
694600*        D. ASSEMBLE PRICING COMPONENTS.                      *
694700*        E. CALCULATE THE PRICE.                              *
694800***************************************************************
694900
695000     MOVE ZEROES TO NON-TEMP-RELIEF-PAYMENT.
695100     MOVE ZEROES TO WK-UNCOMP-CARE-AMOUNT.
695200     MOVE ZEROES TO H-BUNDLE-ADJUST-AMT.
695300     MOVE ZEROES TO H-VAL-BASED-PURCH-ADJUST-AMT.
695400     MOVE ZEROES TO H-READMIS-ADJUST-AMT.
695500     MOVE 'N' TO TEMP-RELIEF-FLAG.
695600     MOVE 'N' TO OUTLIER-RECON-FLAG.
695700
695800     PERFORM 0200-MAINLINE-CONTROL THRU 0200-EXIT.
695900
696000     MOVE HOLD-ADDITIONAL-VARIABLES TO  PPS-ADDITIONAL-VARIABLES.
696100     MOVE H-DSCHG-FRCTN             TO  PPS-DSCHG-FRCTN.
696200     MOVE H-DRG-WT-FRCTN            TO  PPS-DRG-WT-FRCTN.
696300     MOVE HOLD-CAPITAL-VARIABLES    TO  PPS-CAPITAL-VARIABLES.
696400     MOVE HOLD-CAPITAL2-VARIABLES   TO  PPS-CAPITAL2-VARIABLES.
696500     MOVE CAL-VERSION               TO  PPS-CALC-VERS.
696600     MOVE HOLD-OTHER-VARIABLES      TO  PPS-OTHER-VARIABLES.
696700     MOVE HOLD-PC-OTH-VARIABLES     TO  PPS-PC-OTH-VARIABLES.
696800     MOVE H-ADDITIONAL-PAY-INFO-DATA TO
696900                            PPS-ADDITIONAL-PAY-INFO-DATA.
697000     MOVE H-ADDITIONAL-PAY-INFO-DATA2 TO
697100                            PPS-ADDITIONAL-PAY-INFO-DATA2.
697200
697300
697400     COMPUTE PPS-OPER-HSP-PART2 ROUNDED =  1 *  H-HSP-RATE.
697500     MOVE    WK-UNCOMP-CARE-AMOUNT TO PPS-UNCOMP-CARE-AMOUNT.
697600     MOVE    H-BUNDLE-ADJUST-AMT TO PPS-BUNDLE-ADJUST-AMT.
697700     MOVE    H-VAL-BASED-PURCH-ADJUST-AMT TO
697800                           PPS-VAL-BASED-PURCH-ADJUST-AMT.
697900     MOVE    H-READMIS-ADJUST-AMT TO PPS-READMIS-ADJUST-AMT.
698000     MOVE    P-MODEL1-BUNDLE-DISPRCNT TO
698100                               PPS-MODEL1-BUNDLE-DISPRCNT.
698200
698300     IF (PPS-RTC = '00' OR '03' OR '10' OR
698400                   '12' OR '14')
698500        MOVE 'Y' TO OUTLIER-RECON-FLAG
698600        MOVE PPS-DATA TO HLD-PPS-DATA
698700        PERFORM 0200-MAINLINE-CONTROL THRU 0200-EXIT
698800        MOVE HLD-PPS-DATA TO PPS-DATA.
698900
699000     MOVE ' ' TO      PPS-HAC-PROG-REDUC-IND.
699100     MOVE ' ' TO      PPS-EHR-PROG-REDUC-IND.
699200     MOVE 0     TO    PPS-EHR-ADJUST-AMT.
699300     MOVE 0     TO    PPS-STNDRD-VALUE.
699400     MOVE 0     TO    PPS-FLX6-PAYMENT.
699500     MOVE 0     TO    PPS-FLX7-PAYMENT.
699600
699700     GOBACK.
699800
699900 0200-MAINLINE-CONTROL.
700000
700100     MOVE 'N' TO HMO-TAG.
700200
700300     IF PPS-PC-HMO-FLAG = 'Y' OR
700400               HMO-FLAG = 'Y'
700500        MOVE 'Y' TO HMO-TAG.
700600
700700     IF P-NEW-STATE NOT = 40
700800        MOVE ZEROES TO W-CBSA-PR-INDEX-RECORD.
700900
701000     MOVE ALL '0' TO PPS-DATA
701100                     H-OPER-DSH-SCH
701200                     H-OPER-DSH-RRC
701300                     HOLD-PPS-COMPONENTS
701400                     HOLD-PPS-COMPONENTS
701500                     HOLD-ADDITIONAL-VARIABLES
701600                     HOLD-CAPITAL-VARIABLES
701700                     HOLD-CAPITAL2-VARIABLES
701800                     HOLD-OTHER-VARIABLES
701900                     HOLD-PC-OTH-VARIABLES
702000                     H-ADDITIONAL-PAY-INFO-DATA
702100                     H-ADDITIONAL-PAY-INFO-DATA2.
702200
702300     IF P-NEW-CAPI-HOSP-SPEC-RATE NOT NUMERIC
702400        MOVE 0 TO P-NEW-CAPI-HOSP-SPEC-RATE.
702500
702600     IF P-NEW-CAPI-OLD-HARM-RATE  NOT NUMERIC
702700        MOVE 0 TO P-NEW-CAPI-OLD-HARM-RATE.
702800
702900     IF P-NEW-CAPI-NEW-HARM-RATIO NOT NUMERIC
703000        MOVE 0 TO P-NEW-CAPI-NEW-HARM-RATIO.
703100
703200     IF P-NEW-CAPI-CSTCHG-RATIO NOT NUMERIC
703300        MOVE 0 TO P-NEW-CAPI-CSTCHG-RATIO.
703400
703500     IF P-HOSP-HRR-ADJUSTMT     NOT NUMERIC
703600        MOVE 0 TO P-HOSP-HRR-ADJUSTMT.
703700
703800     IF P-VAL-BASED-PURCH-ADJUST NOT NUMERIC
703900        MOVE 0 TO P-VAL-BASED-PURCH-ADJUST.
704000
704100
704200     PERFORM 1000-EDIT-THE-BILL-INFO.
704300
704400     IF  PPS-RTC = 00
704500         PERFORM 2000-ASSEMBLE-PPS-VARIABLES
704600         PERFORM 3000-CALC-PAYMENT THRU 3000-EXIT.
704700
704800     IF OUTLIER-RECON-FLAG = 'Y'
704900        MOVE 'N' TO OUTLIER-RECON-FLAG
705000        GO TO 0200-EXIT.
705100
705200     IF PPS-RTC = 00
705300        IF H-PERDIEM-DAYS = H-ALOS OR
705400           H-PERDIEM-DAYS > H-ALOS
705500           MOVE 14 TO PPS-RTC.
705600
705700     IF PPS-RTC = 02
705800        IF H-PERDIEM-DAYS = H-ALOS OR
705900           H-PERDIEM-DAYS > H-ALOS
706000           MOVE 16 TO PPS-RTC.
706100
706200 0200-EXIT.   EXIT.
706300
706400 1000-EDIT-THE-BILL-INFO.
706500
706600     MOVE 1.00 TO H-CAPI-PAYCDE-PCT1.
706700     MOVE 0.00 TO H-CAPI-PAYCDE-PCT2.
706800
706900     IF  PPS-RTC = 00
707000         IF  P-NEW-WAIVER-STATE
707100             MOVE 53 TO PPS-RTC.
707200
707300     IF  PPS-RTC = 00
707400         IF   HLDDRG-VALID = 'I'
707500             MOVE 54 TO PPS-RTC.
707600
707700     IF  PPS-RTC = 00
707800            IF  ((B-DISCHARGE-DATE < P-NEW-EFF-DATE) OR
707900                 (B-DISCHARGE-DATE < W-CBSA-EFF-DATE))
708000                MOVE 55 TO PPS-RTC.
708100
708200     IF  PPS-RTC = 00
708300         IF P-NEW-TERMINATION-DATE > 00000000
708400            IF  ((B-DISCHARGE-DATE = P-NEW-TERMINATION-DATE) OR
708500                 (B-DISCHARGE-DATE > P-NEW-TERMINATION-DATE))
708600                  MOVE 55 TO PPS-RTC.
708700
708800     IF  PPS-RTC = 00
708900         IF  B-LOS NOT NUMERIC
709000             MOVE 56 TO PPS-RTC
709100         ELSE
709200         IF  B-LOS = 0
709300             IF B-REVIEW-CODE NOT = 00 AND
709400                              NOT = 03 AND
709500                              NOT = 06 AND
709600                              NOT = 07 AND
709700                              NOT = 09 AND
709800                              NOT = 11
709900             MOVE 56 TO PPS-RTC.
710000
710100     IF  PPS-RTC = 00
710200         IF  B-LTR-DAYS NOT NUMERIC OR B-LTR-DAYS > 60
710300             MOVE 61 TO PPS-RTC
710400         ELSE
710500             MOVE B-LTR-DAYS TO H-LTR-DAYS.
710600
710700     IF  PPS-RTC = 00
710800         IF  B-COVERED-DAYS NOT NUMERIC
710900             MOVE 62 TO PPS-RTC
711000         ELSE
711100         IF  B-COVERED-DAYS = 0 AND B-LOS > 0
711200             MOVE 62 TO PPS-RTC
711300         ELSE
711400             MOVE B-COVERED-DAYS TO H-COV-DAYS.
711500
711600     IF  PPS-RTC = 00
711700         IF  H-LTR-DAYS  > H-COV-DAYS
711800             MOVE 62 TO PPS-RTC
711900         ELSE
712000             COMPUTE H-REG-DAYS = H-COV-DAYS - H-LTR-DAYS.
712100
712200     IF  PPS-RTC = 00
712300         IF  NOT VALID-REVIEW-CODE
712400             MOVE 57 TO PPS-RTC.
712500
712600     IF  PPS-RTC = 00
712700         IF  B-CHARGES-CLAIMED NOT NUMERIC
712800             MOVE 58 TO PPS-RTC.
712900
713000     IF PPS-RTC = 00
713100           IF P-NEW-CAPI-NEW-HOSP NOT = 'Y'
713200                 IF P-NEW-CAPI-PPS-PAY-CODE NOT = 'A' AND
713300                                            NOT = 'B' AND
713400                                            NOT = 'C'
713500                 MOVE 65 TO PPS-RTC.
713600
713700*    IF PPS-RTC = 00
713800*          IF P-N-INVALID-PROV-TYPES
713900*                MOVE 52 TO PPS-RTC.
714000
714100 2000-ASSEMBLE-PPS-VARIABLES.
714200***  GET THE PROVIDER SPECIFIC VARIABLES.
714300***  GET THE PROVIDER SPECIFIC VARIABLES.
714400
714500     MOVE P-NEW-FAC-SPEC-RATE TO H-FAC-SPEC-RATE.
714600     MOVE P-NEW-INTERN-RATIO TO H-INTERN-RATIO.
714700
714800     IF  (P-NEW-STATE = 02 OR 12)
714900         MOVE P-NEW-COLA TO H-OPER-COLA
715000     ELSE
715100         MOVE 1.000  TO H-OPER-COLA.
715200
715300***************************************************************
715400***  GET THE DRG RELATIVE WEIGHTS, ALOS, DAYS CUTOFF
715500***  GET THE DRG RELATIVE WEIGHTS, ALOS, DAYS CUTOFF
715600
715700     PERFORM 2600-GET-DRG-WEIGHT THRU 2600-EXIT.
715800
715900     PERFORM 4410-UNCOMP-CARE-CODE-RTN THRU 4410-EXIT.
716000
716100     MOVE P-NEW-STATE            TO MES-PPS-STATE.
716200*****YEARCHANGE 2011.0 ** NOT USED 2012 *******************
716300** USING THE STATE FACTORS TO ALTER THE WAGE INDEX WAS STOPPED*
716400** FOR FY 2011
716500***************************************************************
716600*    PERFORM 4200-SSRFBN-CODE-RTN THRU 4200-EXIT.
716700*****YEARCHANGE 2011.0 ** NOT USED 2012 *******************
716800***************************************************************
716900***  GET THE WAGE-INDEX
717000***  GET THE WAGE-INDEX
717100
717200     MOVE W-CBSA-INDEX-RECORD TO H-WAGE-INDEX.
717300     MOVE W-CBSA-PR-INDEX-RECORD TO H-PR-WAGE-INDEX.
717400     MOVE P-NEW-STATE            TO MES-PPS-STATE.
717500*****YEARCHANGE 2011.0 ** NOT USED
717600
717700
717800
717900*****YEARCHANGE 2011.0 ** NOT USED 2013 *******************
718000
718100***************************************************************
718200***  GET THE LABOR, NON-LABOR STANDARD RATES
718300
718400     IF  P-NEW-STATE = 40
718500         MOVE 2 TO R2
718600         MOVE 3 TO R4
718700     ELSE
718800         MOVE 1 TO R2
718900         MOVE 1 TO R4.
719000
719100     IF  LARGE-URBAN
719200         MOVE 1 TO R3
719300     ELSE
719400         MOVE 2 TO R3.
719500
719600     IF ((P-NEW-CBSA-HOSP-QUAL-IND = '1') AND
719700        (H-WAGE-INDEX > 01.0000))
719800        PERFORM 2300-GET-LAB-NONLAB-TB1-RATES
719900             VARYING R1 FROM 1 BY 1 UNTIL R1 > 1.
720000
720100     IF ((P-NEW-CBSA-HOSP-QUAL-IND NOT = '1') AND
720200         (H-WAGE-INDEX > 01.0000))
720300        PERFORM 2300-GET-LAB-NONLAB-TB2-RATES
720400             VARYING R1 FROM 1 BY 1 UNTIL R1 > 1.
720500
720600     IF ((P-NEW-CBSA-HOSP-QUAL-IND  = '1') AND
720700         (H-WAGE-INDEX < 01.0000 OR H-WAGE-INDEX = 01.0000))
720800        PERFORM 2300-GET-LAB-NONLAB-TB3-RATES
720900             VARYING R1 FROM 1 BY 1 UNTIL R1 > 1.
721000
721100     IF ((P-NEW-CBSA-HOSP-QUAL-IND NOT = '1') AND
721200         (H-WAGE-INDEX < 01.0000 OR H-WAGE-INDEX = 01.0000))
721300        PERFORM 2300-GET-LAB-NONLAB-TB4-RATES
721400             VARYING R1 FROM 1 BY 1 UNTIL R1 > 1.
721500
721600     IF P-NEW-STATE = 40
721700        IF ((P-NEW-CBSA-HOSP-QUAL-IND = '1') AND
721800            (H-PR-WAGE-INDEX > 01.0000))
721900             PERFORM 2300-GET-PR-LAB-TB1-RATES
722000             VARYING R1 FROM 1 BY 1 UNTIL R1 > 1.
722100
722200
722300     IF P-NEW-STATE = 40
722400        IF ((P-NEW-CBSA-HOSP-QUAL-IND NOT = '1') AND
722500             (H-PR-WAGE-INDEX > 01.0000))
722600              PERFORM 2300-GET-PR-LAB-TB2-RATES
722700                  VARYING R1 FROM 1 BY 1 UNTIL R1 > 1.
722800
722900     IF P-NEW-STATE = 40
723000        IF ((P-NEW-CBSA-HOSP-QUAL-IND  = '1') AND
723100        (H-PR-WAGE-INDEX < 01.0000 OR H-PR-WAGE-INDEX = 01.0000))
723200          PERFORM 2300-GET-PR-LAB-TB3-RATES
723300              VARYING R1 FROM 1 BY 1 UNTIL R1 > 1.
723400
723500     IF P-NEW-STATE = 40
723600        IF ((P-NEW-CBSA-HOSP-QUAL-IND NOT = '1') AND
723700        (H-PR-WAGE-INDEX < 01.0000 OR H-PR-WAGE-INDEX = 01.0000))
723800          PERFORM 2300-GET-PR-LAB-TB4-RATES
723900              VARYING R1 FROM 1 BY 1 UNTIL R1 > 1.
724000
724100***************************************************************
724200***  GET THE HSP & FSP BLEND PERCENTS FOR THIS BILL
724300***  GET THE HSP & FSP BLEND PERCENTS FOR THIS BILL
724400
724500     MOVE 0.00  TO H-OPER-HSP-PCT.
724600     MOVE 1.00  TO H-OPER-FSP-PCT.
724700
724800***************************************************************
724900***  GET THE NATIONAL & REGIONAL BLEND PERCENTS FOR THIS BILL
725000***  GET THE NATIONAL & REGIONAL BLEND PERCENTS FOR THIS BILL
725100
725200      MOVE 1.00 TO H-NAT-PCT.
725300      MOVE 0.00 TO H-REG-PCT.
725400
725500     IF  P-NEW-STATE = 40
725600         MOVE 0.75 TO H-NAT-PCT
725700         MOVE 0.25 TO H-REG-PCT.
725800
725900     IF  P-N-SCH-REBASED-FY90 OR
726000         P-N-EACH OR
726100         P-N-MDH-REBASED-FY90
726200         MOVE 1.00 TO H-OPER-HSP-PCT.
726300
726400 2300-GET-LAB-NONLAB-TB1-RATES.
726500
726600     IF  B-DISCHARGE-DATE NOT < TB1-RATE-EFF-DATE (R1)
726700         MOVE TB1-REG-LABOR  (R1 R2 R3) TO H-REG-LABOR
726800         MOVE TB1-REG-NLABOR (R1 R2 R3) TO H-REG-NONLABOR
726900         MOVE TB1-REG-LABOR  (R1 R4 R3) TO H-NAT-LABOR
727000         MOVE TB1-REG-NLABOR (R1 R4 R3) TO H-NAT-NONLABOR.
727100
727200 2300-GET-LAB-NONLAB-TB2-RATES.
727300
727400     IF  B-DISCHARGE-DATE NOT < TB2-RATE-EFF-DATE (R1)
727500         MOVE TB2-REG-LABOR  (R1 R2 R3) TO H-REG-LABOR
727600         MOVE TB2-REG-NLABOR (R1 R2 R3) TO H-REG-NONLABOR
727700         MOVE TB2-REG-LABOR  (R1 R4 R3) TO H-NAT-LABOR
727800         MOVE TB2-REG-NLABOR (R1 R4 R3) TO H-NAT-NONLABOR.
727900
728000 2300-GET-LAB-NONLAB-TB3-RATES.
728100
728200     IF  B-DISCHARGE-DATE NOT < TB3-RATE-EFF-DATE (R1)
728300         MOVE TB3-REG-LABOR  (R1 R2 R3) TO H-REG-LABOR
728400         MOVE TB3-REG-NLABOR (R1 R2 R3) TO H-REG-NONLABOR
728500         MOVE TB3-REG-LABOR  (R1 R4 R3) TO H-NAT-LABOR
728600         MOVE TB3-REG-NLABOR (R1 R4 R3) TO H-NAT-NONLABOR.
728700
728800 2300-GET-LAB-NONLAB-TB4-RATES.
728900
729000     IF  B-DISCHARGE-DATE NOT < TB4-RATE-EFF-DATE (R1)
729100         MOVE TB4-REG-LABOR  (R1 R2 R3) TO H-REG-LABOR
729200         MOVE TB4-REG-NLABOR (R1 R2 R3) TO H-REG-NONLABOR
729300         MOVE TB4-REG-LABOR  (R1 R4 R3) TO H-NAT-LABOR
729400         MOVE TB4-REG-NLABOR (R1 R4 R3) TO H-NAT-NONLABOR.
729500
729600 2300-GET-PR-LAB-TB1-RATES.
729700
729800     IF  B-DISCHARGE-DATE NOT < TB1-RATE-EFF-DATE (R1)
729900         MOVE TB1-REG-LABOR  (R1 R2 R3) TO H-REG-LABOR
730000         MOVE TB1-REG-NLABOR (R1 R2 R3) TO H-REG-NONLABOR.
730100
730200 2300-GET-PR-LAB-TB2-RATES.
730300
730400     IF  B-DISCHARGE-DATE NOT < TB2-RATE-EFF-DATE (R1)
730500         MOVE TB2-REG-LABOR  (R1 R2 R3) TO H-REG-LABOR
730600         MOVE TB2-REG-NLABOR (R1 R2 R3) TO H-REG-NONLABOR.
730700
730800 2300-GET-PR-LAB-TB3-RATES.
730900
731000     IF  B-DISCHARGE-DATE NOT < TB3-RATE-EFF-DATE (R1)
731100         MOVE TB3-REG-LABOR  (R1 R2 R3) TO H-REG-LABOR
731200         MOVE TB3-REG-NLABOR (R1 R2 R3) TO H-REG-NONLABOR.
731300
731400 2300-GET-PR-LAB-TB4-RATES.
731500
731600     IF  B-DISCHARGE-DATE NOT < TB4-RATE-EFF-DATE (R1)
731700         MOVE TB4-REG-LABOR  (R1 R2 R3) TO H-REG-LABOR
731800         MOVE TB4-REG-NLABOR (R1 R2 R3) TO H-REG-NONLABOR.
731900
732000*
732100 2600-GET-DRG-WEIGHT.
732200
732300     IF  B-DISCHARGE-DATE NOT < WK-DRGX-EFF-DATE
732400     SET DRG-IDX TO 1
732500     SEARCH DRG-TAB VARYING DRG-IDX
732600         AT END
732700           MOVE ' NO DRG CODE    FOUND' TO HLDDRG-DESC
732800           MOVE 'I' TO  HLDDRG-VALID
732900       WHEN WK-DRG-DRGX(DRG-IDX) = B-DRG
733000         MOVE DRG-DATA-TAB(DRG-IDX) TO HLDDRG-DATA.
733100
733200
733300     MOVE HLDDRG-DATA TO WK-HLDDRG-DATA2.
733400     MOVE  HLDDRG-DRGX         TO HLDDRG-DRGX2.
733500     MOVE  HLDDRG-WEIGHT       TO HLDDRG-WEIGHT2
733600                                  H-DRG-WT.
733700     MOVE  HLDDRG-GMALOS       TO HLDDRG-GMALOS2
733800                                  H-ALOS.
733900     MOVE  HLDDRG-LOW          TO HLDDRG-LOW2.
734000     MOVE  HLDDRG-ARITH-ALOS   TO HLDDRG-ARITH-ALOS2
734100                                  H-ARITH-ALOS.
734200     MOVE  HLDDRG-PAC          TO HLDDRG-PAC2.
734300     MOVE  HLDDRG-SPPAC        TO HLDDRG-SPPAC2.
734400     MOVE  HLDDRG-DESC         TO HLDDRG-DESC2.
734500     MOVE  'V'                 TO HLDDRG-VALID.
734600     MOVE ZEROES               TO H-DAYS-CUTOFF.
734700
734800 2600-EXIT.   EXIT.
734900*
735000 3000-CALC-PAYMENT.
735100***************************************************************
735200
735300     PERFORM 3100-CALC-STAY-UTILIZATION.
735400     PERFORM 3300-CALC-OPER-FSP-AMT.
735500     PERFORM 3900A-CALC-OPER-DSH THRU 3900A-EXIT.
735600
735700***********************************************************
735800***  OPERATING IME CALCULATION
735900***  OPERATING IME CALCULATION
736000
736100     COMPUTE H-OPER-IME-TEACH ROUNDED =
736200            1.35 * ((1 + H-INTERN-RATIO) ** .405  - 1).
736300
736400***********************************************************
736500*
736600*    IF P-N-SCH-REBASED-FY90 OR
736700*       P-N-EACH OR
736800*       P-N-MDH-REBASED-FY90
736900*        PERFORM 3450-CALC-ADDITIONAL-HSP.
737000*
737100     MOVE 00                 TO  PPS-RTC.
737200     MOVE H-WAGE-INDEX       TO  PPS-WAGE-INDX.
737300     MOVE H-ALOS             TO  PPS-AVG-LOS.
737400     MOVE H-DAYS-CUTOFF      TO  PPS-DAYS-CUTOFF.
737500
737600     MOVE B-LOS TO H-PERDIEM-DAYS.
737700     IF H-PERDIEM-DAYS < 1
737800         MOVE 1 TO H-PERDIEM-DAYS.
737900     ADD 1 TO H-PERDIEM-DAYS.
738000
738100     MOVE 1 TO H-DSCHG-FRCTN.
738200
738300     COMPUTE H-DRG-WT-FRCTN ROUNDED = H-DSCHG-FRCTN * H-DRG-WT.
738400
738500     IF (PAY-PERDIEM-DAYS  OR
738600         PAY-XFER-NO-COST) OR
738700        (PAY-XFER-SPEC-DRG AND
738800         D-DRG-POSTACUTE-PERDIEM)
738900         COMPUTE H-TRANSFER-ADJ ROUNDED = H-PERDIEM-DAYS / H-ALOS
739000         COMPUTE H-DSCHG-FRCTN  ROUNDED = H-PERDIEM-DAYS / H-ALOS
739100         IF H-DSCHG-FRCTN > 1
739200              MOVE 1 TO H-DSCHG-FRCTN
739300              MOVE 1 TO H-TRANSFER-ADJ
739400         ELSE
739500              COMPUTE H-DRG-WT-FRCTN ROUNDED =
739600                  (H-PERDIEM-DAYS / H-ALOS) * H-DRG-WT.
739700
739800     IF (PAY-XFER-SPEC-DRG AND
739900         D-DRG-POSTACUTE-50-50)
740000         COMPUTE H-TRANSFER-ADJ ROUNDED = H-PERDIEM-DAYS / H-ALOS
740100         COMPUTE H-DSCHG-FRCTN  ROUNDED =
740200                        .5 + ((.5 * H-PERDIEM-DAYS) / H-ALOS)
740300         IF H-DSCHG-FRCTN > 1
740400              MOVE 1 TO H-DSCHG-FRCTN
740500              MOVE 1 TO H-TRANSFER-ADJ
740600         ELSE
740700              COMPUTE H-DRG-WT-FRCTN ROUNDED =
740800            (.5 + ((.5 * H-PERDIEM-DAYS) / H-ALOS)) * H-DRG-WT.
740900
741000
741100***********************************************************
741200***  CAPITAL DSH CALCULATION
741300***  CAPITAL DSH CALCULATION
741400
741500     MOVE 0 TO H-CAPI-DSH.
741600
741700     IF P-NEW-BED-SIZE NOT NUMERIC
741800         MOVE 0 TO P-NEW-BED-SIZE.
741900
742000     IF (W-CBSA-SIZE = 'O' OR 'L') AND P-NEW-BED-SIZE > 99
742100         COMPUTE H-CAPI-DSH ROUNDED = 2.7183 **
742200                  (.2025 * (P-NEW-SSI-RATIO
742300                          + P-NEW-MEDICAID-RATIO)) - 1.
742400
742500***********************************************************
742600***  CAPITAL IME TEACH CALCULATION
742700***  CAPITAL IME TEACH CALCULATION
742800
742900     MOVE 0 TO H-WK-CAPI-IME-TEACH.
743000
743100     IF P-NEW-CAPI-IME NUMERIC
743200        IF P-NEW-CAPI-IME > 1.5000
743300           MOVE 1.5000 TO P-NEW-CAPI-IME.
743400
743500*****YEARCHANGE 2009.5 ****************************************
743600***
743700***  PER POLICY, WE REMOVED THE .5 MULTIPLER
743800***
743900***********************************************************
744000     IF P-NEW-CAPI-IME NUMERIC
744100        COMPUTE H-WK-CAPI-IME-TEACH ROUNDED =
744200         ((2.7183 ** (.2822 * P-NEW-CAPI-IME)) - 1).
744300
744400*****YEARCHANGE 2009.5 ****************************************
744500***********************************************************
744600     MOVE 0.00 TO H-DAYOUT-PCT.
744700     MOVE 0.80 TO H-CSTOUT-PCT.
744800
744900*****************************************************************
745000**
745100** BURN DRGS FOR FY14 ARE 927, 928, 929, 933, 934 AND 935.
745200**
745300*****************************************************************
745400
745500     IF  B-DRG = 927 OR 928 OR 929 OR 933 OR 934 OR 935
745600             MOVE 0.90 TO H-CSTOUT-PCT.
745700
745800*****YEARCHANGE 2014.0 ****************************************
745900***     NATIONAL PERCENTAGE
746000     MOVE 0.6960   TO H-LABOR-PCT.
746100     MOVE 0.3040   TO H-NONLABOR-PCT.
746200
746300*****YEARCHANGE 2014.0 ****************************************
746400***     PUERTO RICO PERCENTAGE
746500     MOVE 0.6320   TO H-PR-LABOR-PCT.
746600     MOVE 0.3680   TO H-PR-NONLABOR-PCT.
746700*****YEARCHANGE 2014.0 ****************************************
746800
746900     IF (H-WAGE-INDEX < 01.0000 OR
747000         H-WAGE-INDEX = 01.0000)
747100        MOVE 0.6200 TO H-LABOR-PCT
747200        MOVE 0.3800 TO H-NONLABOR-PCT.
747300***
747400     IF P-NEW-STATE = 40
747500       IF (H-PR-WAGE-INDEX < 01.0000 OR
747600           H-PR-WAGE-INDEX = 01.0000)
747700          MOVE 0.6200 TO H-PR-LABOR-PCT
747800          MOVE 0.3800 TO H-PR-NONLABOR-PCT.
747900
748000
748100     IF  P-NEW-OPER-CSTCHG-RATIO NUMERIC
748200             MOVE P-NEW-OPER-CSTCHG-RATIO TO H-OPER-CSTCHG-RATIO
748300     ELSE
748400             MOVE 0.000 TO H-OPER-CSTCHG-RATIO.
748500
748600     IF P-NEW-CAPI-CSTCHG-RATIO NUMERIC
748700             MOVE P-NEW-CAPI-CSTCHG-RATIO TO H-CAPI-CSTCHG-RATIO
748800     ELSE
748900             MOVE 0.000 TO H-CAPI-CSTCHG-RATIO.
749000
749100***********************************************************
749200*****YEARCHANGE 2010.0 ************************************
749300***  CAPITAL PAYMENT METHOD B - YEARCHNG
749400***  CAPITAL PAYMENT METHOD B
749500
749600     IF W-CBSA-SIZE = 'L'
749700        MOVE 1.00 TO H-CAPI-LARG-URBAN
749800     ELSE
749900        MOVE 1.00 TO H-CAPI-LARG-URBAN.
750000
750100     COMPUTE H-CAPI-GAF    ROUNDED = (H-WAGE-INDEX ** .6848).
750200     COMPUTE H-PR-CAPI-GAF ROUNDED = (H-PR-WAGE-INDEX ** .6848).
750300
750400*****YEARCHANGE 2014.0 ************************************
750500     COMPUTE H-FEDERAL-RATE ROUNDED =
750600                                 (0429.31 * H-CAPI-GAF).
750700     COMPUTE H-PUERTO-RICO-RATE ROUNDED =
750800                                 (0209.82 * H-PR-CAPI-GAF).
750900*****YEARCHANGE 2014.0 ************************************
751000
751100     COMPUTE H-CAPI-COLA ROUNDED =
751200                     (.3152 * (H-OPER-COLA - 1) + 1).
751300
751400     MOVE H-FEDERAL-RATE TO H-CAPI-FED-RATE.
751500
751600     IF P-NEW-STATE = 40
751700        COMPUTE  H-CAPI-FED-RATE ROUNDED =
751800                 (H-NAT-PCT * H-FEDERAL-RATE) +
751900                 (H-REG-PCT * H-PUERTO-RICO-RATE).
752000***********************************************************
752100***  CAPITAL FSP CALCULATION
752200***  CAPITAL FSP CALCULATION
752300
752400     COMPUTE H-CAPI-FSP-PART ROUNDED =
752500                               H-DRG-WT       *
752600                               H-CAPI-FED-RATE *
752700                               H-CAPI-COLA *
752800                               H-CAPI-LARG-URBAN.
752900
753000***********************************************************
753100***  CAPITAL PAYMENT METHOD A
753200***  CAPITAL PAYMENT METHOD A
753300
753400     IF P-N-SCH-REBASED-FY90 OR P-N-EACH
753500        MOVE 1.00 TO H-CAPI-SCH
753600     ELSE
753700        MOVE 0.85 TO H-CAPI-SCH.
753800
753900***********************************************************
754000***********  CAPITAL OLD-HOLD-HARMLESS CALCULATION ***********
754100***********  CAPITAL OLD-HOLD-HARMLESS CALCULATION ***********
754200
754300     COMPUTE H-CAPI-OLD-HARMLESS ROUNDED =
754400                    (P-NEW-CAPI-OLD-HARM-RATE *
754500                    H-CAPI-SCH).
754600
754700***********************************************************
754800        IF PAY-PERDIEM-DAYS
754900            IF  H-PERDIEM-DAYS < H-ALOS
755000                IF  NOT (B-DRG = 789)
755100                    PERFORM 3500-CALC-PERDIEM-AMT
755200                    MOVE 03 TO PPS-RTC.
755300
755400        IF PAY-XFER-SPEC-DRG
755500            IF  H-PERDIEM-DAYS < H-ALOS
755600                IF  NOT (B-DRG = 789)
755700                    PERFORM 3550-CALC-PERDIEM-AMT.
755800
755900        IF  PAY-XFER-NO-COST
756000            MOVE 00 TO PPS-RTC
756100            IF H-PERDIEM-DAYS < H-ALOS
756200               IF  NOT (B-DRG = 789)
756300                   PERFORM 3500-CALC-PERDIEM-AMT
756400                   MOVE 06 TO PPS-RTC.
756500
756600     PERFORM 4000-CALC-TECH-ADDON THRU 4000-EXIT.
756700
756800     PERFORM 6000-CALC-READMIS-REDU THRU 6000-EXIT.
756900
757000     IF PPS-RTC = 65 OR 67 OR 68
757100               GO TO 3000-CONTINUE.
757200
757300     PERFORM 7000-CALC-VALUE-BASED-PURCH THRU 7000-EXIT.
757400
757500     IF PPS-RTC = 65 OR 67 OR 68
757600               GO TO 3000-CONTINUE.
757700
757800     PERFORM 8000-CALC-BUNDLE-REDU  THRU 8000-EXIT.
757900
758000     IF PPS-RTC = 65 OR 67 OR 68
758100               GO TO 3000-CONTINUE.
758200
758300     PERFORM 3600-CALC-OUTLIER THRU 3600-EXIT.
758400
758500     IF OUTLIER-RECON-FLAG = 'Y' GO TO 3000-EXIT.
758600
758700     IF PPS-RTC = 65 OR 67 OR 68
758800               GO TO 3000-CONTINUE.
758900
759000        IF PAY-XFER-SPEC-DRG
759100            IF  H-PERDIEM-DAYS < H-ALOS
759200                IF  NOT (B-DRG = 789)
759300                    PERFORM 3560-CHECK-RTN-CODE THRU 3560-EXIT.
759400
759500
759600        IF  PAY-PERDIEM-DAYS
759700            IF  H-OPER-OUTCST-PART > 0
759800                MOVE H-OPER-OUTCST-PART TO
759900                     H-OPER-OUTLIER-PART
760000                MOVE 05 TO PPS-RTC
760100            ELSE
760200            IF  PPS-RTC NOT = 03
760300                MOVE 00 TO PPS-RTC
760400                MOVE 0  TO H-OPER-OUTLIER-PART.
760500
760600        IF  PAY-PERDIEM-DAYS
760700            IF  H-CAPI-OUTCST-PART > 0
760800                MOVE H-CAPI-OUTCST-PART TO
760900                     H-CAPI-OUTLIER-PART
761000                MOVE 05 TO PPS-RTC
761100            ELSE
761200            IF  PPS-RTC NOT = 03
761300                MOVE 0  TO H-CAPI-OUTLIER-PART.
761400
761500
761600     IF P-N-SCH-REBASED-FY90 OR
761700        P-N-EACH OR
761800        P-N-MDH-REBASED-FY90
761900         PERFORM 3450-CALC-ADDITIONAL-HSP.
762000
762100
762200 3000-CONTINUE.
762300
762400***********************************************************
762500***  DETERMINES THE FEDERAL AMOUNT THAT WOULD BE PAID IF
762600***  THE PROVIDER WAS TYPE B-HOLD-HARMLESS 100% FED RATE
762700
762800     COMPUTE H-CAPI2-B-FSP-PART ROUNDED = H-CAPI-FSP-PART.
762900
763000***********************************************************
763100
763200     IF  PPS-RTC = 67
763300         MOVE H-OPER-DOLLAR-THRESHOLD TO
763400              WK-H-OPER-DOLLAR-THRESHOLD.
763500
763600     IF  PPS-RTC < 50
763700         PERFORM 3800-CALC-TOT-AMT THRU 3800-EXIT
763800     ELSE
763900         MOVE ALL '0' TO PPS-OPER-HSP-PART
764000                         PPS-OPER-FSP-PART
764100                         PPS-OPER-OUTLIER-PART
764200                         PPS-OUTLIER-DAYS
764300                         PPS-REG-DAYS-USED
764400                         PPS-LTR-DAYS-USED
764500                         PPS-TOTAL-PAYMENT
764600                         PPS-OPER-DSH-ADJ
764700                         PPS-OPER-IME-ADJ
764800                         H-DSCHG-FRCTN
764900                         H-DRG-WT-FRCTN
765000                         HOLD-ADDITIONAL-VARIABLES
765100                         HOLD-CAPITAL-VARIABLES
765200                         HOLD-CAPITAL2-VARIABLES
765300                         HOLD-OTHER-VARIABLES
765400                         HOLD-PC-OTH-VARIABLES
765500                        H-ADDITIONAL-PAY-INFO-DATA
765600                        H-ADDITIONAL-PAY-INFO-DATA2.
765700
765800     IF  PPS-RTC = 67
765900         MOVE WK-H-OPER-DOLLAR-THRESHOLD TO
766000                 H-OPER-DOLLAR-THRESHOLD.
766100
766200 3000-EXIT.  EXIT.
766300
766400 3100-CALC-STAY-UTILIZATION.
766500
766600     MOVE 0 TO PPS-REG-DAYS-USED.
766700     MOVE 0 TO PPS-LTR-DAYS-USED.
766800
766900     IF H-REG-DAYS > 0
767000        IF H-REG-DAYS > B-LOS
767100           MOVE B-LOS TO PPS-REG-DAYS-USED
767200        ELSE
767300           MOVE H-REG-DAYS TO PPS-REG-DAYS-USED
767400     ELSE
767500        IF H-LTR-DAYS > B-LOS
767600           MOVE B-LOS TO PPS-LTR-DAYS-USED
767700        ELSE
767800           MOVE H-LTR-DAYS TO PPS-LTR-DAYS-USED.
767900
768000
768100
768200 3300-CALC-OPER-FSP-AMT.
768300***********************************************************
768400***  OPERATING FSP CALCULATION
768500***  OPERATING FSP CALCULATION
768600
768700     COMPUTE H-OPER-FSP-PART ROUNDED =
768800           (H-NAT-PCT * (H-NAT-LABOR * H-WAGE-INDEX +
768900            H-NAT-NONLABOR * H-OPER-COLA) * H-DRG-WT)
769000                   ON SIZE ERROR MOVE 0 TO H-OPER-FSP-PART.
769100
769200     IF P-NEW-STATE = 40
769300       COMPUTE H-OPER-FSP-PART ROUNDED =
769400           (H-NAT-PCT * (H-NAT-LABOR * H-WAGE-INDEX +
769500            H-NAT-NONLABOR * H-OPER-COLA) * H-DRG-WT)
769600                           +
769700           (H-REG-PCT * (H-REG-LABOR * H-PR-WAGE-INDEX +
769800            H-REG-NONLABOR * H-OPER-COLA) * H-DRG-WT)
769900                   ON SIZE ERROR MOVE 0 TO H-OPER-FSP-PART.
770000
770100
770200 3500-CALC-PERDIEM-AMT.
770300***********************************************************
770400***  REVIEW CODE = 03 OR 06
770500***  OPERATING PERDIEM-AMT CALCULATION
770600***  OPERATING HSP AND FSP CALCULATION FOR TRANSFERS
770700
770800        COMPUTE H-OPER-FSP-PART ROUNDED =
770900        H-OPER-FSP-PART * H-TRANSFER-ADJ
771000        ON SIZE ERROR MOVE 0 TO H-OPER-FSP-PART.
771100
771200***********************************************************
771300***********************************************************
771400***  REVIEW CODE = 03 OR 06
771500***  CAPITAL   PERDIEM-AMT CALCULATION
771600***  CAPITAL   HSP AND FSP CALCULATION FOR TRANSFERS
771700
771800        COMPUTE H-CAPI-FSP-PART ROUNDED =
771900        H-CAPI-FSP-PART * H-TRANSFER-ADJ
772000        ON SIZE ERROR MOVE 0 TO H-CAPI-FSP-PART.
772100
772200***********************************************************
772300***  REVIEW CODE = 03 OR 06
772400***  CAPITAL PERDIEM-AMT, OLD-HARMLESS CALCULATION
772500***  CAPITAL PERDIEM-AMT, OLD-HARMLESS CALCULATION
772600
772700        COMPUTE H-CAPI-OLD-HARMLESS ROUNDED =
772800        H-CAPI-OLD-HARMLESS * H-TRANSFER-ADJ
772900        ON SIZE ERROR MOVE 0 TO H-CAPI-OLD-HARMLESS.
773000
773100 3550-CALC-PERDIEM-AMT.
773200***********************************************************
773300***  REVIEW CODE = 09  OR 11 TRANSFER WITH SPECIAL DRG
773400***  OPERATING PERDIEM-AMT CALCULATION
773500***  OPERATING HSP AND FSP CALCULATION FOR TRANSFERS
773600
773700     IF (D-DRG-POSTACUTE-50-50)
773800        MOVE 10 TO PPS-RTC
773900        COMPUTE H-OPER-FSP-PART ROUNDED =
774000        H-OPER-FSP-PART * H-DSCHG-FRCTN
774100        ON SIZE ERROR MOVE 0 TO H-OPER-FSP-PART.
774200
774300     IF (D-DRG-POSTACUTE-PERDIEM)
774400        MOVE 12 TO PPS-RTC
774500        COMPUTE H-OPER-FSP-PART ROUNDED =
774600        H-OPER-FSP-PART *  H-TRANSFER-ADJ
774700        ON SIZE ERROR MOVE 0 TO H-OPER-FSP-PART.
774800
774900***********************************************************
775000***  CAPITAL PERDIEM-AMT CALCULATION
775100***  CAPITAL HSP AND FSP CALCULATION FOR TRANSFERS
775200
775300     IF (D-DRG-POSTACUTE-50-50)
775400        MOVE 10 TO PPS-RTC
775500        COMPUTE H-CAPI-FSP-PART ROUNDED =
775600        H-CAPI-FSP-PART * H-DSCHG-FRCTN
775700        ON SIZE ERROR MOVE 0 TO H-CAPI-FSP-PART.
775800
775900     IF (D-DRG-POSTACUTE-PERDIEM)
776000        MOVE 12 TO PPS-RTC
776100        COMPUTE H-CAPI-FSP-PART ROUNDED =
776200        H-CAPI-FSP-PART *  H-TRANSFER-ADJ
776300        ON SIZE ERROR MOVE 0 TO H-CAPI-FSP-PART.
776400
776500***********************************************************
776600***  CAPITAL PERDIEM-AMT, OLD-HARMLESS CALCULATION
776700***  CAPITAL PERDIEM-AMT, OLD-HARMLESS CALCULATION
776800
776900     IF (D-DRG-POSTACUTE-50-50)
777000        MOVE 10 TO PPS-RTC
777100        COMPUTE H-CAPI-OLD-HARMLESS ROUNDED =
777200        H-CAPI-OLD-HARMLESS * H-DSCHG-FRCTN
777300        ON SIZE ERROR MOVE 0 TO H-CAPI-OLD-HARMLESS.
777400
777500     IF (D-DRG-POSTACUTE-PERDIEM)
777600        MOVE 12 TO PPS-RTC
777700        COMPUTE H-CAPI-OLD-HARMLESS ROUNDED =
777800        H-CAPI-OLD-HARMLESS *  H-TRANSFER-ADJ
777900        ON SIZE ERROR MOVE 0 TO H-CAPI-OLD-HARMLESS.
778000
778100 3560-CHECK-RTN-CODE.
778200
778300     IF (D-DRG-POSTACUTE-50-50)
778400        MOVE 10 TO PPS-RTC.
778500     IF (D-DRG-POSTACUTE-PERDIEM)
778600        MOVE 12 TO PPS-RTC.
778700
778800 3560-EXIT.    EXIT.
778900
779000 3600-CALC-OUTLIER.
779100***********************************************************
779200***  COST OUTLIER OPERATING AND CAPITAL CALCULATION
779300***  COST OUTLIER OPERATING AND CAPITAL CALCULATION
779400
779500     IF OUTLIER-RECON-FLAG = 'Y'
779600        COMPUTE H-OPER-CSTCHG-RATIO ROUNDED =
779700               (H-OPER-CSTCHG-RATIO + .2).
779800
779900     IF H-CAPI-CSTCHG-RATIO > 0 OR
780000       H-OPER-CSTCHG-RATIO > 0
780100        COMPUTE H-OPER-SHARE-DOLL-THRESHOLD ROUNDED =
780200                H-OPER-CSTCHG-RATIO /
780300               (H-OPER-CSTCHG-RATIO + H-CAPI-CSTCHG-RATIO)
780400        COMPUTE H-CAPI-SHARE-DOLL-THRESHOLD ROUNDED =
780500                H-CAPI-CSTCHG-RATIO /
780600               (H-OPER-CSTCHG-RATIO + H-CAPI-CSTCHG-RATIO)
780700     ELSE
780800         MOVE 0 TO H-OPER-SHARE-DOLL-THRESHOLD
780900                   H-CAPI-SHARE-DOLL-THRESHOLD.
781000
781100***********************************************************
781200*****YEARCHANGE 2014.0 ************************************
781300***  OUTLIER THRESHOLD AMOUNTS
781400***  OUTLIER THRESHOLD AMOUNTS
781500
781600*****YEARCHANGE 2014.0 ************************************
781700
781800     MOVE 21748.00 TO H-CST-THRESH.
781900
782000*****YEARCHANGE 2014.0 ************************************
782100
782200     IF (B-REVIEW-CODE = '03') AND
782300         H-PERDIEM-DAYS < H-ALOS
782400        COMPUTE H-CST-THRESH ROUNDED =
782500                      (H-CST-THRESH * H-TRANSFER-ADJ)
782600                ON SIZE ERROR MOVE 0 TO H-CST-THRESH.
782700
782800     IF ((B-REVIEW-CODE = '09') AND
782900         (H-PERDIEM-DAYS < H-ALOS))
783000         IF (D-DRG-POSTACUTE-PERDIEM)
783100            COMPUTE H-CST-THRESH ROUNDED =
783200                      (H-CST-THRESH * H-TRANSFER-ADJ)
783300                ON SIZE ERROR MOVE 0 TO H-CST-THRESH.
783400
783500     IF ((B-REVIEW-CODE = '09') AND
783600         (H-PERDIEM-DAYS < H-ALOS))
783700         IF (D-DRG-POSTACUTE-50-50)
783800           COMPUTE H-CST-THRESH ROUNDED =
783900          H-CST-THRESH * H-DSCHG-FRCTN
784000                ON SIZE ERROR MOVE 0 TO H-CST-THRESH.
784100
784200     COMPUTE H-OPER-DOLLAR-THRESHOLD ROUNDED =
784300        ((H-CST-THRESH * H-LABOR-PCT * H-WAGE-INDEX) +
784400         (H-CST-THRESH * H-NONLABOR-PCT * H-OPER-COLA)) *
784500          H-OPER-SHARE-DOLL-THRESHOLD.
784600
784700     IF P-NEW-STATE = 40
784800        COMPUTE H-OPER-PR-DOLLAR-THRESHOLD ROUNDED =
784900           ((H-CST-THRESH * H-PR-LABOR-PCT * H-PR-WAGE-INDEX) +
785000            (H-CST-THRESH * H-PR-NONLABOR-PCT * H-OPER-COLA)) *
785100             H-OPER-SHARE-DOLL-THRESHOLD
785200        COMPUTE H-OPER-DOLLAR-THRESHOLD ROUNDED =
785300               (H-OPER-DOLLAR-THRESHOLD * H-NAT-PCT) +
785400               (H-OPER-PR-DOLLAR-THRESHOLD * H-REG-PCT).
785500
785600***********************************************************
785700***********************************************************
785800
785900     COMPUTE H-CAPI-DOLLAR-THRESHOLD ROUNDED =
786000          H-CST-THRESH * H-CAPI-GAF * H-CAPI-LARG-URBAN *
786100          H-CAPI-SHARE-DOLL-THRESHOLD * H-CAPI-COLA.
786200
786300
786400     IF P-NEW-STATE = 40
786500        COMPUTE H-CAPI-PR-DOLLAR-THRESHOLD ROUNDED =
786600           H-CST-THRESH * H-PR-CAPI-GAF * H-CAPI-LARG-URBAN *
786700           H-CAPI-SHARE-DOLL-THRESHOLD * H-CAPI-COLA
786800        COMPUTE H-CAPI-DOLLAR-THRESHOLD ROUNDED =
786900               (H-CAPI-DOLLAR-THRESHOLD * H-NAT-PCT) +
787000               (H-CAPI-PR-DOLLAR-THRESHOLD * H-REG-PCT).
787100
787200***********************************************************
787300******NOW INCLUDES UNCOMPENSATED CARE**********************
787400
787500     COMPUTE H-OPER-COST-OUTLIER ROUNDED =
787600         ((H-OPER-FSP-PART * (1 + H-OPER-IME-TEACH))
787700                       +
787800           ((H-OPER-FSP-PART * H-OPER-DSH) * .25))
787900                       +
788000             H-OPER-DOLLAR-THRESHOLD
788100                       +
788200                WK-UNCOMP-CARE-AMOUNT
788300                       +
788400                 H-NEW-TECH-PAY-ADD-ON
788500                       -
788600                 H-NEW-TECH-ADDON-ISLET.
788700
788800     COMPUTE H-CAPI-COST-OUTLIER ROUNDED =
788900      (H-CAPI-FSP-PART * (1 + H-WK-CAPI-IME-TEACH + H-CAPI-DSH))
789000                       +
789100             H-CAPI-DOLLAR-THRESHOLD.
789200
789300     IF (P-NEW-CAPI-NEW-HOSP = 'Y')
789400         MOVE 0 TO H-CAPI-COST-OUTLIER.
789500
789600
789700***********************************************************
789800***  OPERATING COST CALCULATION
789900***  OPERATING COST CALCULATION
790000
790100     COMPUTE H-OPER-BILL-COSTS ROUNDED =
790200         B-CHARGES-CLAIMED * H-OPER-CSTCHG-RATIO
790300         ON SIZE ERROR MOVE 0 TO H-OPER-BILL-COSTS.
790400
790500
790600     IF  H-OPER-BILL-COSTS > H-OPER-COST-OUTLIER
790700         COMPUTE H-OPER-OUTCST-PART ROUNDED =
790800         H-CSTOUT-PCT * (H-OPER-BILL-COSTS -
790900                         H-OPER-COST-OUTLIER).
791000
791100     IF PAY-WITHOUT-COST OR
791200        PAY-XFER-NO-COST OR
791300        PAY-XFER-SPEC-DRG-NO-COST
791400         MOVE 0 TO H-OPER-OUTCST-PART.
791500
791600***********************************************************
791700***  CAPITAL COST CALCULATION
791800***  CAPITAL COST CALCULATION
791900
792000     COMPUTE H-CAPI-BILL-COSTS ROUNDED =
792100             B-CHARGES-CLAIMED * H-CAPI-CSTCHG-RATIO
792200         ON SIZE ERROR MOVE 0 TO H-CAPI-BILL-COSTS.
792300
792400     IF  H-CAPI-BILL-COSTS > H-CAPI-COST-OUTLIER
792500         COMPUTE H-CAPI-OUTCST-PART ROUNDED =
792600         H-CSTOUT-PCT * (H-CAPI-BILL-COSTS -
792700                         H-CAPI-COST-OUTLIER).
792800
792900     IF P-NEW-CAPI-PPS-PAY-CODE = 'A'
793000       COMPUTE H-CAPI-OUTCST-PART ROUNDED =
793100              (H-CAPI-OUTCST-PART * P-NEW-CAPI-NEW-HARM-RATIO).
793200
793300     IF P-NEW-CAPI-PPS-PAY-CODE = 'C'
793400        COMPUTE H-CAPI-OUTCST-PART ROUNDED =
793500               (H-CAPI-OUTCST-PART * H-CAPI-PAYCDE-PCT1).
793600
793700     IF (H-CAPI-BILL-COSTS   + H-OPER-BILL-COSTS) <
793800        (H-CAPI-COST-OUTLIER + H-OPER-COST-OUTLIER)
793900        MOVE 0 TO H-CAPI-OUTCST-PART
794000                  H-OPER-OUTCST-PART.
794100
794200     IF PAY-WITHOUT-COST OR
794300        PAY-XFER-NO-COST OR
794400        PAY-XFER-SPEC-DRG-NO-COST
794500         MOVE 0 TO H-CAPI-OUTCST-PART.
794600
794700***********************************************************
794800***  DETERMINES THE BILL TO BE COST  OUTLIER
794900
795000     IF (P-NEW-CAPI-NEW-HOSP = 'Y')
795100         MOVE 0 TO H-CAPI-OUTDAY-PART
795200                   H-CAPI-OUTCST-PART.
795300
795400     IF (H-OPER-OUTCST-PART + H-CAPI-OUTCST-PART) > 0
795500                 MOVE H-OPER-OUTCST-PART TO
795600                      H-OPER-OUTLIER-PART
795700                 MOVE H-CAPI-OUTCST-PART TO
795800                      H-CAPI-OUTLIER-PART
795900                 MOVE 02 TO PPS-RTC.
796000
796100     IF OUTLIER-RECON-FLAG = 'Y'
796200        IF (H-OPER-OUTCST-PART + H-CAPI-OUTCST-PART) > 0
796300           COMPUTE HLD-PPS-RTC = HLD-PPS-RTC + 30
796400           GO TO 3600-EXIT
796500        ELSE
796600           GO TO 3600-EXIT
796700     ELSE
796800        NEXT SENTENCE.
796900
797000
797100***********************************************************
797200***  DETERMINES IF COST OUTLIER
797300***  RECOMPUTES DOLLAR THRESHOLD TO BE SENT BACK WITH
797400***         RETURN CODE OF 02
797500
797600     MOVE 0 TO H-OPER-DOLLAR-THRESHOLD.
797700
797800     IF PPS-RTC = 02
797900             COMPUTE H-OPER-DOLLAR-THRESHOLD ROUNDED =
798000                     (H-CAPI-COST-OUTLIER  +
798100                      H-OPER-COST-OUTLIER)
798200                             /
798300                    (H-CAPI-CSTCHG-RATIO  +
798400                     H-OPER-CSTCHG-RATIO)
798500             ON SIZE ERROR MOVE 0 TO H-OPER-DOLLAR-THRESHOLD.
798600
798700***********************************************************
798800***  DETERMINES IF COST OUTLIER WITH LOS IS > COVERED  DAYS
798900***         RETURN CODE OF 67
799000
799100     IF PPS-RTC = 02
799200         IF ((H-REG-DAYS + H-LTR-DAYS) < B-LOS) OR
799300            PPS-PC-COT-FLAG = 'Y'
799400             MOVE 67 TO PPS-RTC.
799500***********************************************************
799600
799700***********************************************************
799800***  DETERMINES THE OUTLIER AMOUNT THAT WOULD BE PAID IF
799900***  THE PROVIDER WAS TYPE B-HOLD-HARMLESS 100% FED RATE
800000
800100     IF P-NEW-CAPI-PPS-PAY-CODE = 'A'
800200        COMPUTE H-CAPI2-B-OUTLIER-PART ROUNDED =
800300                H-CAPI-OUTLIER-PART / P-NEW-CAPI-NEW-HARM-RATIO
800400         ON SIZE ERROR MOVE 0 TO H-CAPI2-B-OUTLIER-PART.
800500
800600     IF P-NEW-CAPI-PPS-PAY-CODE = 'B'
800700        COMPUTE H-CAPI2-B-OUTLIER-PART ROUNDED =
800800                H-CAPI-OUTLIER-PART.
800900
801000     IF P-NEW-CAPI-PPS-PAY-CODE = 'C'
801100        COMPUTE H-CAPI2-B-OUTLIER-PART ROUNDED =
801200                H-CAPI-OUTLIER-PART / H-CAPI-PAYCDE-PCT1
801300         ON SIZE ERROR MOVE 0 TO H-CAPI2-B-OUTLIER-PART.
801400
801500 3600-EXIT.   EXIT.
801600
801700 3450-CALC-ADDITIONAL-HSP.
801800***********************************************************
801900*    OBRA 89 CALCULATE ADDITIONAL HSP PAYMENT FOR
802000*    SOLE COMMUNITY
802100*    AND ESSENTIAL ACCESS COMMUNITY HOSPITALS (EACH)
802200*    NOW REIMBURSED WITH 100% NATIONAL FEDERAL RATES
802300***********************************************************
802400***         GET THE UPDATING FACTOR
802500***         GET THE UPDATING FACTOR
802600
802700*****YEARCHANGE 2013.0 AND 2014.0******************************
802800     MOVE 0.998431 TO H-BUDG-NUTR130.
802900     MOVE 0.997989 TO H-BUDG-NUTR140.
803000*****YEARCHANGE 2014.0 ****************************************
803100
803200*****YEARCHANGE 2013.0 ****************************************
803300        MOVE 1.0180 TO H-UPDATE-130.
803400*****YEARCHANGE 2013.0 ****************************************
803500
803600     IF P-NEW-STATE = 40
803700*****YEARCHANGE 2013.0 ****************************************
803800        MOVE 1.0180 TO H-UPDATE-130.
803900*****YEARCHANGE 2013.0 ****************************************
804000
804100     IF P-NEW-CBSA-HOSP-QUAL-IND = '1'
804200*****YEARCHANGE 2014.0 ****************************************
804300        MOVE 1.0170 TO H-UPDATE-140
804400     ELSE
804500        MOVE 0.9970 TO H-UPDATE-140.
804600*****YEARCHANGE 2014.0 ****************************************
804700
804800     IF P-NEW-STATE = 40
804900*****YEARCHANGE 2014.0 ****************************************
805000        MOVE 1.0170 TO H-UPDATE-140.
805100*****YEARCHANGE 2014.0 ****************************************
805200
805300********YEARCHANGE 2014.0 *************************************
805400***         CASE MIX ADJUSTMENT - FOR 2013
805500***         SHORT STAY ADJUSTMENT - FOR 2014
805600     MOVE 0.9480 TO H-CASE-MIX-ADJ.
805700     MOVE 0.9980 TO H-SHORT-STAY-ADJ.
805800
805900     COMPUTE H-UPDATE-FACTOR ROUNDED =
806000                       (H-UPDATE-130 *
806100                        H-UPDATE-140 *
806200                        H-BUDG-NUTR130 *
806300                        H-BUDG-NUTR140 *
806400                        H-CASE-MIX-ADJ * H-SHORT-STAY-ADJ).
806500
806600     COMPUTE H-HSP-RATE ROUNDED =
806700         H-FAC-SPEC-RATE * H-UPDATE-FACTOR * H-DRG-WT.
806800***************************************************************
806900*
807000*    IF P-NEW-CBSA-HOSP-QUAL-IND = '1'
807100*       COMPUTE H-HSP-RATE ROUNDED =
807200*        (H-FAC-SPEC-RATE * 1) * H-UPDATE-FACTOR
807300*    ELSE
807400*       COMPUTE H-HSP-RATE ROUNDED =
807500*        ((H-FAC-SPEC-RATE / 1.036) * 1.016) * H-UPDATE-FACTOR.
807600*
807700***************************************************************
807800********YEARCHANGE 2011.0 *************************************
807900***     OUTLIER OFFSETS NO LONGER USED IN HSP COMPARISON
808000***     WE NOW USE THE ACTUAL OPERATING OUTLIER PAYMEMT
808100***     IN THE HSP COMPARRISON
808200
808300********YEARCHANGE 2014.0 *XXXXXX******************************
808400*      THE HSP BUCKET FOR SCH                      ************
808500*      ADDED UNCOMPENSATED CARE TO COMPARRISON FOR 2014 *******
808600***************************************************************
808700     COMPUTE H-FSP-RATE ROUNDED =
808800        ((H-NAT-PCT * (H-NAT-LABOR * H-WAGE-INDEX +
808900         H-NAT-NONLABOR * H-OPER-COLA)) * H-DRG-WT-FRCTN)
809000                           *
809100             (1 + H-OPER-IME-TEACH + (H-OPER-DSH * .25))
809200                               +
809300                         H-OPER-OUTLIER-PART
809400                   ON SIZE ERROR MOVE 0 TO H-FSP-RATE.
809500
809600     IF P-NEW-STATE = 40
809700       COMPUTE H-FSP-RATE ROUNDED =
809800         ((H-NAT-PCT * (H-NAT-LABOR * H-WAGE-INDEX +
809900         H-NAT-NONLABOR * H-OPER-COLA))  * H-DRG-WT-FRCTN)
810000                           *
810100         (1 + H-OPER-IME-TEACH + H-OPER-DSH) +
810200                            H-OPER-OUTLIER-PART
810300                               +
810400        ((H-REG-PCT * (H-REG-LABOR * H-PR-WAGE-INDEX +
810500         H-REG-NONLABOR * H-OPER-COLA)) * H-DRG-WT-FRCTN)
810600                           *
810700             (1 + H-OPER-IME-TEACH +(H-OPER-DSH * .25))
810800                   ON SIZE ERROR MOVE 0 TO H-FSP-RATE.
810900
811000****************************************************************
811100****         INCLUDE UNCOMPENSATED CARE PER CLAIM IN HSP
811200*****        CHOICE
811300
811400
811500     IF  H-HSP-RATE > (H-FSP-RATE + WK-UNCOMP-CARE-AMOUNT)
811600           COMPUTE H-OPER-HSP-PART ROUNDED =
811700             (H-HSP-RATE - (H-FSP-RATE + WK-UNCOMP-CARE-AMOUNT))
811800                   ON SIZE ERROR MOVE 0 TO H-OPER-HSP-PART
811900     ELSE
812000         MOVE 0 TO H-OPER-HSP-PART.
812100
812200***************************************************************
812300***  YEARCHANGE TURNING MDH BACK ON ***************************
812400***************************************************************
812500***         GET THE MDH REBASE
812600
812700
812800     IF  H-HSP-RATE > (H-FSP-RATE + WK-UNCOMP-CARE-AMOUNT)
812900         IF P-NEW-PROVIDER-TYPE = '14' OR '15'
813000           COMPUTE H-OPER-HSP-PART ROUNDED =
813100         (H-HSP-RATE - (H-FSP-RATE + WK-UNCOMP-CARE-AMOUNT)) * .75
813200                   ON SIZE ERROR MOVE 0 TO H-OPER-HSP-PART.
813300
813400***********************************************************
813500 3800-CALC-TOT-AMT.
813600***********************************************************
813700***  CALCULATE TOTALS FOR CAPITAL
813800***  CALCULATE TOTALS FOR CAPITAL
813900
814000     MOVE P-NEW-CAPI-PPS-PAY-CODE  TO H-CAPI2-PAY-CODE.
814100
814200     IF P-NEW-CAPI-PPS-PAY-CODE = 'A'
814300        MOVE P-NEW-CAPI-NEW-HARM-RATIO TO H-CAPI-FSP-PCT
814400        MOVE 0.00 TO H-CAPI-HSP-PCT.
814500
814600     IF P-NEW-CAPI-PPS-PAY-CODE = 'B'
814700        MOVE 0    TO H-CAPI-OLD-HARMLESS
814800        MOVE 1.00 TO H-CAPI-FSP-PCT
814900        MOVE 0.00 TO H-CAPI-HSP-PCT.
815000
815100     IF P-NEW-CAPI-PPS-PAY-CODE = 'C'
815200        MOVE 0    TO H-CAPI-OLD-HARMLESS
815300        MOVE H-CAPI-PAYCDE-PCT1 TO H-CAPI-FSP-PCT
815400        MOVE H-CAPI-PAYCDE-PCT2 TO H-CAPI-HSP-PCT.
815500
815600     COMPUTE H-CAPI-HSP ROUNDED =
815700         H-CAPI-HSP-PCT * H-CAPI-HSP-PART.
815800
815900     COMPUTE H-CAPI-FSP ROUNDED =
816000         H-CAPI-FSP-PCT * H-CAPI-FSP-PART.
816100
816200     MOVE P-NEW-CAPI-EXCEPTIONS TO H-CAPI-EXCEPTIONS.
816300
816400     MOVE H-CAPI-OLD-HARMLESS TO H-CAPI-OLD-HARM.
816500
816600     COMPUTE H-CAPI-DSH-ADJ ROUNDED =
816700             H-CAPI-FSP
816800              * H-CAPI-DSH.
816900
817000     COMPUTE H-CAPI-IME-ADJ ROUNDED =
817100          H-CAPI-FSP *
817200                 H-WK-CAPI-IME-TEACH.
817300
817400     COMPUTE H-CAPI-OUTLIER ROUNDED =
817500             1.00 * H-CAPI-OUTLIER-PART.
817600
817700     COMPUTE H-CAPI2-B-FSP ROUNDED =
817800             1.00 * H-CAPI2-B-FSP-PART.
817900
818000     COMPUTE H-CAPI2-B-OUTLIER ROUNDED =
818100             1.00 * H-CAPI2-B-OUTLIER-PART.
818200***********************************************************
818300***  IF CAPITAL IS NOT IN EFFECT FOR GIVEN PROVIDER
818400***        THIS ZEROES OUT ALL CAPITAL DATA
818500
818600     IF (P-NEW-CAPI-NEW-HOSP = 'Y')
818700        MOVE ALL '0' TO HOLD-CAPITAL-VARIABLES.
818800***********************************************************
818900
819000***********************************************************
819100***  CALCULATE FINAL TOTALS FOR OPERATING
819200***  CALCULATE FINAL TOTALS FOR OPERATING
819300
819400     IF (H-CAPI-OUTLIER > 0 AND
819500         PPS-OPER-OUTLIER-PART = 0)
819600            COMPUTE PPS-OPER-OUTLIER-PART =
819700                    PPS-OPER-OUTLIER-PART + .01.
819800
819900***********************************************************
820000***  LOW VOLUME CALCULATION
820100***  LOW VOLUME CALCULATION
820200
820300     MOVE 01.000 TO WK-LOW-VOL25PCT.
820400
820500     IF P-NEW-TEMP-RELIEF-IND = 'Y'
820600     MOVE P-NEW-PROVIDER-NO      TO MES-PPS-PROV
820700     PERFORM 4400-LOWVOL-CODE-RTN THRU 4400-EXIT.
820800
820900*****SET THE LOW-VOLUME DISCHARGE PERCENT
821000**   ADD ON TO 25% FOR DISCHARGES
821100**   FOR FY 2014 USE A FIXED FACTOR OF 0.25
821200
821300*    IF P-NEW-TEMP-RELIEF-IND = 'Y'
821400*           MOVE 00.250 TO WK-LOW-VOL25PCT
821500*           GO TO LOW-VOL-CALC.
821600
821700     IF P-NEW-TEMP-RELIEF-IND = 'Y'
821800     AND MESWK-LOWVOL-PROV-DISCHG <= 200
821900            MOVE 00.250 TO WK-LOW-VOL25PCT
822000            GO TO LOW-VOL-CALC.
822100
822200***  CALCULATE THE LOW VOLUME DISCHARGE PERCENT
822300***  SLIDING SCALE ADD ON FOR
822400
822500     IF P-NEW-TEMP-RELIEF-IND = 'Y'
822600        AND MESWK-LOWVOL-PROV-DISCHG > 200
822700        AND MESWK-LOWVOL-PROV-DISCHG < 1600
822800            COMPUTE  WK-LOW-VOL25PCT ROUNDED =
822900            ((4 / 14) - (MESWK-LOWVOL-PROV-DISCHG / 5600))
823000            GO TO LOW-VOL-CALC
823100     ELSE
823200           MOVE 01.000 TO WK-LOW-VOL25PCT.
823300
823400
823500 LOW-VOL-CALC.
823600
823700     MOVE ZERO TO PPS-OPER-DSH-ADJ.
823800************************************************
823900* FOR FY 2014 WE APPLY AN ADJUSTMENT OF 0.25 TO CALCULATE
824000* EMPERICAL DSH
824100************************************************
824200     IF  H-OPER-DSH NUMERIC
824300         COMPUTE PPS-OPER-DSH-ADJ ROUNDED =
824400                     (PPS-OPER-FSP-PART  * H-OPER-DSH) * .25.
824500
824600     COMPUTE PPS-OPER-IME-ADJ ROUNDED =
824700                         PPS-OPER-FSP-PART * H-OPER-IME-TEACH.
824800
824900
825000     COMPUTE PPS-OPER-FSP-PART ROUNDED =
825100                           H-OPER-FSP-PART * H-OPER-FSP-PCT.
825200
825300     COMPUTE PPS-OPER-HSP-PART ROUNDED =
825400                           H-OPER-HSP-PART * H-OPER-HSP-PCT.
825500
825600     COMPUTE PPS-OPER-OUTLIER-PART ROUNDED =
825700                         H-OPER-OUTLIER-PART * H-OPER-FSP-PCT.
825800
825900     COMPUTE PPS-NEW-TECH-PAY-ADD-ON ROUNDED =
826000                                H-NEW-TECH-PAY-ADD-ON -
826100                                H-NEW-TECH-ADDON-ISLET.
826200
826300     IF  WK-LOW-VOL25PCT < 1.000000
826400     COMPUTE WK-LOW-VOL-ADDON  ROUNDED =
826500              (PPS-OPER-HSP-PART
826600                         +
826700                   PPS-OPER-FSP-PART
826800                         +
826900                 PPS-OPER-OUTLIER-PART
827000                         +
827100                   PPS-OPER-DSH-ADJ
827200                         +
827300                      PPS-OPER-IME-ADJ
827400                           +
827500                    WK-UNCOMP-CARE-AMOUNT
827600                           +
827700                      H-CAPI-HSP
827800                           +
827900                     H-CAPI-FSP
828000                           +
828100                  H-CAPI-EXCEPTIONS
828200                           +
828300                   H-CAPI-OUTLIER
828400                           +
828500                   H-CAPI-DSH-ADJ
828600                           +
828700                   H-CAPI-IME-ADJ
828800                           +
828900                   H-CAPI-OLD-HARM
829000                           +
829100                 PPS-NEW-TECH-PAY-ADD-ON) *  WK-LOW-VOL25PCT
829200     ELSE
829300     COMPUTE WK-LOW-VOL-ADDON  ROUNDED = 0.000000.
829400
829500     COMPUTE H-LOW-VOL-PAYMENT ROUNDED = WK-LOW-VOL-ADDON.
829600
829700     IF HMO-TAG  = 'Y'
829800        PERFORM 3850-HMO-IME-ADJ.
829900
830000***********************************************************
830100***  CALCULATE FINAL TOTALS FOR CAPITAL AND OPERATING
830200***  CALCULATE FINAL TOTALS FOR CAPITAL AND OPERATING
830300
830400     COMPUTE H-CAPI-TOTAL-PAY ROUNDED =
830500             H-CAPI-HSP + H-CAPI-FSP + H-CAPI-EXCEPTIONS +
830600             H-CAPI-OUTLIER + H-CAPI-DSH-ADJ +
830700             H-CAPI-IME-ADJ + H-CAPI-OLD-HARM.
830800
830900***********************************************************
831000***  TOTAL PAYMENT NOW INCLUDES UNCOMPENSATED CARE AMOUNT
831100
831200     COMPUTE   PPS-TOTAL-PAYMENT ROUNDED =
831300               PPS-OPER-HSP-PART + PPS-OPER-FSP-PART +
831400               PPS-OPER-OUTLIER-PART + PPS-OPER-DSH-ADJ +
831500                      PPS-OPER-IME-ADJ
831600                           +
831700                 PPS-NEW-TECH-PAY-ADD-ON
831800                           +
831900                  WK-UNCOMP-CARE-AMOUNT
832000                           +
832100                  WK-LOW-VOL-ADDON
832200                           +
832300                 H-WK-PASS-AMT-PLUS-MISC
832400                           +
832500                   H-CAPI-TOTAL-PAY
832600                           +
832700                 H-READMIS-ADJUST-AMT
832800                           +
832900               H-VAL-BASED-PURCH-ADJUST-AMT
833000                           +
833100                 H-BUNDLE-ADJUST-AMT
833200                           +
833300                H-NEW-TECH-ADDON-ISLET.
833400
833500     MOVE     P-VAL-BASED-PURCH-PARTIPNT TO
833600              H-VAL-BASED-PURCH-PARTIPNT.
833700
833800     MOVE     P-VAL-BASED-PURCH-ADJUST   TO
833900              H-VAL-BASED-PURCH-ADJUST.
834000
834100     MOVE     P-HOSP-READMISSION-REDU    TO
834200              H-HOSP-READMISSION-REDU.
834300
834400     MOVE     P-HOSP-HRR-ADJUSTMT        TO
834500              H-HOSP-HRR-ADJUSTMT.
834600
834700 3800-EXIT.   EXIT.
834800
834900 3850-HMO-IME-ADJ.
835000***********************************************************
835100***  HMO CALC FOR PASS-THRU ADDON
835200***  HMO CALC FOR PASS-THRU ADDON
835300
835400     COMPUTE H-WK-PASS-AMT-PLUS-MISC ROUNDED =
835500          (P-NEW-PASS-AMT-PLUS-MISC -
835600          (P-NEW-PASS-AMT-ORGAN-ACQ +
835700           P-NEW-PASS-AMT-DIR-MED-ED)) * B-LOS.
835800
835900***********************************************************
836000***  HMO IME ADJUSTMENT --- NO LONGER PAID AS OF 10/01/2002
836100
836200     COMPUTE PPS-OPER-IME-ADJ ROUNDED =
836300                   PPS-OPER-IME-ADJ * .0.
836400
836500***********************************************************
836600
836700
836800 3900A-CALC-OPER-DSH.
836900
837000***  OPERATING DSH CALCULATION
837100***  OPERATING DSH CALCULATION
837200
837300      MOVE 0.0000 TO H-OPER-DSH.
837400
837500      COMPUTE H-WK-OPER-DSH ROUNDED  = (P-NEW-SSI-RATIO
837600                                     + P-NEW-MEDICAID-RATIO).
837700
837800***********************************************************
837900**1**    0-99 BEDS
838000***  NOT TO EXCEED 12%
838100
838200      IF (W-CBSA-SIZE = 'O' OR 'L') AND P-NEW-BED-SIZE < 100
838300                               AND H-WK-OPER-DSH > .1499
838400                               AND H-WK-OPER-DSH < .2020
838500        COMPUTE H-OPER-DSH ROUNDED = (H-WK-OPER-DSH - .15)
838600                                      * .65 + .025
838700        IF H-OPER-DSH > .1200  MOVE .1200 TO H-OPER-DSH.
838800
838900      IF (W-CBSA-SIZE = 'O' OR 'L') AND P-NEW-BED-SIZE < 100
839000                               AND H-WK-OPER-DSH > .2019
839100        COMPUTE H-OPER-DSH ROUNDED = (H-WK-OPER-DSH - .202)
839200                                      * .825 + .0588
839300        IF H-OPER-DSH > .1200  MOVE .1200 TO H-OPER-DSH.
839400
839500***********************************************************
839600**2**   100 + BEDS
839700***  NO CAP >> CAN EXCEED 12%
839800
839900      IF (W-CBSA-SIZE = 'O' OR 'L') AND P-NEW-BED-SIZE > 99
840000                               AND H-WK-OPER-DSH > .1499
840100                               AND H-WK-OPER-DSH < .2020
840200        COMPUTE H-OPER-DSH ROUNDED = (H-WK-OPER-DSH - .15)
840300                                      * .65 + .025.
840400
840500      IF (W-CBSA-SIZE = 'O' OR 'L') AND P-NEW-BED-SIZE > 99
840600                               AND H-WK-OPER-DSH > .2019
840700        COMPUTE H-OPER-DSH ROUNDED = (H-WK-OPER-DSH - .202)
840800                                      * .825 + .0588.
840900
841000***********************************************************
841100**3**   OTHER RURAL HOSPITALS LESS THEN 500 BEDS
841200***  NOT TO EXCEED 12%
841300
841400      IF W-CBSA-SIZE = 'R'     AND P-NEW-BED-SIZE < 500
841500                               AND H-WK-OPER-DSH > .1499
841600                               AND H-WK-OPER-DSH < .2020
841700        COMPUTE H-OPER-DSH ROUNDED = (H-WK-OPER-DSH - .15)
841800                                 * .65 + .025
841900        IF H-OPER-DSH > .1200
842000              MOVE .1200 TO H-OPER-DSH.
842100
842200      IF W-CBSA-SIZE = 'R'     AND P-NEW-BED-SIZE < 500
842300                               AND H-WK-OPER-DSH > .2019
842400        COMPUTE H-OPER-DSH ROUNDED = (H-WK-OPER-DSH - .202)
842500                                 * .825 + .0588
842600        IF H-OPER-DSH > .1200
842700                 MOVE .1200 TO H-OPER-DSH.
842800***********************************************************
842900**4**   OTHER RURAL HOSPITALS 500 BEDS +
843000***  NO CAP >> CAN EXCEED 12%
843100
843200      IF W-CBSA-SIZE = 'R'     AND P-NEW-BED-SIZE > 499
843300                               AND H-WK-OPER-DSH > .1499
843400                               AND H-WK-OPER-DSH < .2020
843500        COMPUTE H-OPER-DSH ROUNDED = (H-WK-OPER-DSH - .15)
843600                                 * .65 + .025.
843700
843800      IF W-CBSA-SIZE = 'R'     AND P-NEW-BED-SIZE > 499
843900                               AND H-WK-OPER-DSH > .2019
844000        COMPUTE H-OPER-DSH ROUNDED = (H-WK-OPER-DSH - .202)
844100                                 * .825 + .0588.
844200
844300***********************************************************
844400**7**   RURAL HOSPITALS SCH
844500***  NOT TO EXCEED 12%
844600
844700      IF W-CBSA-SIZE = 'R'
844800         IF (P-NEW-PROVIDER-TYPE = '16' OR '17' OR '21' OR '22')
844900                               AND H-WK-OPER-DSH > .1499
845000                               AND H-WK-OPER-DSH < .2020
845100         COMPUTE H-OPER-DSH ROUNDED = (H-WK-OPER-DSH - .15)
845200                                 * .65 + .025
845300        IF H-OPER-DSH > .1200
845400                 MOVE .1200 TO H-OPER-DSH.
845500
845600      IF W-CBSA-SIZE = 'R'
845700         IF (P-NEW-PROVIDER-TYPE = '16' OR '17' OR '21' OR '22')
845800                               AND H-WK-OPER-DSH > .2019
845900         COMPUTE H-OPER-DSH ROUNDED = (H-WK-OPER-DSH - .202)
846000                                 * .825 + .0588
846100        IF H-OPER-DSH > .1200
846200                 MOVE .1200 TO H-OPER-DSH.
846300
846400***********************************************************
846500**6**   RURAL HOSPITALS RRC   RULE 5 & 6 SAME
846600***  RRC OVERRIDES SCH CAP
846700***  NO CAP >> CAN EXCEED 12%
846800
846900         IF (P-NEW-PROVIDER-TYPE = '07' OR '14' OR '15' OR
847000                                   '17' OR '22')
847100                               AND H-WK-OPER-DSH > .1499
847200                               AND H-WK-OPER-DSH < .2020
847300         COMPUTE H-OPER-DSH ROUNDED = (H-WK-OPER-DSH - .15)
847400                                 * .65 + .025.
847500
847600         IF (P-NEW-PROVIDER-TYPE = '07' OR '14' OR '15' OR
847700                                   '17' OR '22')
847800                               AND H-WK-OPER-DSH > .2019
847900         COMPUTE H-OPER-DSH ROUNDED = (H-WK-OPER-DSH - .202)
848000                                 * .825 + .0588.
848100
848200      COMPUTE H-OPER-DSH ROUNDED = H-OPER-DSH * 1.0000.
848300
848400 3900A-EXIT.   EXIT.
848500
848600 4000-CALC-TECH-ADDON.
848700
848800***********************************************************
848900***  CALCULATE TOTALS FOR OPERATING  ADD ON FOR TECH
849000***  CALCULATE TOTALS FOR OPERATING  ADD ON FOR TECH
849100
849200     COMPUTE PPS-OPER-HSP-PART ROUNDED =
849300         H-OPER-HSP-PCT * H-OPER-HSP-PART.
849400
849500     COMPUTE PPS-OPER-FSP-PART ROUNDED =
849600         H-OPER-FSP-PCT * H-OPER-FSP-PART.
849700
849800     MOVE ZERO TO PPS-OPER-DSH-ADJ.
849900
850000     IF  H-OPER-DSH NUMERIC
850100             COMPUTE PPS-OPER-DSH-ADJ ROUNDED =
850200             (PPS-OPER-FSP-PART
850300              * H-OPER-DSH) * .25.
850400
850500     COMPUTE PPS-OPER-IME-ADJ ROUNDED =
850600             PPS-OPER-FSP-PART *
850700             H-OPER-IME-TEACH.
850800
850900     COMPUTE H-BASE-DRG-PAYMENT ROUNDED =
851000             PPS-OPER-HSP-PART + PPS-OPER-FSP-PART +
851100             PPS-OPER-DSH-ADJ + PPS-OPER-IME-ADJ +
851200             WK-UNCOMP-CARE-AMOUNT.
851300
851400***********************************************************
851500***********************************************************
851600* PUT NEW CHECK HERE IF H-NEW-TECH ZERO PERFORM
851700
851800     IF   B-DIAG-ISLET-DIAG1  OR
851900          B-DIAG-ISLET-DIAG2  OR
852000          B-DIAG-ISLET-DIAG3  OR
852100          B-DIAG-ISLET-DIAG4  OR
852200          B-DIAG-ISLET-DIAG5  OR
852300          B-DIAG-ISLET-DIAG6  OR
852400          B-DIAG-ISLET-DIAG7  OR
852500          B-DIAG-ISLET-DIAG8  OR
852600          B-DIAG-ISLET-DIAG9  OR
852700          B-DIAG-ISLET-DIAG10 OR
852800          B-DIAG-ISLET-DIAG11 OR
852900          B-DIAG-ISLET-DIAG12 OR
853000          B-DIAG-ISLET-DIAG13 OR
853100          B-DIAG-ISLET-DIAG14 OR
853200          B-DIAG-ISLET-DIAG15 OR
853300          B-DIAG-ISLET-DIAG16 OR
853400          B-DIAG-ISLET-DIAG17 OR
853500          B-DIAG-ISLET-DIAG18 OR
853600          B-DIAG-ISLET-DIAG19 OR
853700          B-DIAG-ISLET-DIAG20 OR
853800          B-DIAG-ISLET-DIAG21 OR
853900          B-DIAG-ISLET-DIAG22 OR
854000          B-DIAG-ISLET-DIAG23 OR
854100          B-DIAG-ISLET-DIAG24 OR
854200          B-DIAG-ISLET-DIAG25
854300       PERFORM 4100-ISLET-ISOLATION-ADD-ON THRU 4100-EXIT
854400     ELSE
854500       MOVE ZEROES TO H-NEW-TECH-ADDON-ISLET.
854600
854700*    IF   B-DIAG-AUTOLITT-DIAG AND
854800*         B-DRG-AUTOLITT-DRG
854900*       PERFORM 4500-AUTOLIT-TECH-ADD-ON THRU 4500-EXIT.
855000
855100     IF   B-NDC-DIFICID-NDC
855200       PERFORM 4600-DIFICID-TECH-ADD-ON THRU 4600-EXIT.
855300
855400     PERFORM 4700-ZENITH-TECH-ADD-ON THRU 4700-EXIT.
855500
855600     PERFORM 4800-VORAXAZE-TECH-ADD-ON THRU 4800-EXIT.
855700
855800     PERFORM 4810-ARGUS-TECH-ADD-ON THRU 4810-EXIT.
855900
856000     IF   B-DIAG-KCENTRA-DIAG1  OR
856100          B-DIAG-KCENTRA-DIAG2  OR
856200          B-DIAG-KCENTRA-DIAG3  OR
856300          B-DIAG-KCENTRA-DIAG4  OR
856400          B-DIAG-KCENTRA-DIAG5  OR
856500          B-DIAG-KCENTRA-DIAG6  OR
856600          B-DIAG-KCENTRA-DIAG7  OR
856700          B-DIAG-KCENTRA-DIAG8  OR
856800          B-DIAG-KCENTRA-DIAG9  OR
856900          B-DIAG-KCENTRA-DIAG10 OR
857000          B-DIAG-KCENTRA-DIAG11 OR
857100          B-DIAG-KCENTRA-DIAG12 OR
857200          B-DIAG-KCENTRA-DIAG13 OR
857300          B-DIAG-KCENTRA-DIAG14 OR
857400          B-DIAG-KCENTRA-DIAG15 OR
857500          B-DIAG-KCENTRA-DIAG16 OR
857600          B-DIAG-KCENTRA-DIAG17 OR
857700          B-DIAG-KCENTRA-DIAG18 OR
857800          B-DIAG-KCENTRA-DIAG19 OR
857900          B-DIAG-KCENTRA-DIAG20 OR
858000          B-DIAG-KCENTRA-DIAG21 OR
858100          B-DIAG-KCENTRA-DIAG22 OR
858200          B-DIAG-KCENTRA-DIAG23 OR
858300          B-DIAG-KCENTRA-DIAG24 OR
858400          B-DIAG-KCENTRA-DIAG25
858500       MOVE ZEROES TO H-NEW-TECH-ADDON-KCENTRA
858600     ELSE
858700       PERFORM 4820-KCENTRA-TECH-ADD-ON THRU 4820-EXIT.
858800
858900     PERFORM 4830-ZILVER-TECH-ADD-ON THRU 4830-EXIT.
859000
859100     PERFORM 5000-CAP-CALC-TECH-ADD-ON THRU 5000-EXIT.
859200
859300     COMPUTE H-OPER-BASE-DRG-PAY ROUNDED =
859400             H-OPER-FSP-PART +
859500             H-NEW-TECH-PAY-ADD-ON -
859600             H-NEW-TECH-ADDON-ISLET.
859700
859800*
859900 4000-EXIT.    EXIT.
860000***********************************************************
860100
860200 4100-ISLET-ISOLATION-ADD-ON.
860300***********************************************************
860400***  TECHNICAL TRANSPLANTATION OF CELLS
860500***
860600*** CODE 52.85 (ALLTRANSPLANTATION OF CELLS OF ISLETS OF
860700*** ISLETS OF LANGERHAUS) AND
860800*** V70.7 (EXAMINATION OF PARTICIPANT IN CLINICAL TRIAL).
860900*** V70.7 ONE OR MORE TIMES IN PROC-CODES AND 52.85 ONE OR MORE
861000*** TIMES IN ANY OTHER PROC-CODE
861100***********************************************************
861200*** IT WAS DECIDED ON 3/12/07 TO ONLY CHECK FOR 52.85 AND NOT
861300*** V70.7
861400***********************************************************
861500
861600     MOVE 0 TO H-TECH-ADDON-ISLET-CNTR
861700               H-TECH-ADDON-ISLET-CNTR2
861800               H-NEW-TECH-ADDON-ISLET.
861900
862000     IF '5285   ' =  B-PRIN-PROC-CODE     OR
862100                     B-OTHER-PROC-CODE1   OR
862200                     B-OTHER-PROC-CODE2   OR
862300                     B-OTHER-PROC-CODE3   OR
862400                     B-OTHER-PROC-CODE4   OR
862500                     B-OTHER-PROC-CODE5   OR
862600                     B-OTHER-PROC-CODE6   OR
862700                     B-OTHER-PROC-CODE7   OR
862800                     B-OTHER-PROC-CODE8   OR
862900                     B-OTHER-PROC-CODE9   OR
863000                     B-OTHER-PROC-CODE10  OR
863100                     B-OTHER-PROC-CODE11  OR
863200                     B-OTHER-PROC-CODE12  OR
863300                     B-OTHER-PROC-CODE13  OR
863400                     B-OTHER-PROC-CODE14  OR
863500                     B-OTHER-PROC-CODE15  OR
863600                     B-OTHER-PROC-CODE16  OR
863700                     B-OTHER-PROC-CODE17  OR
863800                     B-OTHER-PROC-CODE18  OR
863900                     B-OTHER-PROC-CODE19  OR
864000                     B-OTHER-PROC-CODE20  OR
864100                     B-OTHER-PROC-CODE21  OR
864200                     B-OTHER-PROC-CODE22  OR
864300                     B-OTHER-PROC-CODE23  OR
864400                     B-OTHER-PROC-CODE24
864500           NEXT SENTENCE
864600     ELSE
864700           MOVE ZEROES TO H-NEW-TECH-ADDON-ISLET
864800           GO TO 4100-ADD-TECH-CASES.
864900
865000     IF '5285   ' =  B-PRIN-PROC-CODE
865100      COMPUTE H-TECH-ADDON-ISLET-CNTR =
865200                       H-TECH-ADDON-ISLET-CNTR + 1.
865300
865400     IF '5285   ' =  B-OTHER-PROC-CODE1
865500      COMPUTE H-TECH-ADDON-ISLET-CNTR =
865600                       H-TECH-ADDON-ISLET-CNTR + 1.
865700
865800     IF '5285   ' =  B-OTHER-PROC-CODE2
865900      COMPUTE H-TECH-ADDON-ISLET-CNTR =
866000                       H-TECH-ADDON-ISLET-CNTR + 1.
866100
866200     IF '5285   ' =  B-OTHER-PROC-CODE3
866300      COMPUTE H-TECH-ADDON-ISLET-CNTR =
866400                       H-TECH-ADDON-ISLET-CNTR + 1.
866500
866600     IF '5285   ' =  B-OTHER-PROC-CODE4
866700      COMPUTE H-TECH-ADDON-ISLET-CNTR =
866800                       H-TECH-ADDON-ISLET-CNTR + 1.
866900
867000     IF '5285   ' =  B-OTHER-PROC-CODE5
867100      COMPUTE H-TECH-ADDON-ISLET-CNTR =
867200                       H-TECH-ADDON-ISLET-CNTR + 1.
867300
867400     IF '5285   ' =  B-OTHER-PROC-CODE6
867500      COMPUTE H-TECH-ADDON-ISLET-CNTR =
867600                       H-TECH-ADDON-ISLET-CNTR + 1.
867700
867800     IF '5285   ' =  B-OTHER-PROC-CODE7
867900      COMPUTE H-TECH-ADDON-ISLET-CNTR =
868000                       H-TECH-ADDON-ISLET-CNTR + 1.
868100
868200     IF '5285   ' =  B-OTHER-PROC-CODE8
868300      COMPUTE H-TECH-ADDON-ISLET-CNTR =
868400                       H-TECH-ADDON-ISLET-CNTR + 1.
868500
868600     IF '5285   ' =  B-OTHER-PROC-CODE9
868700      COMPUTE H-TECH-ADDON-ISLET-CNTR =
868800                       H-TECH-ADDON-ISLET-CNTR + 1.
868900
869000     IF '5285   ' =  B-OTHER-PROC-CODE10
869100      COMPUTE H-TECH-ADDON-ISLET-CNTR =
869200                       H-TECH-ADDON-ISLET-CNTR + 1.
869300
869400     IF '5285   ' =  B-OTHER-PROC-CODE11
869500      COMPUTE H-TECH-ADDON-ISLET-CNTR =
869600                       H-TECH-ADDON-ISLET-CNTR + 1.
869700
869800     IF '5285   ' =  B-OTHER-PROC-CODE12
869900      COMPUTE H-TECH-ADDON-ISLET-CNTR =
870000                       H-TECH-ADDON-ISLET-CNTR + 1.
870100
870200     IF '5285   ' =  B-OTHER-PROC-CODE13
870300      COMPUTE H-TECH-ADDON-ISLET-CNTR =
870400                       H-TECH-ADDON-ISLET-CNTR + 1.
870500
870600     IF '5285   ' =  B-OTHER-PROC-CODE14
870700      COMPUTE H-TECH-ADDON-ISLET-CNTR =
870800                       H-TECH-ADDON-ISLET-CNTR + 1.
870900
871000     IF '5285   ' =  B-OTHER-PROC-CODE15
871100      COMPUTE H-TECH-ADDON-ISLET-CNTR =
871200                       H-TECH-ADDON-ISLET-CNTR + 1.
871300
871400     IF '5285   ' =  B-OTHER-PROC-CODE16
871500      COMPUTE H-TECH-ADDON-ISLET-CNTR =
871600                       H-TECH-ADDON-ISLET-CNTR + 1.
871700
871800     IF '5285   ' =  B-OTHER-PROC-CODE17
871900      COMPUTE H-TECH-ADDON-ISLET-CNTR =
872000                       H-TECH-ADDON-ISLET-CNTR + 1.
872100
872200     IF '5285   ' =  B-OTHER-PROC-CODE18
872300      COMPUTE H-TECH-ADDON-ISLET-CNTR =
872400                       H-TECH-ADDON-ISLET-CNTR + 1.
872500
872600     IF '5285   ' =  B-OTHER-PROC-CODE19
872700      COMPUTE H-TECH-ADDON-ISLET-CNTR =
872800                       H-TECH-ADDON-ISLET-CNTR + 1.
872900
873000     IF '5285   ' =  B-OTHER-PROC-CODE20
873100      COMPUTE H-TECH-ADDON-ISLET-CNTR =
873200                       H-TECH-ADDON-ISLET-CNTR + 1.
873300
873400     IF '5285   ' =  B-OTHER-PROC-CODE21
873500      COMPUTE H-TECH-ADDON-ISLET-CNTR =
873600                       H-TECH-ADDON-ISLET-CNTR + 1.
873700
873800     IF '5285   ' =  B-OTHER-PROC-CODE22
873900      COMPUTE H-TECH-ADDON-ISLET-CNTR =
874000                       H-TECH-ADDON-ISLET-CNTR + 1.
874100
874200     IF '5285   ' =  B-OTHER-PROC-CODE23
874300      COMPUTE H-TECH-ADDON-ISLET-CNTR =
874400                       H-TECH-ADDON-ISLET-CNTR + 1.
874500
874600     IF '5285   ' =  B-OTHER-PROC-CODE24
874700      COMPUTE H-TECH-ADDON-ISLET-CNTR =
874800                       H-TECH-ADDON-ISLET-CNTR + 1.
874900
875000     IF  H-TECH-ADDON-ISLET-CNTR = 1
875100     MOVE 18848.00 TO H-NEW-TECH-ADDON-ISLET
875200           GO TO 4100-ADD-TECH-CASES.
875300
875400     IF  H-TECH-ADDON-ISLET-CNTR > 1
875500     MOVE 37696.00 TO H-NEW-TECH-ADDON-ISLET
875600           GO TO 4100-ADD-TECH-CASES.
875700
875800     MOVE 0 TO H-NEW-TECH-ADDON-ISLET.
875900
876000
876100 4100-ADD-TECH-CASES.
876200
876300     COMPUTE H-NEW-TECH-PAY-ADD-ON ROUNDED =
876400             H-NEW-TECH-PAY-ADD-ON +
876500             H-NEW-TECH-ADDON-ISLET.
876600
876700 4100-EXIT.    EXIT.
876800
876900***********************************************************
877000* THIS IS A SEARCH FOR LOW VOLUME PROVIDERS BASED ON THEIR
877100* DISCHARGE COUNTS.
877200***********************************************************
877300 4400-LOWVOL-CODE-RTN.
877400*
877500     SET LOWVOL-IDX TO 1.
877600     SEARCH LOWVOL-TAB VARYING LOWVOL-IDX
877700         AT END
877800           MOVE ' NO LOWVOL PROVIDER FOUND' TO MES-LOWVOL
877900           MOVE 1600 TO  MESWK-LOWVOL-PROV-DISCHG
878000       WHEN WK-LOWVOL-PROV (LOWVOL-IDX) = MES-PPS-PROV
878100         MOVE WK-LOWVOL-PROV-DISCHG(LOWVOL-IDX)
878200                            TO MESWK-LOWVOL-PROV-DISCHG.
878300
878400*          MOVE ' NO LOWVOL IN 2014       ' TO MES-LOWVOL.
878500*          MOVE 1600 TO  MESWK-LOWVOL-PROV-DISCHG.
878600
878700 4400-EXIT.   EXIT.
878800
878900***********************************************************
879000*
879100***********************************************************
879200* THIS IS A SEARCH FOR LOW VOLUME PROVIDERS BASED ON THEIR
879300* DISCHARGE COUNTS.
879400***********************************************************
879500 4410-UNCOMP-CARE-CODE-RTN.
879600
879700     MOVE P-NEW-PROVIDER-NO  TO MES-PPS-PROV.
879800
879900     SET UNCOMP-CARE-IDX TO 1.
880000     SEARCH UNCOMP-CARE-TAB VARYING UNCOMP-CARE-IDX
880100         AT END
880200           MOVE 0 TO  WK-UNCOMP-CARE-AMOUNT
880300       WHEN TB-UNCOMP-CARE-PROV (UNCOMP-CARE-IDX) = MES-PPS-PROV
880400         MOVE TB-UNCOMP-CARE-AMOUNT (UNCOMP-CARE-IDX)
880500                            TO WK-UNCOMP-CARE-AMOUNT.
880600
880700        COMPUTE H-UNCOMP-CARE-AMOUNT = WK-UNCOMP-CARE-AMOUNT.
880800
880900 4410-EXIT.   EXIT.
881000
881100***********************************************************
881200
881300 4500-AUTOLIT-TECH-ADD-ON.
881400***********************************************************
881500***** CASES INVOLVING AUTOLITT PROCESS DECOMPRESSION SYSTEM
881600***********************************************************
881700
881800     MOVE 0 TO H-NEW-TECH-ADDON-AUTOLITT
881900               H-LESSER-AUTOLITT-STOP-1
882000               H-LESSER-AUTOLITT-STOP-2
882100               H-CSTMED-AUTOLITT-STOP.
882200
882300
882400
882500     IF '1761   ' =  B-PRIN-PROC-CODE     OR
882600                     B-OTHER-PROC-CODE1   OR
882700                     B-OTHER-PROC-CODE2   OR
882800                     B-OTHER-PROC-CODE3   OR
882900                     B-OTHER-PROC-CODE4   OR
883000                     B-OTHER-PROC-CODE5   OR
883100                     B-OTHER-PROC-CODE6   OR
883200                     B-OTHER-PROC-CODE7   OR
883300                     B-OTHER-PROC-CODE8   OR
883400                     B-OTHER-PROC-CODE9   OR
883500                     B-OTHER-PROC-CODE10  OR
883600                     B-OTHER-PROC-CODE11  OR
883700                     B-OTHER-PROC-CODE12  OR
883800                     B-OTHER-PROC-CODE13  OR
883900                     B-OTHER-PROC-CODE14  OR
884000                     B-OTHER-PROC-CODE15  OR
884100                     B-OTHER-PROC-CODE16  OR
884200                     B-OTHER-PROC-CODE17  OR
884300                     B-OTHER-PROC-CODE18  OR
884400                     B-OTHER-PROC-CODE19  OR
884500                     B-OTHER-PROC-CODE20  OR
884600                     B-OTHER-PROC-CODE21  OR
884700                     B-OTHER-PROC-CODE22  OR
884800                     B-OTHER-PROC-CODE23  OR
884900                     B-OTHER-PROC-CODE24
885000           GO TO 4500-COMPUTE-AUTOLITT
885100     ELSE
885200           NEXT SENTENCE.
885300
885400           MOVE ZEROES TO H-NEW-TECH-ADDON-AUTOLITT-STOP.
885500           GO TO 4500-ADD-TECH-CASES.
885600
885700 4500-COMPUTE-AUTOLITT.
885800
885900     MOVE  5300.00 TO H-CSTMED-AUTOLITT-STOP.
886000
886100     COMPUTE H-LESSER-AUTOLITT-STOP-1 ROUNDED =
886200                  H-CSTMED-AUTOLITT-STOP.
886300
886400     COMPUTE H-LESSER-AUTOLITT-STOP-2 ROUNDED =
886500          (((B-CHARGES-CLAIMED * P-NEW-OPER-CSTCHG-RATIO) -
886600                     H-BASE-DRG-PAYMENT)) * .5.
886700
886800     IF H-LESSER-AUTOLITT-STOP-2 > 0
886900        IF H-LESSER-AUTOLITT-STOP-1 < H-LESSER-AUTOLITT-STOP-2
887000         MOVE H-LESSER-AUTOLITT-STOP-1 TO
887100                                H-NEW-TECH-ADDON-AUTOLITT-STOP
887200        ELSE
887300         MOVE H-LESSER-AUTOLITT-STOP-2 TO
887400                                H-NEW-TECH-ADDON-AUTOLITT-STOP
887500     ELSE
887600        MOVE ZEROES          TO H-NEW-TECH-ADDON-AUTOLITT-STOP.
887700
887800
887900 4500-ADD-TECH-CASES.
888000
888100     COMPUTE H-NEW-TECH-PAY-ADD-ON ROUNDED =
888200             H-NEW-TECH-PAY-ADD-ON +
888300             H-NEW-TECH-ADDON-AUTOLITT-STOP.
888400*
888500 4500-EXIT.    EXIT.
888600
888700
888800 4600-DIFICID-TECH-ADD-ON.
888900***********************************************************
889000***** CASES INVOLVING DIFICID PROCESS DECOMPRESSION SYSTEM
889100***********************************************************
889200***** PER HPAR 8041H TEST WAS CHANGED FR 0845 TO 00845
889300***********************************************************
889400
889500
889600     MOVE 0 TO H-NEW-TECH-ADDON-DIFICID
889700               H-LESSER-DIFICID-STOP-1
889800               H-LESSER-DIFICID-STOP-2
889900               H-CSTMED-DIFICID-STOP.
890000
890100     IF '00845  ' =  B-OTHER-DIAG-CODE1   OR
890200                     B-OTHER-DIAG-CODE2   OR
890300                     B-OTHER-DIAG-CODE3   OR
890400                     B-OTHER-DIAG-CODE4   OR
890500                     B-OTHER-DIAG-CODE5   OR
890600                     B-OTHER-DIAG-CODE6   OR
890700                     B-OTHER-DIAG-CODE7   OR
890800                     B-OTHER-DIAG-CODE8   OR
890900                     B-OTHER-DIAG-CODE9   OR
891000                     B-OTHER-DIAG-CODE10  OR
891100                     B-OTHER-DIAG-CODE11  OR
891200                     B-OTHER-DIAG-CODE12  OR
891300                     B-OTHER-DIAG-CODE13  OR
891400                     B-OTHER-DIAG-CODE14  OR
891500                     B-OTHER-DIAG-CODE15  OR
891600                     B-OTHER-DIAG-CODE16  OR
891700                     B-OTHER-DIAG-CODE17  OR
891800                     B-OTHER-DIAG-CODE18  OR
891900                     B-OTHER-DIAG-CODE19  OR
892000                     B-OTHER-DIAG-CODE20  OR
892100                     B-OTHER-DIAG-CODE21  OR
892200                     B-OTHER-DIAG-CODE22  OR
892300                     B-OTHER-DIAG-CODE23  OR
892400                     B-OTHER-DIAG-CODE24  OR
892500                     B-OTHER-DIAG-CODE25
892600           GO TO 4600-COMPUTE-DIFICID
892700     ELSE
892800           NEXT SENTENCE.
892900
893000           MOVE ZEROES TO H-NEW-TECH-ADDON-DIFICID.
893100           GO TO 4600-ADD-TECH-CASES.
893200
893300 4600-COMPUTE-DIFICID.
893400
893500     MOVE  868.00 TO H-CSTMED-DIFICID-STOP.
893600
893700     COMPUTE H-LESSER-DIFICID-STOP-1 ROUNDED =
893800                  H-CSTMED-DIFICID-STOP.
893900
894000     COMPUTE H-LESSER-DIFICID-STOP-2 ROUNDED =
894100          (((B-CHARGES-CLAIMED * P-NEW-OPER-CSTCHG-RATIO) -
894200                     H-BASE-DRG-PAYMENT)) * .5.
894300
894400     IF H-LESSER-DIFICID-STOP-2 > 0
894500        IF H-LESSER-DIFICID-STOP-1 < H-LESSER-DIFICID-STOP-2
894600         MOVE H-LESSER-DIFICID-STOP-1 TO
894700                                H-NEW-TECH-ADDON-DIFICID
894800        ELSE
894900         MOVE H-LESSER-DIFICID-STOP-2 TO
895000                                H-NEW-TECH-ADDON-DIFICID
895100     ELSE
895200        MOVE ZEROES          TO H-NEW-TECH-ADDON-DIFICID.
895300
895400
895500
895600 4600-ADD-TECH-CASES.
895700
895800     COMPUTE H-NEW-TECH-PAY-ADD-ON ROUNDED =
895900             H-NEW-TECH-PAY-ADD-ON +
896000             H-NEW-TECH-ADDON-DIFICID.
896100*
896200 4600-EXIT.    EXIT.
896300
896400 4700-ZENITH-TECH-ADD-ON.
896500***********************************************************
896600***** CASES INVOLVING ZENITH PROCESS DECOMPRESSION SYSTEM
896700***********************************************************
896800
896900     MOVE 0 TO H-NEW-TECH-ADDON-ZENITH
897000               H-LESSER-ZENITH-STOP-1
897100               H-LESSER-ZENITH-STOP-2
897200               H-CSTMED-ZENITH-STOP.
897300
897400
897500
897600     IF '3978   ' =  B-PRIN-PROC-CODE     OR
897700                     B-OTHER-PROC-CODE1   OR
897800                     B-OTHER-PROC-CODE2   OR
897900                     B-OTHER-PROC-CODE3   OR
898000                     B-OTHER-PROC-CODE4   OR
898100                     B-OTHER-PROC-CODE5   OR
898200                     B-OTHER-PROC-CODE6   OR
898300                     B-OTHER-PROC-CODE7   OR
898400                     B-OTHER-PROC-CODE8   OR
898500                     B-OTHER-PROC-CODE9   OR
898600                     B-OTHER-PROC-CODE10  OR
898700                     B-OTHER-PROC-CODE11  OR
898800                     B-OTHER-PROC-CODE12  OR
898900                     B-OTHER-PROC-CODE13  OR
899000                     B-OTHER-PROC-CODE14  OR
899100                     B-OTHER-PROC-CODE15  OR
899200                     B-OTHER-PROC-CODE16  OR
899300                     B-OTHER-PROC-CODE17  OR
899400                     B-OTHER-PROC-CODE18  OR
899500                     B-OTHER-PROC-CODE19  OR
899600                     B-OTHER-PROC-CODE20  OR
899700                     B-OTHER-PROC-CODE21  OR
899800                     B-OTHER-PROC-CODE22  OR
899900                     B-OTHER-PROC-CODE23  OR
900000                     B-OTHER-PROC-CODE24
900100           GO TO 4700-COMPUTE-ZENITH
900200     ELSE
900300           NEXT SENTENCE.
900400
900500           MOVE ZEROES TO H-NEW-TECH-ADDON-ZENITH.
900600           GO TO 4700-ADD-TECH-CASES.
900700
900800 4700-COMPUTE-ZENITH.
900900
901000     MOVE  8171.50 TO H-CSTMED-ZENITH-STOP.
901100
901200     COMPUTE H-LESSER-ZENITH-STOP-1 ROUNDED =
901300                  H-CSTMED-ZENITH-STOP.
901400
901500     COMPUTE H-LESSER-ZENITH-STOP-2 ROUNDED =
901600          (((B-CHARGES-CLAIMED * P-NEW-OPER-CSTCHG-RATIO) -
901700                     H-BASE-DRG-PAYMENT)) * .5.
901800
901900     IF H-LESSER-ZENITH-STOP-2 > 0
902000        IF H-LESSER-ZENITH-STOP-1 < H-LESSER-ZENITH-STOP-2
902100         MOVE H-LESSER-ZENITH-STOP-1 TO
902200                                H-NEW-TECH-ADDON-ZENITH
902300        ELSE
902400         MOVE H-LESSER-ZENITH-STOP-2 TO
902500                                H-NEW-TECH-ADDON-ZENITH
902600     ELSE
902700        MOVE ZEROES          TO H-NEW-TECH-ADDON-ZENITH.
902800
902900
903000 4700-ADD-TECH-CASES.
903100
903200     COMPUTE H-NEW-TECH-PAY-ADD-ON ROUNDED =
903300             H-NEW-TECH-PAY-ADD-ON +
903400             H-NEW-TECH-ADDON-ZENITH.
903500*
903600 4700-EXIT.    EXIT.
903700
903800***********************************************************
903900 4800-VORAXAZE-TECH-ADD-ON.
904000***********************************************************
904100***** CASES INVOLVING VORAXAZE PROCESS DECOMPRESSION SYSTEM
904200***********************************************************
904300
904400     MOVE 0 TO H-NEW-TECH-ADDON-VORAXAZE
904500               H-LESSER-VORAXAZE-STOP-1
904600               H-LESSER-VORAXAZE-STOP-2
904700               H-CSTMED-VORAXAZE-STOP.
904800
904900
905000
905100     IF '0095   ' =  B-PRIN-PROC-CODE     OR
905200                     B-OTHER-PROC-CODE1   OR
905300                     B-OTHER-PROC-CODE2   OR
905400                     B-OTHER-PROC-CODE3   OR
905500                     B-OTHER-PROC-CODE4   OR
905600                     B-OTHER-PROC-CODE5   OR
905700                     B-OTHER-PROC-CODE6   OR
905800                     B-OTHER-PROC-CODE7   OR
905900                     B-OTHER-PROC-CODE8   OR
906000                     B-OTHER-PROC-CODE9   OR
906100                     B-OTHER-PROC-CODE10  OR
906200                     B-OTHER-PROC-CODE11  OR
906300                     B-OTHER-PROC-CODE12  OR
906400                     B-OTHER-PROC-CODE13  OR
906500                     B-OTHER-PROC-CODE14  OR
906600                     B-OTHER-PROC-CODE15  OR
906700                     B-OTHER-PROC-CODE16  OR
906800                     B-OTHER-PROC-CODE17  OR
906900                     B-OTHER-PROC-CODE18  OR
907000                     B-OTHER-PROC-CODE19  OR
907100                     B-OTHER-PROC-CODE20  OR
907200                     B-OTHER-PROC-CODE21  OR
907300                     B-OTHER-PROC-CODE22  OR
907400                     B-OTHER-PROC-CODE23  OR
907500                     B-OTHER-PROC-CODE24
907600           GO TO 4800-COMPUTE-VORAXAZE
907700     ELSE
907800           NEXT SENTENCE.
907900
908000           MOVE ZEROES TO H-NEW-TECH-ADDON-VORAXAZE.
908100           GO TO 4800-ADD-TECH-CASES.
908200
908300 4800-COMPUTE-VORAXAZE.
908400
908500     MOVE  45000.00 TO H-CSTMED-VORAXAZE-STOP.
908600
908700     COMPUTE H-LESSER-VORAXAZE-STOP-1 ROUNDED =
908800                  H-CSTMED-VORAXAZE-STOP.
908900
909000     COMPUTE H-LESSER-VORAXAZE-STOP-2 ROUNDED =
909100          (((B-CHARGES-CLAIMED * P-NEW-OPER-CSTCHG-RATIO) -
909200                     H-BASE-DRG-PAYMENT)) * .5.
909300
909400     IF H-LESSER-VORAXAZE-STOP-2 > 0
909500        IF H-LESSER-VORAXAZE-STOP-1 < H-LESSER-VORAXAZE-STOP-2
909600         MOVE H-LESSER-VORAXAZE-STOP-1 TO
909700                                H-NEW-TECH-ADDON-VORAXAZE
909800        ELSE
909900         MOVE H-LESSER-VORAXAZE-STOP-2 TO
910000                                H-NEW-TECH-ADDON-VORAXAZE
910100     ELSE
910200        MOVE ZEROES          TO H-NEW-TECH-ADDON-VORAXAZE.
910300
910400
910500 4800-ADD-TECH-CASES.
910600
910700     COMPUTE H-NEW-TECH-PAY-ADD-ON ROUNDED =
910800             H-NEW-TECH-PAY-ADD-ON +
910900             H-NEW-TECH-ADDON-VORAXAZE.
911000*
911100 4800-EXIT.    EXIT.
911200
911300***********************************************************
911400 4810-ARGUS-TECH-ADD-ON.
911500***********************************************************
911600***** CASES INVOLVING VORAXAZE PROCESS DECOMPRESSION SYSTEM
911700***********************************************************
911800
911900     MOVE 0 TO H-NEW-TECH-ADDON-ARGUS
912000               H-LESSER-ARGUS-STOP-1
912100               H-LESSER-ARGUS-STOP-2
912200               H-CSTMED-ARGUS-STOP.
912300
912400
912500
912600     IF '1481   ' =  B-PRIN-PROC-CODE     OR
912700                     B-OTHER-PROC-CODE1   OR
912800                     B-OTHER-PROC-CODE2   OR
912900                     B-OTHER-PROC-CODE3   OR
913000                     B-OTHER-PROC-CODE4   OR
913100                     B-OTHER-PROC-CODE5   OR
913200                     B-OTHER-PROC-CODE6   OR
913300                     B-OTHER-PROC-CODE7   OR
913400                     B-OTHER-PROC-CODE8   OR
913500                     B-OTHER-PROC-CODE9   OR
913600                     B-OTHER-PROC-CODE10  OR
913700                     B-OTHER-PROC-CODE11  OR
913800                     B-OTHER-PROC-CODE12  OR
913900                     B-OTHER-PROC-CODE13  OR
914000                     B-OTHER-PROC-CODE14  OR
914100                     B-OTHER-PROC-CODE15  OR
914200                     B-OTHER-PROC-CODE16  OR
914300                     B-OTHER-PROC-CODE17  OR
914400                     B-OTHER-PROC-CODE18  OR
914500                     B-OTHER-PROC-CODE19  OR
914600                     B-OTHER-PROC-CODE20  OR
914700                     B-OTHER-PROC-CODE21  OR
914800                     B-OTHER-PROC-CODE22  OR
914900                     B-OTHER-PROC-CODE23  OR
915000                     B-OTHER-PROC-CODE24
915100           GO TO 4810-COMPUTE-ARGUS
915200     ELSE
915300           NEXT SENTENCE.
915400
915500           MOVE ZEROES TO H-NEW-TECH-ADDON-ARGUS.
915600           GO TO 4810-ADD-TECH-CASES.
915700
915800 4810-COMPUTE-ARGUS.
915900
916000     MOVE  72028.75 TO H-CSTMED-ARGUS-STOP.
916100
916200     COMPUTE H-LESSER-ARGUS-STOP-1 ROUNDED =
916300                  H-CSTMED-ARGUS-STOP.
916400
916500     COMPUTE H-LESSER-ARGUS-STOP-2 ROUNDED =
916600          (((B-CHARGES-CLAIMED * P-NEW-OPER-CSTCHG-RATIO) -
916700                     H-BASE-DRG-PAYMENT)) * .5.
916800
916900     IF H-LESSER-ARGUS-STOP-2 > 0
917000        IF H-LESSER-ARGUS-STOP-1 < H-LESSER-ARGUS-STOP-2
917100         MOVE H-LESSER-ARGUS-STOP-1 TO
917200                                H-NEW-TECH-ADDON-ARGUS
917300        ELSE
917400         MOVE H-LESSER-ARGUS-STOP-2 TO
917500                                H-NEW-TECH-ADDON-ARGUS
917600     ELSE
917700        MOVE ZEROES          TO H-NEW-TECH-ADDON-ARGUS.
917800
917900
918000 4810-ADD-TECH-CASES.
918100
918200     COMPUTE H-NEW-TECH-PAY-ADD-ON ROUNDED =
918300             H-NEW-TECH-PAY-ADD-ON +
918400             H-NEW-TECH-ADDON-ARGUS.
918500*
918600 4810-EXIT.    EXIT.
918700
918800
918900***********************************************************
919000 4820-KCENTRA-TECH-ADD-ON.
919100***********************************************************
919200***** CASES INVOLVING VORAXAZE PROCESS DECOMPRESSION SYSTEM
919300***********************************************************
919400
919500     MOVE 0 TO H-NEW-TECH-ADDON-KCENTRA
919600               H-LESSER-KCENTRA-STOP-1
919700               H-LESSER-KCENTRA-STOP-2
919800               H-CSTMED-KCENTRA-STOP.
919900
920000
920100
920200     IF '0096   ' =  B-PRIN-PROC-CODE     OR
920300                     B-OTHER-PROC-CODE1   OR
920400                     B-OTHER-PROC-CODE2   OR
920500                     B-OTHER-PROC-CODE3   OR
920600                     B-OTHER-PROC-CODE4   OR
920700                     B-OTHER-PROC-CODE5   OR
920800                     B-OTHER-PROC-CODE6   OR
920900                     B-OTHER-PROC-CODE7   OR
921000                     B-OTHER-PROC-CODE8   OR
921100                     B-OTHER-PROC-CODE9   OR
921200                     B-OTHER-PROC-CODE10  OR
921300                     B-OTHER-PROC-CODE11  OR
921400                     B-OTHER-PROC-CODE12  OR
921500                     B-OTHER-PROC-CODE13  OR
921600                     B-OTHER-PROC-CODE14  OR
921700                     B-OTHER-PROC-CODE15  OR
921800                     B-OTHER-PROC-CODE16  OR
921900                     B-OTHER-PROC-CODE17  OR
922000                     B-OTHER-PROC-CODE18  OR
922100                     B-OTHER-PROC-CODE19  OR
922200                     B-OTHER-PROC-CODE20  OR
922300                     B-OTHER-PROC-CODE21  OR
922400                     B-OTHER-PROC-CODE22  OR
922500                     B-OTHER-PROC-CODE23  OR
922600                     B-OTHER-PROC-CODE24
922700           GO TO 4820-COMPUTE-KCENTRA
922800     ELSE
922900           NEXT SENTENCE.
923000
923100           MOVE ZEROES TO H-NEW-TECH-ADDON-KCENTRA.
923200           GO TO 4820-ADD-TECH-CASES.
923300
923400 4820-COMPUTE-KCENTRA.
923500
923600     MOVE  01587.50 TO H-CSTMED-KCENTRA-STOP.
923700
923800     COMPUTE H-LESSER-KCENTRA-STOP-1 ROUNDED =
923900                  H-CSTMED-KCENTRA-STOP.
924000
924100     COMPUTE H-LESSER-KCENTRA-STOP-2 ROUNDED =
924200          (((B-CHARGES-CLAIMED * P-NEW-OPER-CSTCHG-RATIO) -
924300                     H-BASE-DRG-PAYMENT)) * .5.
924400
924500     IF H-LESSER-KCENTRA-STOP-2 > 0
924600        IF H-LESSER-KCENTRA-STOP-1 < H-LESSER-KCENTRA-STOP-2
924700         MOVE H-LESSER-KCENTRA-STOP-1 TO
924800                                H-NEW-TECH-ADDON-KCENTRA
924900        ELSE
925000         MOVE H-LESSER-KCENTRA-STOP-2 TO
925100                                H-NEW-TECH-ADDON-KCENTRA
925200     ELSE
925300        MOVE ZEROES          TO H-NEW-TECH-ADDON-KCENTRA.
925400
925500
925600 4820-ADD-TECH-CASES.
925700
925800     COMPUTE H-NEW-TECH-PAY-ADD-ON ROUNDED =
925900             H-NEW-TECH-PAY-ADD-ON +
926000             H-NEW-TECH-ADDON-KCENTRA.
926100*
926200 4820-EXIT.    EXIT.
926300
926400
926500***********************************************************
926600 4830-ZILVER-TECH-ADD-ON.
926700***********************************************************
926800***** CASES INVOLVING VORAXAZE PROCESS DECOMPRESSION SYSTEM
926900***********************************************************
927000
927100     MOVE 0 TO H-NEW-TECH-ADDON-ZILVER
927200               H-LESSER-ZILVER-STOP-1
927300               H-LESSER-ZILVER-STOP-2
927400               H-CSTMED-ZILVER-STOP.
927500
927600
927700
927800     IF '0060   ' =  B-PRIN-PROC-CODE     OR
927900                     B-OTHER-PROC-CODE1   OR
928000                     B-OTHER-PROC-CODE2   OR
928100                     B-OTHER-PROC-CODE3   OR
928200                     B-OTHER-PROC-CODE4   OR
928300                     B-OTHER-PROC-CODE5   OR
928400                     B-OTHER-PROC-CODE6   OR
928500                     B-OTHER-PROC-CODE7   OR
928600                     B-OTHER-PROC-CODE8   OR
928700                     B-OTHER-PROC-CODE9   OR
928800                     B-OTHER-PROC-CODE10  OR
928900                     B-OTHER-PROC-CODE11  OR
929000                     B-OTHER-PROC-CODE12  OR
929100                     B-OTHER-PROC-CODE13  OR
929200                     B-OTHER-PROC-CODE14  OR
929300                     B-OTHER-PROC-CODE15  OR
929400                     B-OTHER-PROC-CODE16  OR
929500                     B-OTHER-PROC-CODE17  OR
929600                     B-OTHER-PROC-CODE18  OR
929700                     B-OTHER-PROC-CODE19  OR
929800                     B-OTHER-PROC-CODE20  OR
929900                     B-OTHER-PROC-CODE21  OR
930000                     B-OTHER-PROC-CODE22  OR
930100                     B-OTHER-PROC-CODE23  OR
930200                     B-OTHER-PROC-CODE24
930300           GO TO 4830-COMPUTE-ZILVER
930400     ELSE
930500           NEXT SENTENCE.
930600
930700           MOVE ZEROES TO H-NEW-TECH-ADDON-ZILVER.
930800           GO TO 4830-ADD-TECH-CASES.
930900
931000 4830-COMPUTE-ZILVER.
931100
931200     MOVE  01705.25 TO H-CSTMED-ZILVER-STOP.
931300
931400     COMPUTE H-LESSER-ZILVER-STOP-1 ROUNDED =
931500                  H-CSTMED-ZILVER-STOP.
931600
931700     COMPUTE H-LESSER-ZILVER-STOP-2 ROUNDED =
931800          (((B-CHARGES-CLAIMED * P-NEW-OPER-CSTCHG-RATIO) -
931900                     H-BASE-DRG-PAYMENT)) * .5.
932000
932100     IF H-LESSER-ZILVER-STOP-2 > 0
932200        IF H-LESSER-ZILVER-STOP-1 < H-LESSER-ZILVER-STOP-2
932300         MOVE H-LESSER-ZILVER-STOP-1 TO
932400                                H-NEW-TECH-ADDON-ZILVER
932500        ELSE
932600         MOVE H-LESSER-ZILVER-STOP-2 TO
932700                                H-NEW-TECH-ADDON-ZILVER
932800     ELSE
932900        MOVE ZEROES          TO H-NEW-TECH-ADDON-ZILVER.
933000
933100
933200 4830-ADD-TECH-CASES.
933300
933400     COMPUTE H-NEW-TECH-PAY-ADD-ON ROUNDED =
933500             H-NEW-TECH-PAY-ADD-ON +
933600             H-NEW-TECH-ADDON-ZILVER.
933700*
933800 4830-EXIT.    EXIT.
933900
934000
934100***********************************************************
934200 5000-CAP-CALC-TECH-ADD-ON.
934300***********************************************************
934400***** CASES INVOLVING TECH-CAP-CALC PROCESS DECOMPRESSION SYSTEM
934500***********************************************************
934600
934700     MOVE 0 TO H-NEW-TECH-ADDON-CAP.
934800     MOVE 0 TO H-NEW-TECH-ADDON-CAPDIF.
934900
935000     COMPUTE H-OPER-BILL-COSTS ROUNDED =
935100         B-CHARGES-CLAIMED * H-OPER-CSTCHG-RATIO
935200         ON SIZE ERROR MOVE 0 TO H-OPER-BILL-COSTS.
935300
935400     COMPUTE H-NEW-TECH-ADDON-CAP ROUNDED =
935500                 (H-BASE-DRG-PAYMENT + H-NEW-TECH-PAY-ADD-ON).
935600
935700     COMPUTE H-NEW-TECH-ADDON-CAPDIF ROUNDED =
935800                 (H-OPER-BILL-COSTS - H-BASE-DRG-PAYMENT).
935900
936000     IF (H-NEW-TECH-ADDON-CAP > H-OPER-BILL-COSTS) AND
936100         H-NEW-TECH-ADDON-CAPDIF  > 0
936200        COMPUTE H-NEW-TECH-PAY-ADD-ON  ROUNDED =
936300             (H-OPER-BILL-COSTS - H-BASE-DRG-PAYMENT).
936400
936500*
936600 5000-EXIT.    EXIT.
936700
936800***********************************************************
936900 6000-CALC-READMIS-REDU.
937000***********************************************************
937100***** CASES INVOLVING READMISN PROCESS ADJUSTMENTS
937200**    FOR FY 2014 THE LOWEST FACTOR CAN BE 0.98 **********
937300***********************************************************
937400
937500     MOVE 0 TO H-READMIS-ADJUST-AMT.
937600
937700     IF P-HOSP-READMISSION-REDU = '1'
937800           GO TO 6000-EDIT-READMISN
937900     ELSE
938000           NEXT SENTENCE.
938100
938200     IF P-HOSP-READMISSION-REDU = '0' AND
938300        P-HOSP-HRR-ADJUSTMT = 0.0000
938400           MOVE ZEROES TO H-READMIS-ADJUST-AMT
938500           GO TO 6000-EXIT.
938600
938700     IF P-HOSP-READMISSION-REDU = '0' AND
938800        P-HOSP-HRR-ADJUSTMT > 0.0000
938900           MOVE 65 TO PPS-RTC
939000           MOVE ZEROES TO H-READMIS-ADJUST-AMT
939100           GO TO 6000-EXIT.
939200
939300
939400     IF P-HOSP-READMISSION-REDU = '2' OR '3' OR '4' OR '5' OR
939500                                  '6' OR '7' OR '8' OR
939600                                  '9' OR ' '
939700           MOVE 65 TO PPS-RTC
939800           MOVE ZEROES TO H-READMIS-ADJUST-AMT
939900           GO TO 6000-EXIT.
940000
940100 6000-EDIT-READMISN.
940200
940300     IF P-HOSP-HRR-ADJUSTMT < 0.9800
940400           MOVE 65 TO PPS-RTC
940500           MOVE ZEROES TO H-READMIS-ADJUST-AMT
940600           GO TO 6000-EXIT.
940700
940800
940900     IF P-HOSP-HRR-ADJUSTMT > 1.0000
941000           MOVE 65 TO PPS-RTC
941100           MOVE ZEROES TO H-READMIS-ADJUST-AMT
941200           GO TO 6000-EXIT.
941300
941400     IF P-READ-INVALID-STATE
941500           MOVE 65 TO PPS-RTC
941600           MOVE ZEROES TO H-READMIS-ADJUST-AMT
941700           GO TO 6000-EXIT.
941800
941900
942000 6000-COMPUTE-READMISN.
942100
942200
942300        COMPUTE H-READMIS-ADJUST-AMT         ROUNDED =
942400              ((P-HOSP-HRR-ADJUSTMT * H-OPER-BASE-DRG-PAY) -
942500                H-OPER-BASE-DRG-PAY).
942600
942700
942800 6000-EXIT.    EXIT.
942900
943000***********************************************************
943100 7000-CALC-VALUE-BASED-PURCH.
943200***********************************************************
943300***** CASES INVOLVING VALUE BASE PURCH ADJUSTMENTS
943400**    FOR FY 2014 THE LOWEST FACTOR CAN BE 0.9875  *******
943500***********************************************************
943600
943700     MOVE 0 TO H-VAL-BASED-PURCH-ADJUST-AMT.
943800
943900     IF  P-VAL-BASED-PURCH-PARTIPNT = 'N' OR 'Y'
944000           NEXT SENTENCE
944100     ELSE
944200           MOVE 68 TO PPS-RTC
944300           GO TO 7000-EXIT.
944400
944500     IF  P-VAL-BASED-PURCH-PARTIPNT = 'N'
944600           GO TO 7000-EXIT.
944700
944800     IF  P-VAL-BASED-PURCH-PARTIPNT = 'Y' AND
944900         P-NEW-CBSA-HOSP-QUAL-IND = '1'
945000           NEXT SENTENCE
945100     ELSE
945200           MOVE 68 TO PPS-RTC
945300           GO TO 7000-EXIT.
945400
945500     IF  P-VBP-INVALID-STATE
945600           MOVE 68 TO PPS-RTC
945700           GO TO 7000-EXIT
945800     ELSE
945900           NEXT SENTENCE.
946000
946100     IF P-VAL-BASED-PURCH-ADJUST > 0.9875000000 AND
946200        P-VAL-BASED-PURCH-ADJUST < 2.0000000000
946300           GO TO 7000-COMPUTE-VAL-BASED-PUR
946400     ELSE
946500           MOVE 68 TO PPS-RTC
946600           MOVE ZEROES TO H-VAL-BASED-PURCH-ADJUST-AMT.
946700           GO TO 7000-EXIT.
946800
946900 7000-COMPUTE-VAL-BASED-PUR.
947000
947100     COMPUTE H-VAL-BASED-PURCH-ADJUST-AMT  ROUNDED =
947200              ((P-VAL-BASED-PURCH-ADJUST *
947300                  H-OPER-BASE-DRG-PAY) -
947400                  H-OPER-BASE-DRG-PAY).
947500*
947600 7000-EXIT.    EXIT.
947700
947800***********************************************************
947900 8000-CALC-BUNDLE-REDU.
948000***********************************************************
948100***** CASES INVOLVING BUNDLE PROCESS ADJUSTMENTS
948200***********************************************************
948300
948400     MOVE 0 TO H-BUNDLE-ADJUST-AMT.
948500     MOVE 0 TO WK-MODEL1-BUNDLE-DISPRCNT.
948600
948700     IF '61' =  B-DEMO-CODE1  OR
948800                B-DEMO-CODE2  OR
948900                B-DEMO-CODE3  OR
949000                B-DEMO-CODE4
949100         NEXT SENTENCE
949200     ELSE
949300         MOVE ZEROES TO H-BUNDLE-ADJUST-AMT
949400           GO TO 8000-EXIT.
949500
949600     IF P-MODEL1-BUNDLE-DISPRCNT > .00
949700           GO TO 8000-COMPUTE-BUNDLE
949800     ELSE
949900           NEXT SENTENCE.
950000
950100     MOVE ZEROES TO H-BUNDLE-ADJUST-AMT
950200           GO TO 8000-EXIT.
950300
950400 8000-COMPUTE-BUNDLE.
950500
950600     IF  B-DISCHARGE-DATE < 20140401 AND
950700         P-MODEL1-BUNDLE-DISPRCNT = .01
950800         COMPUTE WK-MODEL1-BUNDLE-DISPRCNT =
950900          (1 - (P-MODEL1-BUNDLE-DISPRCNT * .5))
951000     ELSE
951100         COMPUTE WK-MODEL1-BUNDLE-DISPRCNT =
951200          (1 - (P-MODEL1-BUNDLE-DISPRCNT * 1)).
951300
951400        COMPUTE H-BUNDLE-ADJUST-AMT      ROUNDED =
951500              ((WK-MODEL1-BUNDLE-DISPRCNT *
951600                                     H-OPER-BASE-DRG-PAY) -
951700                H-OPER-BASE-DRG-PAY).
951800
951900        COMPUTE H-BUNDLE-ADJUST-AMT ROUNDED = H-BUNDLE-ADJUST-AMT.
952000
952100 8000-EXIT.    EXIT.
952200
952300***********************************************************
952400******        L A S T   S O U R C E   S T A T E M E N T   *****
